{
    "0CQ5ls3Uc2Q": {
        "title": "Antiparallel structure of DNA strands | Biology | Khan Academy",
        "thumbnail": "https://i.ytimg.com/vi/0CQ5ls3Uc2Q/hqdefault.jpg",
        "author": "Khan Academy",
        "date_of_release": "2015-07-16T17:41:07Z",
        "duration": "PT9M56S",
        "view_count": "260871",
        "like_count": "1430",
        "comment_count": "41",
        "description": "Courses on Khan Academy are always 100% free. Start practicing—and saving your progress—now:  https://www.khanacademy.org/science/ap-biology/chemistry-of-life/nucleic-acids-ap/v/antiparallel-structure-of-dna-strands\n\n\nAntiparallel structure of DNA strands (5' - 3' directionality)\n\nBiology on Khan Academy: Life is beautiful! From atoms to cells, from genes to proteins, from populations to ecosystems, biology is the study of the fascinating and intricate systems that make life possible. Dive in to learn more about the many branches of biology and why they are exciting and important. Covers topics seen in a high school or first-year college biology course.\n\nAbout Khan Academy: Khan Academy offers practice exercises, instructional videos, and a personalized learning dashboard that empower learners to study at their own pace in and outside of the classroom. We tackle math, science, computer programming, history, art history, economics, and more. Our math missions guide learners from kindergarten to calculus using state-of-the-art, adaptive technology that identifies strengths and learning gaps. We've also partnered with institutions like NASA, The Museum of Modern Art, The California Academy of Sciences, and MIT to offer specialized content.\n\nFor free. For everyone. Forever. #YouCanLearnAnything\n\nSubscribe to Khan Academy's Biology channel: https://www.youtube.com/channel/UC82qE46vcTn7lP4tK_RHhdg?sub_confirmation=1\nSubscribe to Khan Academy: https://www.youtube.com/subscription_center?add_user=khanacademy",
        "transcript": "- [Voiceover] In the video on the molecular structure of DNA we saw that DNA is typically made up of two strands where the backbone of each of the strands is made up of phosphate alternating between a-- Do some different colors. A phosphate group and then you have a sugar. You have a phosphate group. And then you have a sugar. And then you have a phosphate group. And then you have a sugar. And so I could draw the strand something like this. So phosphate and then we have a sugar. Oops, let me just draw all the phosphates ahead of time. So you have the phosphates on that end and then you have the sugars. And you see the same thing on the other strand as well. Where we have phosphate with a sugar then another phosphate then a sugar then another phosphate. Let me circle the sugars as well. So we have a sugar there and then you have the sugar there as well. So on the other strand it's also going to look like this. So let me draw the phosphates. I'm just abstracting them now. So the phosphate and then you have the sugars in between the phosphates. And what links them, you can think of them as the rungs on the ladder. These are the complementary nitrogenous bases. And the reason why we call them nitrogenous bases, I actually forgot to talk about it in the last videos, is that these nitrogens are really electronegative and they can take up more hydrogen protons. They have an extra lone pair. The nitrogens have an extra lone pair that can be used up under the right conditions to potentially sop up more hydrogen protons. Now, a lot of people ask, \"Well, if you have these nitrogenous bases here, \"why is DNA called an acid?\" Why is it called an acid?\" Well the first thing is that the basic properties of the nitrogenous base are offset to a good degree based on the fact that they're able to hydrogen bond with each other. And that's what actually forms the rungs of the ladder when these complimentary nitrogenous bases form these hydrogen bonds with each other. But even more, the reason why we call it an acid is the phosphate groups, when they're protonated, are acids. Now the reason why we tend to draw them deprotonated is they're so acidic that if you put them in a neutral solution, they're going to be deprotonated. So this is the form that you're more likely to find it in the nucleus of an actual cell. Once it's actually already deprotonated. But in general, phosphate groups are considered acidic. And if I were to draw kind of a more pure phosphate group, and I talked about this already in the last video, I would have it protonated and so I wouldn't draw that negative charge like that. So that's just a review of last time. Since I already started abstracting it, let's abstract further. So let's draw the nitrogenous bases a little bit. So I have thymine here. And I will do thymine in this green color. So this right over there is thymine. So this is attached to thymine. And the complementary nitrogenous base to thymine is adenine. Which I will do-- Let's see I'm running out of colors here. Let's see. Adenine. I'll do this in an orange color since it's got so many nitrogens on it. So actually should include that hydrogen right over there. So this right over here is adenine. Now they have these hydrogen bonds between them right over here. Because they have partially negative and positive charges on either end that are attracted to each other. And then we go to this rung, one rung below it. And what is going on? Well, let's see we have-- Now I really am running out of colors here. We have this nitrogenous base is cytosine. This nitrogenous base right over here is cytosine. This nitrogenous base here is cytosine. And it is paired up with guanine. It is paired up with guanine. I'll do guanine in this color. So it is paired up with guanine right over there. And we even saw this in the introductory video to DNA. Now you might say, \"Oh look, these two strands \"seem parallel to each other.\" And in some ways that is true. But there might be another interesting thing that you might have noticed, is the direction in which they are oriented. I guess is the best way to phrase it. And you especially see that when you focus in on the sugars. Notice the sugars over here, the deoxyriboses or the parts of the nucleotide that come from deoxyribose. You see the oxygens on the top of the ribose, on the top of these five member rings. The oxygen is on top. Well on this side, the oxygen is on the bottom. And so they're actually in different orientations. Here the oxygen is pointing up, here the oxygen is pointing down. And to get a little bit more concrete about that. We can number the carbons on the ribose to think about the directions and use those numbers of the carbons to describe the different directions. So let's number our carbons. So these are both ribose, we saw that in the molecular structure of DNA videos. When we're talking about DNA we're talking about deoxyribose. Instead of having a hydroxyl group on the number two carbon, it just has a hydrogen. So instead of having a hydroxyl group on the number two carbon, it just has a hydrogen. But let's actually number them. So this is the one prime carbon starting at the carbonyl group. Let me do that in a different color. So this is the one prime carbon. And I'm just numbering them starting at the carbonyl group. One prime. Two prime. Three prime. Four prime. Five prime. And then when you look at it as a ring, this was the one prime. This is the two prime. This is the three prime. This is the four prime. This is the five prime. Or if you were to number them on this diagram right over here, actually in the DNA molecule, this is the one prime. This is the two prime carbon. This is the three prime carbon. This is the four prime carbon. And this is the five prime carbon. And so one way to think about it is we'll go phosphate group and it's connected with what we call phosphodiester linkages. Phosphodiester linkages, that's what's essentially allowing these backbones to link up. But we're going from phosphate to five prime carbon and then through the sugar we go to the three prime carbon. And then we go to another phosphate. Then we go to the five prime carbon. Let me label that, this is the five prime carbon. Then we go to the three prime carbon. And that just comes straight out of just numbering these starting with the carbon that was a number one carbon. When it's straight chain form, it's part of the carbonyl group. But you see we're going from five. We go phosphate, five prime, three prime, phosphate, five prime, three prime, phosphate. So one way to describe the orientation is saying, \"Hey, we're going in the direction \"from five prime to three prime.\" So we could say that we're going from five prime to three prime, that way on the left-hand chain. And what are we doing on the right hand chain? Well, let's number them again. So this is the one prime carbon. Now this thing relative to this is upside down, it's inverted. So one prime. Two prime. Three prime. Four prime. Five prime. I could do it up here. One prime carbon. Two prime carbon. Three prime carbon. Four prime carbon. Five prime carbon. Here you're going from phosphate, three prime, five prime, phosphate, three prime, five prime, phosphate. So the way that the sugars are oriented if you're going from top to bottom the way we're looking here, you're going from three prime to five prime. So on the right hand side, it's three prime, five prime. And so if you wanted to draw an arrow from five prime to three prime, you could look at it like that. And so you could say these are parallel but since they are essentially pointing in different directions even though they are actually parallel, we would call this structure of DNA antiparallel. So this would be an anti... antiparallel structure of DNA. So these two strands, they're complementary. They're defined by each other. The thymine bonds with the adenine, the cytosine bonds with guanine. They are attracted to each other through these hydrogen bonds. But the two backbones, they're pointed in different directions. And now another interesting thing to think about, since we're talking about the molecular structure of DNA, is how do these things form? How did these things know to orient in this way? What plays part of that role is the fact that these phosphate groups are negative. So you think these things that have outright negative charge, they're gonna try to get as far away from each other as possible. And then when they just keep kind of orienting and getting far away from each other. And these are long. These are very, very, very, very long molecules. In the introductory video to DNA we talk about how long these chromosomes are, how many base pairs we actually have. And these are long molecules. So all of these phosphate groups on either strand, they want to get away from each other. And then these things want to get close to each other because of the hydrogen bonds. And so that's what helps form this actual ladder structure. So DNA, fascinating molecule, we could speak for days about it. It's actually mind blowing when you think about its implications for who we are. But hopefully this gives you a better sense of what it is molecularl-aly. molecularl-aly. I cannot say it. Molecularly."
    }
}