{
    "0DIn0Ws9yTE": {
        "title": "NOTION AI IS HERE – 10 Mind-Blowing Examples!",
        "thumbnail": "https://i.ytimg.com/vi/0DIn0Ws9yTE/hqdefault.jpg",
        "author": "Thomas Frank Explains",
        "date_of_release": "2022-11-19T16:37:09Z",
        "duration": "PT20M18S",
        "view_count": "765471",
        "like_count": "17101",
        "comment_count": "566",
        "description": "Notion just released a suite of AI tools that live directly inside the Notion app. Today I'll show you 10 amazing examples of what these artificial intelligence tools can do – from generating blog posts and comparison tables to even writing code!\n\nLearn more about Notion AI and join the waitlist: https://www.notion.so/product/ai\n\n🧠 ULTIMATE BRAIN (Full Second-Brain Template - use FALL50 at checkout):\nhttps://thomasjfrank.com/brain/\n\n📚 NOTION FUNDAMENTALS (Free & Complete Notion Beginner's Course)\nhttps://thomasjfrank.com/fundamentals/\n\n🖋 WRITTEN VERSION OF THIS VIDEO:\nhttps://thomasjfrank.com/notion-ai-guide/\n\n🧪 LEARN NOTION FORMULAS:\nhttp://notionformulaguide.com\n\n🛠 MORE COURSES AND RESOURCES: \nhttps://thomasjfrank.com/templates/\nhttps://thomasjfrank.com/courses/\n\n💪GET STARTED WITH NOTION:\nhttps://thomasjfrank.com/usenotion/ - (this is my referral link)\n\n🔗 More Video Links:\nGlitch: https://glitch.com/\nWolframAlpha: https://www.wolframalpha.com/\n\n🐦Connect with me:\nTwitter ➔ https://twitter.com/tomfrankly (best way to interact with me)\nInstagram ➔ https://instagram.com/tomfrankly\n\n⏱ TIMESTAMPS:\n00:00 - Intro\n00:30 - 1. Blog Post Draft\n01:36 - 2. Generate Lists\n02:44 - 3. Comparison Table\n04:08 - 4. Continue Writing\n04:33 - 5. Fix Grammar and Spelling\n05:36 - 6. Translating to Multiple Languages\n07:22 - 7. Writing Programming Code\n11:50 - 8. Solving Math Problems\n14:42 - 9. Summarizing Text\n15:48 - 10. Answering Questions\n16:53 - Waitlist, Pricing, Privacy\n18:47 - More Free Notion Resources\n\n🎞 SPECIAL THANKS\nSelect video clips supplied by Getty Images\nMountain unicycling clip by Łukasz Chornikowski, CC license: https://en.wikipedia.org/wiki/File:Mountain_unicycling.webm",
        "transcript": "- This was not on my Bingo card when I woke up yesterday morning but there is now AI inside\nof our Notion Workspaces. Yesterday notion announced the launch of Notion AI, which is a\ncurrently alpha program that adds text generation and other AI magic into\nyour notion workspace. And in this video I'm\ngonna give you 10 examples of what it can do from translating\ntext to other languages to outlining blog posts, writing pros and cons lists to even writing working\nprogramming code based on a text prompt that you give it. But let's just jump right\nin to what this can do. I'll give you more details\nabout the wait list and the costs and privacy things later on. But I wanna show you\nexactly what it can do. So here I've got a page in my Notion workspace\ncalled AI Playground. And now that I have the\nAI assist features on for my account, I now have a\nfew different AI archetypes on this new page here\nand I can even click more and see other archetypes that I can use to basically like I guess set the mode of the AI for the prompt\nthat I'm going to write. So the first example\nI'm gonna give you here is outlining a blog post. And right now my team is actually\nworking on a bit of a GTD, Getting Things Done tutorial\nfor the main channel. So let's type in what is GTD and how can I use it and\nlet's see just how good of a blog post outline\nAI can give us here. So what does GTD and how can I use it? There's our H1. GTD or Getting Things Done as a popular productivity\nmethod that helps you organize your tasks and get\nthem done more efficiently created by David Allen. That is correct. And let's see if it\ngets the steps correct. So we have the collect step, we have process step, we have organize. It does seem to have created\na pretty decent outline for blog post. So pretty interesting example. The next one I wanna show you\nis how it can generate lists. And while I'm getting that ready I do wanna mention that if\nyou are new to this channel this is a completely\nNotion focused channel. So if you are new to Notion or you want to get deeper into it and learn how to become a power\nuser, definitely subscribe. I've got database tutorials,\nI've got formula documentation. So make sure you're\nsubscribed if you aren't. Okay, so I'm gonna come down to one of these other archetypes and\nlet's use to-do list here. But I'm actually not going to\ngive it a to-do list prompt. I wanna give it just a different prompt. So let's see what happens if I tell it to give me a list of games. So give a list of the 10\nBest Super Nintendo games and if Super Mario Brothers\nThree is not on there then that'll be correct 'cause that's an NES game. (laughs) Of all time. And let's see what it gives us here. All right, we got Super Mario World, we got Legend of Zelda: Link to the Past, we got Super Metroid, Corona Trigger. And this was interesting to me because as somebody who likes\nto make listical videos or likes to just be very comprehensive with\ntopics that I'm covering my immediate thought\nwith this list generation tool here is can I use this\nto basically generate lists of things that I might not\nknow about regarding a topic? Okay, onto example number\nthree, I wanna show you how the AI can actually\ngenerate comparison tables. So let's create a page\nfor that, call it a table. And we could do this pros and cons list but I found that normally\nthis just creates like a bullet list of things. So I'm gonna do an empty page and then I'm gonna do slash help me write and this you'll notice is\na change to the block menu. If I scroll down I have all the blocks\nthat I normally have, but at the top I have\nall my AI assist options and I can go to more for all\nthese archetypes as well. So we're gonna do help me write and then I'm gonna do a comparison table. So I'm gonna tell it to create\na table actually comparing let's do mountain bikes,\nroad bikes, and I wanna see if I can get an additional\ncolumn out of it. So let's do unicycles as well. (laughs) Clearly the best option if you are a clown. Okay, so yeah, we get suspension, no on road, no on\nunicycle, that is correct. I wonder if there's like\nunicycles with suspension and if people who do like\ndownhill off road uni-cycling. (lively rock music) So yeah, you can actually generate a table with the AI and I wonder\nwhat happens if we try again if we're gonna get more detail here. Let's see, that time I actually\ndidn't even create a table. So it does look like this\nis not an exact science. Oh, here we go. The third time I tried\nit, I did get more detail. I think I got fewer rows\nbut more detail per row. And that's actually gonna lead me to the fourth example I wanna\ngo through in this video because there is a continue writing option which can add even more detail here. So the first little, I guess sub example of that feature is I'll\njust see what happens if I hit continue writing\nfor this table here. And it looks like, yeah,\nI've got a new sentence about this table here and it looks like it adds a bit more detail than was in the table earlier. Okay, so let's go into\nour fifth example here where we are going to fix some\npoor grammar and spelling. And I'm gonna need an example\nof poor grammar and spelling. So let's create a brand new page for that. (keyboard clicking) And actually (laughs) I like that better. Let's leave that there. And let's say I've had one too many before I film videos this morning. So I type a sentence like this. All right, we're keeping the er here. I is the bst spellar in the world. So now if I highlight this and I'll show you two tricks here. If I highlight it I\nnow have this AI assist little context menu. Now I've got a few\ndifferent options in here, fix spelling and grammar,\nsummarize and translate. I'll show you these in a few minutes. But also I can access the AI assist menu from the block menu here and\nI can do the exact same thing. So let's see what happens if I fix spelling and\ngrammar for this sentence. I'm the best speller in this world and I'm also very good\nat grammar with an ar. So that's pretty good. And we have a few different options here. We can try again if we don't like this but we can also replace\nthe badly spelled sentence or we can insert it beneath,\nwhich will keep our original. And sometimes you might\nactually wanna do that. Okay, example number six\nis gonna be translations and we're gonna do something here called translation roundtripping. So I'll create a page, let's call it that. And essentially we're gonna\nhave the AI translate a sentence into multiple different languages. And then from the final, and\nwe'll go back to English. And I'm gonna do it this\nway because I personally do not speak anything other than English. And I guess guess kind of\nJavaScript at this point. And I wanna see just how good it is at translating a sentence\ninto multiple languages. And then back to English. So gimme a second, I'll\ntype up a sentence here. (keyboard clicking) All right, so now I have a sentence here. If I highlight it, just like before I can go to our little AI assist menu and now I can translate it\nto any of these languages. So let's first go to Japanese\nand see what it gives us here. Like I said before I cannot read any of this for\na while back, 10 years ago, I actually was able to\nread katakana and hiragana, but all this kanji can't read it at all. So let's go with insert. So we keep our original sentence. And now let's send this\nto let's do Spanish and we'll do maybe five languages\ntotal or maybe four. And then English will be the last one. So we'll insert there. And then let's round trip that one. Or I guess translate that one to German. Just picking these at random here. Let me know if you speak\nJapanese or what was this one? Spanish or German, if these are correct. But the one I am very\ninterested in now is what happens when we basically\nsend this back to English. So my name is Thomas Frank and I like weightlifting\nand programming computers. I have special skills that\nmake me the worst nightmare of all clowns in the world. So yeah, I mean it's not\nthe exact same phrasing but it's got all the same meaning and pretty much nothing\nis lost in translation which is extremely impressive. So I'll go ahead and insert that. And let's move on to our next example which is going to be the\none I'm super excited about writing programming code.\n(epic electronic music) So let's call this one programming code. And something that I'm\nworking on right now is getting information\nfrom service called PokeAPI which you can find over at pokeapi.co. And I'm using this as the\nbasis for a notion API tutorial which we are actually editing right now, it'll be out next week. So I wanna see can Notion AI write code that will pull information about a Pokemon and can we actually run that code. So I have an instance of a glitch project. This is basically an online\nprogramming environment where you can write code\nand then actually run it. So I'm gonna delete everything that's here and we are going to write a prompt inside of Notion and see\njust what we can get. So I know that I want to make\na call to the Pokemon api I wanna get information about let's say five different Pokemon. And then I want it to\noutput the name, the weight, and the height of that\nPokemon in the terminal. So let's do help me write and I know this works\n'cause I've tested it before but we're gonna go through the prompt\nwriting process together so you can see how I'm actually\nthinking through things. So one thing that I will mention up front is you have to be a little bit specific with what you want it to\ndo because if you're very vague it may not give you a\ncode that's actually gonna work. So for example, if I write give me JavaScript code that gets information about Charizard. In my experience, this is too broad and I might actually get something here but this is like literally\njust getting information about Charizard, which means that the AI model's data\nset actually has information about Pokemon, but this isn't what I want. I want an actual JavaScript\ncode that is gonna be able to make this API call. So once again, help me write\nis what I'm gonna use here and let's get a bit more\nspecific here in JavaScript. First thing I'm gonna do\nis actually require an API calling library and I'm gonna use Axios. So let's just say define a constant Axios and set its value to require Axios. And I found that this is the only bit of like actual kind of\ncoding I have to do. The rest of it I can literally\ntype out in plain English. So the next thing I wanna\ndo is create a function. And because we're using Axios I do know it has to be asynchronous. Don't worry if you don't\nknow anything about that I'm just going to say create\nan asynchronous function and then inside it create a for loop. I basically want to create a loop that will call the Poke API five times so I can get information\nabout the first five Pokemon. So I'm gonna say create a for\nloop with an initial value of one and a max value\nof five inside that loop. Use Axios to call the Poke API and get information about the Pokemon whose number corresponds\nto the value of i. So what this should do is\nbasically call the PokeAPI for whatever the current\nnumber in the loop is, which is pretty sweet. And then finally we'll say console log that Pokemon's species.name value, it's height and it's weight. Run the function. And I want this to be\noutputted in a code block so it's formatted correctly and so I can easily copy\nand paste it into Glitch. So this is a really useful trick here. I can actually say start\nwith and then in quotes I'll do three back ticks\nand end with same thing. Quotes three back ticks. I'm gonna copy this to my\nclipboard just in case I lose it. But let's go ahead and generate\nand see what it gives us (magical bells) And look at that. So I'm not gonna go\nthrough what this code does but I'm looking at it right now and I'm fairly certain\nthat it is going to work. So let's go ahead and copy\nit and we'll go back over to Glitch and we're gonna paste\nit in our little area here. And now I'm gonna open the terminal and let's do a full\npage terminal actually. So I'll clear this. And if I run node index.js it's basically going to run the code that we have on this page here. And if it is correctly written,\nwe should get information about the first five Pokemon. So let's see what happened. And there it is, Bulbasaur,\nheight seven, weight 69. Ivysaur, height 10, weight 130. This is amazing. I mean I can literally in plain\nEnglish tell it what I want and as long as I have\na decent understanding of the structure of\nthe code, it's going to create the actual code with\nthe correct syntax for me. And that is gonna bring me onto onto I believe example number eight which is the most finicky one,\nbut it does work sometimes. And that's solving math equations. So we'll create a a\npage for math equations and if you give it a\nvery simple math equation it's going to do just fine. So value two plus five times\neight, this is fairly simple. So let's do what is this should work. Let's just see for a second Two plus five times eight\nis 42, so that's correct. But I have found in my testing that if you give it more complex problems it doesn't always know the answer and it won't tell you that\nit doesn't know the answer. It'll just very confidently\noutput like the wrong answer. So I guess right now the\nAI model is a proud member of the sub reddit confidently incorrect. And let me give you an example of that. So let's do help me write and I'm gonna do what is the, let's do surface area\nof a sphere with radius, let's do radius of 20\nand we'll generate this and then we're gonna check it\nagainst Wolfram Alpha here. So surface area of a sphere with radius 20 is 1,256 square units. So let's go over to Wolfram Alpha and type in the exact same prompt. Let me zoom in a little bit here first so you can see what I'm doing. And then we'll type in surface area. All right, and Wolfram\nAlpha is never wrong. So our result is 5026.55 or 1600 times Pi, which is not 1,256. Now one thing that notions\nCTO actually told me is that the prompt engine\ncan often be more accurate if you tell it. Let's think in steps. So let's see what happens if I tell it. Let's think in steps. It may not be correct on this run, but it should actually give me the steps that it's gonna be using. Here we go, okay. Plugging the values we get. We got the actual answer here. So it does seem that if you\ntell it to think in steps you are gonna get a more accurate answer and you can go even further than that. So let's do it one more time. I'm gonna do surface area\nof a sphere with radius 20. Let's do what is, because\nthis is Jeopardy today. I'll do let's think in steps and format the answer as a list. So this is an example of additional information you can provide to the prompt to get it to\noutput the way you want. And we should get, yep, there it is. Bullet list answers which are much easier to\nread though, once again, we got this answer that\ndoesn't really match up to the answer we're getting here. And I'm not quite sure if this is a correct answer\nthat is just expressed in a different way. I'll do it, try again here just to see or if it is actually wrong. But I guess my conclusion\nhere is sometimes you are going to get the right answer the more complex the problem the less reliable the\nanswer is going to be. Okay, let's go onto our next example which will be summarizing\nlong bits of text. And I am going to pull some\ntext from one of my blog posts and let's just copy this entire\nhow memory works subsection of the article here. So I'm gonna bring this into\nNotion, call this memory, and at the bottom of this\nwe can type slash summarize and we should get a summary of the entire article right here. So we have brain has three types of memory processes, sensory,\nworking memory, long term, and yeah, it's got a pretty decent three to four sentence\nsummary of the entire article. But what's even cooler. What's even cooler is we can\nsummarize specific sections of our text as well. So right now we've got a\nsummary of the entire article. What if I just want a\nsummary of long-term memory well I can select that text and in this AI assist area I can\nsummarize just this selection and I can get a summary\nspecifically on long-term memory. So I'll go ahead and insert right there. That's my summary and that\nmy friends is really cool. And that is actually going to bring us over to our final example,\nwhich is on my list here. And that's going to be getting answers to questions that you have\ndirectly inside a Notion. So this is kind of like a more\nof a maybe a novelty example but let's just call this\none, I dunno, oracle. And we can now use the AI assistant to get information that we\ndon't really have right now. So for example, what if\nI write something like who won the 2018 US Open Men's Division? And this should be Novak, so\nlet's see if it gets it right. Oh, and it actually gives us\nquite a bit more information than I was expecting, but\nthis is another good example of what you can do with\nthese AI generation tools. If you are in your workflow,\nyour writing stuff, and you're like, I don't know\nthe answer to this question you could always go over to\nGoogle, you could search it up but it looks like you\ncould also get pretty decent information\ndirectly from Notion AI. And that means you can\nstay in the same context you can stay in Notion you can keep doing your writing workflow and if you need to you can\ngo verify information later. But this is a great\nway to pull information in on the fly again,\nwithout leaving Notion. Let's go through a few\nof the different FAQ's and questions you might\nhave about Notion AI. So right now, again, this is an alpha so there is a wait list. Apparently the wait list\nis pretty long right now but if you wanna get access to\nit, I would recommend getting on that wait list sooner\nrather than later. And at the bottom of this page which I will have linked\nthe description down below, there is an FAQ. So a few of the questions that I had, number one is this gonna cost money. Right now they say that\nit is free and alpha but it's likely gonna\ncost extra in the future. That is not surprising to me given that I believe they are\nusing Open AI's GPT3 and that is not an open source\nmachine learning algorithm and it costs money for\nthem to use the API. So definitely makes sense but hopefully it's gonna\nbe something that's not too expensive or maybe it's\neven rolled into paid plans and you just get like a\ncertain amount of credits. That would be pretty cool. The other one I was specifically curious about myself is how is\ndata going to be used? So I'll break that down really quickly. I actually talked to\nthem directly about this. First and foremost, you\nactually have to opt-in to use AI in the first place. I'll show you that really quick. If I go over to Notion, say\nyou get access to the feature you would actually have to go to your settings and members here. And then in the upgrade or plans area there is currently this\nadd-on for Notion AI. So you actually have\nto turn it on manually if you want it to work in your workspace. And even once you do, they do state that they don't allow\nthird parties or partners to use data for training their\nmodels for any other purpose. And also they will not use your data to train their own models unless you give them\nexpress permission to do so. I was specifically looking\nfor that when I got access to this feature, so I'm\nvery glad to see it. And there are program terms, again you can check this page out\nin the description down below if you are curious about\nany of the other FAQ's here. So that is about gonna do it for this little first look video. Hopefully you found this interesting. Let me know in the comments below or over on Twitter at TomFrankly, if you have any other questions about this or Notion in general. And if you wanna learn Notion,\nif you are a Notion beginner, or you're looking to level up your skills become a Notion power user definitely go over to\nThomasJFrank.com/fundamentals. That's where you're gonna\nfind my completely open, free, and comprehensive\nNotion beginner's course that will take you from\nthe complete basics of making new pages and writing text to more advanced things like page layout and linking pages and\neven Notion databases. The Notion Databases lesson in particular is extremely comprehensive, goes through filters and relations and templates and formulas,\nall kinds of good stuff. And if you wanna go even further\nat NotionFormulaGuide.com I have complete documentation. Took me four months of my life\nthis year to write this up. Complete documentation on every\naspect of Notion Formulas. Literally every function,\noperator, and constant has a page with their syntax and example formulas and even\nan example database where you can see all the\nformulas working in action. And if you wanna make sure\nyou never miss anything that I publish about Notion, any of these kind of cool guides or new templates I'm creating you can go over to my\nwebsite, ThomasJFrank.com and in the Learn Notion\narea up here in the header there's a newsletter link and you can get on my\nNotion Tips newsletter to get infrequent updates about new templates that I'm working on, new tutorial releases, and\nlots of other cool stuff. So join that if you like. Thanks again for watching. Make sure you follow me\non Twitter @TomFrankly if you wanna interact with me there and I'll see you in the next video. (upbeat outro music)"
    }
}