{
    "1eJw-KH0wcI": {
        "title": "I've never seen Monkeypox spread like this before",
        "thumbnail": "https://i.ytimg.com/vi/1eJw-KH0wcI/hqdefault.jpg",
        "author": "Doctor Mike Hansen",
        "date_of_release": "2022-05-24T13:45:00Z",
        "duration": "PT8M58S",
        "view_count": "1322260",
        "like_count": "26555",
        "comment_count": "4982",
        "description": "Monkeypox is spreading around the globe in a way that hasn't been spread before. Scientists at CDC collaborate with the Massachusetts Department of Public Health officials to investigate a situation in which a U.S. resident tested positive for monkeypox on May 18 after returning to the U.S. from Canada. They’re also tracking multiple clusters of monkeypox cases reported this month in several countries that don’t usually report monkeypox, including Europe and North America. This is why it becomes such a concern. \n\nIt’s not clear how people in those clusters were exposed to the monkeypox virus, but some of the known causes include people who self-identify as men who have sex with men. \n\nSo let's jump into what monkeypox is and the most important things you need to know – what causes it, how to prevent it, the symptoms, and its treatment. Monkeypox is an orthopoxvirus, and it was first isolated in the late 1950s from a colony of sick monkeys. The virus itself is basically the brother of the smallpox virus, but person-to-person spread and mortality are MUCH smaller compared to smallpox. It is widely believed that the monkeypox virus has infected humans for thousands of years in sub-Saharan Africa but wasn’t actually identified as a cause of disease in HUMANS until the 1970s in the Democratic Republic of the Congo. Of all the reported 59 cases in the 1970s, 17% of them died. \n\nHow did these individuals get it? \nThey were exposed to small forest animals, like rodents, squirrels, and monkeys. \n\nWith the African outbreak from 1996 to 1998, the mortality rate was 5%. The first outbreak of monkeypox in the Western Hemisphere occurred in the United States in 2003. This virus is typically acquired through contact with an infected animal's bodily fluids or through a bite. Monkeys and humans are incidental hosts. The most likely culprit animal for being the reservoir host…rodents. Including prairie dogs.\n\nThat US outbreak in 2003 consisted of 71 cases in the US; they identified and traced the infection back to prairie dogs, which appeared to have acquired the virus from African rodents when the two species were housed at a distribution center in Illinois. It’s also important to note that a complex exposure, such as a bite wound from an infected animal, is more likely to cause severe infection than a non-complex exposure, such as simply touching the prairie dog. Although person-to-person transmission could not be excluded, most human cases had direct exposure to animals.\n\nBut unfortunately, Human-to-human transmission can also occur. One way is via large respiratory droplets. But unlike COVID, the virus isn’t really good at spreading this way. For example, droplet transmission likely requires prolonged face-to-face contact for 3+ hours. This virus is more likely to spread when close contact with infectious skin lesions, especially during sex.\n\nAll in all, most of those cases were identified in men who have sex with men. So what happens if you get the virus? The incubation time, meaning the time of exposure to the time of developing the illness, is about 12 days….but most monkeypox infections are asymptomatic. If you do get symptoms, you’re looking for fevers, chills, muscle aches, and swollen lymph nodes, with the famous painful, non-itchy rash you see in all the pictures. Typically, about 2 days after the fever starts, the rash appears on the chest and back and spreads outward to the palms and soles of the feet. The lesions are around 0.5 to 1 centimeter in size. They start out as spots and then progress over the next few weeks to form vesicles and pustules, and in the end, they scab up and slough off.\n\nDoctor Mike Hansen, MD\nInternal Medicine | Pulmonary Disease | Critical Care Medicine\nWebsite: https://doctormikehansen.com/\nContact & Social Media Links: https://doctormikehansen.com/contact/\n\n#monkeypox\n\n0:00 Introduction\n0:30 MONKEYPOX IS ONLY ENDEMIC TO PARTS OF AFRICA\n1:12 MONKEYPOX IS MUCH MORE BENIGN COMPARED TO SMALLPOX\n1:41 59 CASES THERE IN THE '70S\n1:54 AFRICA OUTBREAK 1996-1998\n3:44 SMALLOX WAS ERADICATED IN 1980\n4:06 2005-2007- 760 CASES\n4:23 5X LOWER RISK IF THEY RECEIVED SMALLPOX VACCINE\n6:09 INCUBATION -12 DAYS\n8:11 TECOVIRIMAT\n8:16 TRANSLATION: IT PREVENTS THE VIRUS SPREAD IN THE BODY\n8:27 SMALLPOX VACCINE PROTECTS AGAINST MONKEYPOX\n8:35 MODIFIED VACCINIA ANKARA (MVA)",
        "transcript": "welcome to another video dr mike hansen here and you've probably heard by now that monkey pox is making the news scientists at the cdc are collaborating with officials from the massachusetts department of public health and they're investigating a situation in which a united states resident tested positive for monkey pox virus on may 18th after they returned from a trip from canada they're also tracking multiple clusters of monkey pox cases that have been reported this month in several other countries that don't normally report monkey pox including europe and north america and for this reason it's becoming a concern now as of right now it's not clear how people in those clusters were exposed to the monkey pox virus but some of the known cases include people who identify as men having sex with men so let's jump into what monkey pox is and the most important things that you need to know like what causes it how to prevent it what are the symptoms and its treatment monkey pox it's an ortho pox virus and it was first isolated in the late 1950s from a colony of sick monkeys the virus itself is basically the brother of the smallpox virus but person-to-person spread and mortality is much smaller compared to smallpox there's two distinct strains of monkey pox that exist in different regions of africa the strain from western africa is the less virulent strain now it's widely believed that monkey pox virus has infected humans for thousands of years in sub-saharan africa but wasn't actually identified as a cause of disease in humans until the 70s and that was in the democratic republic of congo of all the reported 59 cases in the 1970s 17 of them died how did these individuals get it they were exposed to small forest animals like rodents squirrels and yes monkeys during the african outbreak that occurred from 1996 to 1998 that mortality rate was 5 the first outbreak of monkey pox virus in the western hemisphere occurred in the united states in 2003. this virus it's typically acquired through contact with an infected animal's bodily fluids or by means of a bite now monkeys and humans are incidental hosts the most likely culprit animal for being the reservoir host rodents including prairie dogs that us outbreak that occurred in 2003 consisted of 71 cases and they identified or they traced that infection back to prairie dogs which appeared to have acquired the virus from african rodents when the two species were housed together in a distribution center in illinois it's also important to note that a complex exposure for example a bite wound from an infected animal is much more likely to cause severe infection compared to a non-complex exposure such as simply touching or petting the prairie dog most of the human cases had direct exposure to animals although person-to-person transmission could not be excluded so again this was the 2003 outbreak in the united states but unfortunately human to human transmission can also occur now one way is by means of large respiratory droplets but unlike covid the virus isn't really good at spreading this way for example with droplet transmission it likely requires someone sitting face to face in close proximity like six feet or less for a period of three hours or more the virus is much more likely to spread when there's close contact with infectious skin lesions especially during sex but also it could occur where it gets in the saliva and it's in your oral mucosa there and you can use your imagination of how it could spread at that point after smallpox was eradicated the vaccine for smallpox was no longer needed but one of the added benefits of the smallpox vaccine was that it also offered protection against monkeypox but since monkeypox was very rare it was hard to justify keeping that smallpox vaccine around for that reason so the who said we'll just keep a close eye on that matter from 2005 to 2007 there were 760 confirmed human monkeypox viruses this study confirmed the concerns of increased prevalence of monkey pox due to the lack of the prior smallpox vaccination in fact those with a history of smallpox immunization had a five-fold lower risk of monkey pox infection compared to those who were unvaccinated from smallpox so now let's fast forward to july of 2021 not even a year ago there was a patient who was diagnosed with monkey pox and dallas texas after developing symptoms from his return trip from nigeria then fast forward to this month may 7th in the united kingdom there is a person identified who recently traveled from nigeria and he was confirmed monkey pox a week later six additional cases were identified in the uk but these weren't associated with recent travel to an endemic area in africa or close contact with the person known to have monkey pox portugal had five confirmed cases in more than 20 suspected cases all young men spain with eight suspected cases and there's other countries with suspected cases as well including canada australia italy and sweden these cases were not related to travel to africa and appear to be related to the outbreak in europe just recently there's a case identified in massachusetts after that person recently traveled from canada that person did not have any known travel to africa health officials in montreal they're investigating 17 suspected cases mostly men aged 30 to 50s those montreal cases did say that they found links between their suspected cases in that case in massachusetts and for those cases in canada most of them are in men having sex with men so it brings up the question is this truly a sexually transmitted disease right now we don't have any data on whether or not this is actually in seminal or vaginal fluid but no doubt that this virus spreads by means of mucous membranes skin to skin contact and it's in the saliva so you could use your imagination of how that's spreading so what happens if you get the virus well the incubation time meaning the time of exposure to the time of developing illness is about 12 days give or take but the majority of monkey pox infections are asymptomatic but if you do get symptoms you're looking at fevers chills muscle aches swollen lymph nodes in the famous painful but not itchy rash that you see in all those pictures typically about two days after the fever starts the rash appears on the chest and the back and then it spreads outward to the palms and the soles of the feet the lesions they're about point five to one centimeter in size they start out as spots and then they progress over the next few weeks to form vesicles or like blisters and pustules and in the end they scab up and slough off during that first week of the rash people are highly infectious but they can actually spread that infection up until the time where their scabs start to separate from each other people should remain isolated until those scabs start to separate but also until their throat swab pcr tests negative sometimes people do require hospitalization mainly to receive supportive therapy like iv fluids and medications to help with symptoms but most patients have mild disease and recover without any medical intervention in these new cluster of cases that are occurring this month some patients had proctitis meaning inflammation of the prostate gland some also had lesions that are only around their genitals or their perianal area or both although the clinical signs and symptoms are pretty straightforward the diagnosis can only be confirmed by means of lab testing so that way you can be sure it's not something else such as other pox viruses especially varicella meaning chickenpox are there any drugs to treat monkey pox there are some which are actually approved for treatment of smallpox based on animal models particularly the antiviral drug t-cover mat and if someone has severe disease it can be combined with another antiviral called brynsodophovir tychoviromat it's a potent inhibitor of an ortho pox virus protein that's actually required for the formation of an infectious virus particle which is required for its spread in the body so when you inhibit that protein it inhibits the spread in the body and this drug is given for 14 days previous smallpox vaccination has a significant protective effect against monkeypox virus in september of 2019 a modified vaccinia in kera vaccine was approved for prevention of smallpox and monkeypox so moving forward what are we looking at there is a risk that monkeypox could become endemic if the outbreak isn't brought under control especially if the virus spills from humans back into the local animals but overall the risk of this happening is very low"
    }
}