{
    "aGOV5R7M1Js": {
        "title": "Walter Isaacson: Elon Musk, Steve Jobs, Einstein, Da Vinci & Ben Franklin | Lex Fridman Podcast #395",
        "thumbnail": "https://i.ytimg.com/vi/aGOV5R7M1Js/hqdefault.jpg",
        "author": "Lex Fridman",
        "date_of_release": "2023-09-10T18:42:20Z",
        "duration": "PT2H7M50S",
        "view_count": "1438859",
        "like_count": "26781",
        "comment_count": "1782",
        "description": "Walter Isaacson is an author of biographies on Elon Musk, Steve Jobs, Einstein, Benjamin Franklin, Leonardo da Vinci, and many others. Please support this podcast by checking out our sponsors:\n- MasterClass: https://masterclass.com/lexpod to get 15% off\n- NetSuite: http://netsuite.com/lex to get free product tour\n- BetterHelp: https://betterhelp.com/lex to get 10% off\n- ExpressVPN: https://expressvpn.com/lexpod to get 3 months free\n- Shopify: https://shopify.com/lex to get $1 per month trial\n\nTRANSCRIPT:\nhttps://lexfridman.com/walter-isaacson-transcript\n\nEPISODE LINKS:\nWalter's Twitter: https://twitter.com/WalterIsaacson\nWalter's Instagram: https://www.instagram.com/walter_isaacson\nWalter's Website: https://isaacson.tulane.edu\nWalter's Books:\nElon Musk: https://amzn.to/48aWSZC\nThe Code Breaker: https://amzn.to/3EAa0cU\nLeonardo da Vinci: https://amzn.to/3RlFICB\nThe Innovators: https://amzn.to/45R8gs4\nSteve Jobs: https://amzn.to/3P9Ak2B\nAmerican Sketches: https://amzn.to/45LM4PN\nEinstein: https://amzn.to/3r6Ttu6\nBenjamin Franklin: https://amzn.to/44NobWW\nKissinger: https://amzn.to/3RdTA1u\nThe Wise Men: https://amzn.to/45LQDJX\n\nPODCAST INFO:\nPodcast website: https://lexfridman.com/podcast\nApple Podcasts: https://apple.co/2lwqZIr\nSpotify: https://spoti.fi/2nEwCF8\nRSS: https://lexfridman.com/feed/podcast/\nFull episodes playlist: https://www.youtube.com/playlist?list=PLrAXtmErZgOdP_8GztsuKi9nrraNbKKp4\nClips playlist: https://www.youtube.com/playlist?list=PLrAXtmErZgOeciFP3CBCIEElOJeitOr41\n\nOUTLINE:\n0:00 - Introduction\n3:00 - Difficult childhood\n20:04 - Jennifer Doudna\n23:01 - Einstein\n28:20 - Tesla\n45:24 - Elon Musk's humor\n49:34 - Steve Jobs' cruelty\n52:58 - Twitter\n1:05:07 - Firing\n1:07:52 - Hiring\n1:16:55 - Time management\n1:24:39 - Groups vs individuals\n1:28:25 - Mortality\n1:31:57 - How to write\n1:52:56 - Love & relationships\n1:57:50 - Advice for young people\n\nSOCIAL:\n- Twitter: https://twitter.com/lexfridman\n- LinkedIn: https://www.linkedin.com/in/lexfridman\n- Facebook: https://www.facebook.com/lexfridman\n- Instagram: https://www.instagram.com/lexfridman\n- Medium: https://medium.com/@lexfridman\n- Reddit: https://reddit.com/r/lexfridman\n- Support on Patreon: https://www.patreon.com/lexfridman",
        "transcript": "- I hope with my books, I'm saying, this isn't a how-to guide, but this is somebody\nyou can walk alongside. - You can see Einstein\ngrowing up Jewish in Germany. You can see Jennifer Doudna\ngrowing up, or as an outsider, or Leonardo da Vinci,\nor Elon Musk, you know, in really violent South Africa with a psychologically difficult father, and getting off the train when he goes to anti-apartheid concert with his brother and there's a man with a knife\nsticking out of his head, and they step into the pool of blood and it's sticky on their soles. This causes, you know, scars that last the rest of your life, and the question is not how\ndo you avoid getting scarred, it's, you know, how do you deal with it? - The following is a conversation\nwith Walter Isaacson, one of the greatest\nbiography writers ever, having written incredible\nbooks on Albert Einstein, Steve Jobs, Leonardo da\nVinci, Jennifer Doudna, Benjamin Franklin, Henry Kissinger, and now a new one on Elon Musk. We talked for hours on and off the mic. I'm sure we'll talk many more times. Walter is a truly special\nwriter, thinker, observer, and human being. I highly recommend people\nread his new book on Elon. I'm sure there will be\nshort-term controversy, but in the longterm I\nthink it will inspire millions of young people, especially with difficult childhoods, with hardship in their\nsurroundings or in their own minds to take on the hardest\nproblems in the world and to build solutions to those problems, no matter how impossible the odds. In this conversation, Walter\nand I cover all of his books and use personal stories from them to speak to the bigger principles of striving for greatness\nin science, in tech, engineering, art, politics, and life. There are many things in the new Elon book that I felt are best\nsaved for when I speak to Elon directly, again, on this podcast, which will be soon enough. Perhaps it's also good to mention here that my friendships, like with Elon, nor any other influence like\nmoney, access, fame, power, will ever result in me\nsacrificing my integrity ever. I do like to celebrate the good in people, to empathize and to understand, but I also like to call\npeople out on their bullshit with respect and with compassion. If I fail, I fail due to a lack of skill, not a lack of integrity. I'll work hard to improve. This is the \"Lex Fridman Podcast.\" To support it, please\ncheck out our sponsors in the description. And now, dear friends,\nhere's Walter Isaacson. What is the role of a difficult childhood in the lives of great men\nand women, great minds? Is it a requirement, is it a catalyst, or is it just a simple\ncoincidence of fate? - Well, it's not a requirement. Some people with happy\nchildhood to do quite well, but it's certainly is true that a lot of really driven people are driven because they're harnessing\nthe demons of their childhood. Even Barack Obama's\nsentence in his memoirs, which is, I think, \"Every successful man is either trying to live\nup to the expectations of his father or live down\nthe sins of his father.\" And for Elon, it's especially true 'cause he had both a violent\nand difficult childhood, and a very psychologically\nproblematic father. He's got those demons\ndancing around in his head, and by harnessing them,\nit's part of the reason that he does riskier, more\nadventurous, wilder things than maybe I would ever do. - You've written that Elon\ntalked about his father, and that at times it\nfelt like mental torture, the interaction with him\nduring his childhood. Can you describe some of\nthe things you've learned? - Yeah, well, Elon and\nKimbal would tell me that, for example, when Elon got bullied on the playground, and one day was pushed\ndown some concrete steps and had his face pummeled\nso badly that Kimbal said, \"I couldn't really recognize him,\" and he was in the hospital\nfor almost a week. But when he came home, Elon had to stand in front of his father, and his father berated\nhim for more than an hour and said he was stupid and took the side of the person who had beaten him. - That's probably one of\nthe more traumatic events of Elon's life. - Yes, and there's also Veld School, which is a sort of paramilitary camp that young South African boys got sent to. And at one point, you\nknow, he was scrawny, he has very bad at picking up social cues and emotional cues, he talks about being Asperger's, and so he gets traumatized\nat a camp like that. But the second time he\nwent, he'd gotten bigger. He had shot up to almost six feet and he'd learned a little bit of Judo. and he realized that if\nhe was getting beaten up, he might, it might hurt him, but it, he would just punch the person in the nose as hard as possible. So that sense of always punching back has also been ingrained in Elon. I spent a lot of time talking\nto Errol Musk, his father. Elon doesn't talk to Errol\nMusk anymore, his father, nor does Kimbal, it's been years. And Errol doesn't even have Elon's email, so a lot of times Errol\nwill be sending me emails. And Errol had one of those\nJekyll-and-Hyde personalities. He was, you know, a\ngreat mind of engineering and especially material science, knew how to build a wilderness\ncamp in South Africa using mica and how it\nwould not conduct the heat, but he also would go\ninto these dark periods in which he would just be\npsychologically abusive. And of course, Maye Musk says to me, his mother who divorced Errol early on, said, \"The danger for Elon is\nthat he becomes his father.\" And every now and then you've\nbeen with him so much, Lex, and you know him well. He'll even talk to you about the demons, about Diablo dancing in his head. I mean he gets it, he's self-aware. But you've probably seen him at times where those demons take over and he goes really dark and really quiet. And Grimes says, you know, \"I can tell a minute or two in advance when demon mode's about to happen,\" and he'll go a bit dark. I was, you know, here at Austin\nonce at dinner with a group and you could tell suddenly\nsomething had triggered him and he was gonna go dark. I've watched it at meetings\nwhere somebody will say, \"We can't make that part\nfor less than $200,\" or, \"No, that's wrong,\"\nand he'll berate them, and then he snaps out of it. And as you know, that\ntoo, the huge snap-out where suddenly he's showing\nyou a Monty Python skit on his phone, and he's\njoking about things. So I think coming out of the childhood, there were just many facets,\nmaybe even many personalities; the engineering mode, the silly\nmode, the charismatic mode, the visionary mode, but\nalso the demon in dark mode. - A quote you cited about\nElon's really stood out to me. I forget who it was from, but, \"Inside the man, he's\nstill there as a child. The child standing in front of his dad.\" - That was Talulah, his\nsecond wife, and she's great. She's an English actress. They've been married twice actually. And Talulah said, \"That's\njust him from his childhood. He's a drama addict.\" Kimbal says that as well. And I asked why, and Talulah said, \"You know, for him, love and family are kind of associated with\nthose psychological torments. And in many ways he'll channel.\" I mean, Talulah would be with him in 2008 when the company was going bankrupt, or whatever it may have been or later, and he would be so\nstressed, he would vomit, and then he would channel\nthings that his father had said, use phrases his father had said to him. And so she told me deep inside the man, is this man-child still\nstanding in front of his father. - To what degree is that true\nfor many of us, do you think? - I think it's true, but\nin many different ways. I'll say something personal,\nwhich is I was blessed, and perhaps it's a bit of a downside, too, with the fact that I\nhad the greatest father you could ever imagine, and mother. They were the kindest people\nyou'd ever wanna meet. I grew up in a magical\nplace in New Orleans. My dad was an engineer,\nan electrical engineer, and you know, he was always kind. Perhaps I'm not quite\nas driven or as crazed. I don't have to prove things. So I get to write about Elon Musk. I get to write about, you\nknow, Einstein, or Steve Jobs, or Leonardo da Vinci who as you know, was totally torn by demons and had different difficult\nchildhood situations, not even legitimized by his father. So sometimes those of\nus who are lucky enough to have really gentle, sweet childhood, we grow up with fewer demons, but we grow up with fewer drives and we end up maybe being Boswell\nand not being Dr. Johnson. We end up being the\nobserver, not being the doer. And so I always respect\nthose who are in the arena. I don't, you know-- - You don't see yourself\nas a man in the arena. - I've had a gentle, sweet career, and I've got to cover\nreally interesting people, but I've never shot off a rocket that might someday get to Mars. I've never moved us into the\nera of electric vehicles. I've never stayed up all\nnight on the factory floor. I don't have quite those, either the drives or\nthe addiction to risk. I mean, Elon's addicted to risk. He's addicted to adventure. Me, if I see something that's risky, I spend some time calculating, \"Okay, upside, downside here.\" But that's another reason\nthat people like Elon Musk get stuff done, and people like me write about the Elon Musks. - One other aspect of this,\ngiven a difficult childhood, whether it's Elon or da Vinci, I wonder if there's some wisdom, some advice almost that you can draw, that you can give to people\nwith difficult childhoods. - I think all of us have demons, even those of us who grew up in a magical part of New\nOrleans with sweet parents. - [Lex] Yes. - And we all have demons. And rule one in life\nis harness your demons, know that you're ambitious\nor not ambitious, you're lazy or whatever. Leonardo da Vinci knew he was\na procrastinator, you know. I think it's useful to\nknow what's eating at you, know how to harness it, also know what you're good at. I'll take Musk as another example. I'm a little bit more like\nKimbal Musk than Elon. I maybe got overendowed\nwith the empathy gene. And what does that mean? Well, it means that I was okay\nwhen I ran \"Time Magazine.\" It was a group about 150\npeople on the editorial floors, and I knew them all and\nwe had a jolly time. When I went to CNN, I was not very good at being a manager or an\nexecutive of an organization. I cared a little bit too much that people didn't get\nannoyed at me or mad at me. And Elon said that about\nJon McNeil, for example, who is president of Tesla. It's in the book, I talked\nto Jon McNeil a long time, and he says, \"You know,\nElon just would fire people, be really rough on people. He didn't have the empathy for\nthe people in front of him.\" And Elon says, \"Yeah, that's right, and Jon McNeil couldn't fire people. He cared more about pleasing\nthe people in front of him than pleasing the entire\nenterprise or getting things done.\" Being overendowed with a\ndesire to please people can make you less tough of a manager. And that doesn't mean\nthere aren't great people who are overendowed. Ben Franklin, overendowed with the desire to please people. The worst criticism of him\nfrom John Adams and others was that he was insinuating, which kind of meant he was always trying to get people to like him. But that turned out to be a good thing. When they can't figure out the\nbig state, little state issue at the Constitutional convention, when they can't figure\nout the Treaty of Paris, whatever it is, he brings people together and that is his superpower. So to get back to the lessons, you asked, and you know, the first\nwas harness your demons. The second is to know your\nstrengths and your superpower. My superpower is definitely\nnot being a tough manager. After running CNN for awhile, I said, \"Okay, I think I've\nproven I don't really enjoy this or know how to do this well.\" You know, do I have other talents? Yeah, I think I have the talent to observe people really closely, to write about it in a\nstraight, what I hope, interesting narrative style. That's a power. It's totally different from\nrunning an organization. It took me until three\nyears of running CNN that I realized I'm not\ncut to be an executive in a really high intense situations. Elon Musk is cut to be an executive in highly intense situation, so much so that when\nthings get less intense, when they actually are making enough cars, and rockets are going up and landing, he thinks of something else so he can surge and have more intensity. He's addicted to intensity\nand that's his superpower, which is a lot greater than the superpower of being a good observer. - But I think also to build on that, it's not just addiction\nto like risk and drama. There's always a big mission above it. So I would say it's an empathy towards people in the big picture. - It's an empathy towards humanity.\n- [Lex] Humanity. - More than the empathy towards the three or four humans\nwho might be sitting in the conference room with you. And that's a big deal. And you see that in a lot of people. You see it, Bill Gates or\nLarry Summers, Elon Musk, they always have empathy for\nthese great goals of humanity, and at times they can be clueless about the emotions of the\npeople in front of them, or callous sometimes. Musk, as you said, is driven by mission more than any person I've ever seen. And it's not only mission,\nit's like cosmic missions, meaning he's got three\nreally big missions. One is to make humans a\nspace-faring civilization, make us multi-planetary,\nor get us to Mars. Number two is to bring us into the era of sustainable energy, to bring us into the\nera of electric vehicles and solar roofs and battery packs. And third is to make sure\nthat artificial intelligence is safe and is aligned with human values. And every now and then I'd talk to him and we'd be talking about\nStarlink satellites or whatever, or he would be pushing the\npeople in front of him at SpaceX and saying, \"If you do this, we'll never get to Mars in our lifetime.\" And then he would give the\nlecture how important it was for human consciousness to\nget to Mars in our lifetime. And I'm thinking, \"Okay,\nthis is the pep talk of somebody trying to inspire a team, or maybe it's the type of pontification you do on a podcast.\" But on like the 20th time I watched him, I realized, \"Okay, I believe it. He actually is driven by this. - He is frustrated and angry that because of this particular\nminor engineering decision, the big mission is not\ngoing to be accomplished. It's not a pep talk, it's\na literal frustration. - An impatience, a frustration, and it's also just probably the most deeply ingrained\nthing in him is his mission. He joked at one point to\nme about how much he loved reading comics as a kid. And he said, \"All the\npeople in the comic books, they're trying to save the world, but they're wearing their\nunderpants on the outside and they look ridiculous.\" And then he paused and said, \"But they are trying to save the world.\" And whether it's Starlink in Ukraine or Starship going to Mars, or trying to get a global new Tesla, I think he's got this epic sense of the role he's gonna play in helping humanity on big things. And like the characters\nin the comic books, it's sometimes ridiculous,\nbut it also is sometimes true. - When I was reading\nthis part of the book, I was thinking of all the young people who are struggling in this way, and I think a lot of people\nare in different ways, whether they grew up without a father, whether they grew up\nwith physical, emotional, mental abuse or demons of\nany kind as you talked about. And it's really painful to read, but also really damn inspiring that if you sort of walk\nside-by-side with those demons, if you don't let that pain break you or somehow channel it, if\nyou can put it this way, that you can achieve, you can do great things in this world. - Well that's an epic view\nof why we write biography, which is more epic than\nI had even thought of. So I say thank you because in some ways what you're trying to do is say okay. I mean Leonardo, you talk\nabout being a misfit, he's born illegitimate\nin the village of Vinci, and he's gay, and he's\nleft-handed, and he's distracted, and his father won't legitimize him. And then he wanders off\nto the town of Florence and he becomes the greatest\nartist and engineer of that part of the Renaissance. I hope this book inspires. Jennifer Doudna of the\ngene editing pioneer who helps discover\nCRISPR gene editing tool, which my book, \"The Code Breaker,\" she grew up feeling like a\nmisfit, you know, in Hawaii, in a Polynesian village\nbeing the only white person, and also trying to live up\nto a father who pushed her. So if people can read the books, I should have said about Jennifer Doudna, and my point was that she was told by her school guidance counselor, \"No, girls don't do science,\" you know, \"Science not for girls. \"You're not gonna do math or science.\" And so it pushes her to say, \"All right, I'm gonna\ndo math and science-- - Just to interrupt real quick, but Jennifer Doudna, you've written an amazing book about her, Nobel Prize winner.\n- [Walter] Yeah. - CRISPR developer is just incredible, one of the great scientists\nin the 21st century. - Right, and I'm talking about when Jennifer Doudna was young and she felt really, really our of place, like you and me and a lot of people when they're feeling that\nway, they read books, they go into, they curl off with a book.\n- [Lex] Um hm. - So her father drops a book on her bed called the \"Double Helix,\" the book by James Watson on the discovery of the structure of DNA by\nhim, and Rosalind Franklin, and Francis Crick. And she realizes, \"Oh, my God, girls can become scientists. My school guidance counselor's wrong.\" So I think books, like she read this book and even if it's a comic\nbook like Elon Musk read, books can sometimes inspire you. And every one of my books is about people who were totally innovative, who weren't just smart, 'cause none of us are gonna\nbe able to match Einstein in mental processing power. But we can be as curious\nas he was, and creative, and think out of the box the way he did, or as Steve Jobs put\nit, \"Think different.\" And so I hope with my books I'm saying this isn't a how-to guide but this is somebody\nyou can walk alongside. You can see Einstein growing\nup Jewish in Germany. You can see Jennifer Doudna\ngrowing up as an outsider, or Leonardo da Vinci,\nor Elon Musk, you know, in really violent South Africa with a psychologically difficult father, and getting off the train when he goes to anti-apartheid\nconcert with his brother, and there's a man with a knife\nsticking out of his head, and they step into the pool of blood and it's sticky on their soles. This causes, you know, scars that last the rest of your life. And the question is not how\ndo you avoid getting scarred, it's, you know, how do you deal with it? - Einstein, too, one of my, and it's hard to pick my\nfavorite of your biographies, but Einstein, I mean, you\nreally paint a picture of another, I don't\nwanna call him a misfit, (both laughing) but a person who doesn't necessarily have a standard trajectory\nthrough life of success. - [Walter] Absolutely. - That's extremely inspiring. I don't know exactly what question to ask. There's a million. - Well, I'll talk about\nthe misfit for a second, 'cause, you know, we talked\nabout Leonardo being that way. You know, Einstein's Jewish in Germany at a time when it starts\ngetting difficult. He's slow in learning how to talk and he's a visual thinker, so he's always daydreaming\nand imagining things. The first time he applies\nto the Zurich Polytech, 'cause he runs away from\nthe German education system 'cause it's too much learning by rote, he gets rejected by the Zurich Polytech. Now it's the second best school in Zurich and they're rejecting Einstein. I tried to find, but couldn't, the name of the admissions counselor (Lex laughing)\nat the Zurich Polytech. - [Lex] Yeah.\n- Like, you rejected Einstein? (Lex laughing)\nAnd then he doesn't finish in the top half of his class, and once he does and he\ngoes to graduate school, they don't accept his dissertation\nso he can't get a job. He's not teaching it. He even tries about 14\ndifferent high schools or gymnasium to get a job\nand they won't take him. So he is a third-class examiner in the Swiss patent office in 1905, third class 'cause they've rejected his doctoral dissertation and so he can't be second\nclass or first class 'cause he doesn't have a doctoral degree. And yet he's sitting there in the stool in the patent office in 1905 and writes three papers that\ntotally transform science. And if you're thinking about being misunderstood or unappreciated, in 1906, he's still a third-class patent. In 1907, he still is. It takes until 1909 before people realize that this notion of the\ntheory of relativity might be correct and it might upend all of Newtonian physics. - How is it possible for\nthree of the greatest papers in the history of science to be written in one year by this one person? Is there some insights, wisdoms you draw? - Plus he had a day job as a patent examiner.\n- [Lex] Right. - And there's really three papers but there's also an addendum, 'cause once you figure out quantum theory and then you figure out relativity, and your understanding Maxwell's equations and the speed of light,\nhe does a little addendum. That's the most famous\nequation in all of physics, which is E equals MC squared. So it's a pretty good year.\n(Lex laughing) It partly starts because\nhe's a visual thinker, and I think it was helpful that\nhe was at the patent office rather than being the\nacolyte of some professor at the academy where he was\nsupposed to follow the rules. And so at the patent office doing devices to synchronize clocks 'cause the Swiss have just\ngone on standard time zones and Swiss people, as you know, tend to be rather, you know, Swiss. They care if it strikes the hour in Basel, it should do the same in\nBern at the exact instant. So you have to send a light signal between two distant clocks, and he's visualizing what's it look like to ride alongside a light beam. He says, \"Well if you catch up with it, if you go almost as fast\nit'll look stationary,\" but Maxwell's equations\ndon't allow for that. And he said, \"It's making my palms sweat that I was so worried.\" And so he finally figures out, because he's looking at these\ndevices to synchronize clocks, that if you're traveling\nreally, really fast, what's looks synchronous to\nyou, or synchronized to you, is different than for\nsomebody traveling really fast in the other direction.\n- [Lex] Yes. - And he makes the mental leap that time, that the speed of light's always constant but time is relative depending\non your state of motion. So it was that type of\nout-of-the-box thinking, those leaps, that made\n1905 his miracle year. Likewise with Musk. I mean, after General Motors and Ford, everybody gives up on electric vehicles, to just say, \"I know how\nwe're going to have a path to change the entire\ntrajectory of the world into the era of electric vehicles.\" And then when he comes back from Russia where he tried to buy a little rocket ship so he could send a experimental\ngreenhouse to Mars, and they were poking fun of him, and they actually spit on him at one point in a drunken lunch, this is very fortuitous\nbecause on the ride back home on the plane, on the, you\nknow, Delta Airlines flight, he's like doing the calculations\nof how much materials, how much metal, how much fuel, how much would it really cost. And so he's visualizing things that other people would\njust say is impossible. It's what Steve Jobs's friends called, \"The reality distortion field.\" And it drove people\ncrazy, it drove them mad, but it also drove them to do things they didn't think they\nwould be able to do. - You said \"visual thinking.\" I wonder if you've seen parallels of the different styles\nand kinds of thinking that operate the minds of these people. Is there parallels you see\nbetween Elon, Steve Jobs, Einstein, da Vinci\nspecifically in how they think? - I think they were all visual thinkers, perhaps coming from slight\nhandicaps as children, meaning, you know,\nLeonardo was left-handed and a little bit dyslexic, I think. And certainly Einstein had echolalia, he would repeat things, he was slow in learning to talk. So I think visualizing helps a lot. And with Musk, I see it all the time when I'm walking the\nfactory lines with him, or in product development where he'll look at say, the heat shield\nunder the raptor engine of a Starship booster and he'll say, \"Why does it have to be this way? Couldn't we trim it this way? Or make it, or even get\nrid of this part of it?\" And he can visualize the material science. There's small anecdotes in my book, but at one point he's on the Tesla line and they're trying to get\n5,000 cars a week in 2018. It's a life or death situation. And he's looking at the machines that are bolting something to the chassis and he insists that Drew Baglino, not Drew but Lars Moravy, one of his great lieutenants, come and they have to summon him and he says, \"Why are there six bolts here?\" And Lars and others explained, \"Well, for the crash\ntests or anything else, the pressure would be in\nthis way, so you have to,\" and they were blah blah blah blah blah. And he said, \"No, if you visualize it, you'll see if there's a crash, it would, the force would go this way and that way and it could be done with four bolts.\" Now that sounds risky and they go test it and they engineer it, but\nit turns out to be right. I know that seems minor, but\nI could give you 500 of those where in any given day he's\nvisualizing the physics of an engineering or\nmanufacturing problem. That sounds pretty mundane. But for me, if you say\nwhat makes him special, there's a mission-driven thing, I give you a lot of reasons, but one of the reasons is he cares, not just about the design of the product, but visualizing the\nmanufacturing of the product, the machine that makes the machine. And that's what we failed to do in America for the past 40 years. We outsource so much manufacturing. I don't think you can be a good innovator if you don't know how to make\nthe stuff you're designing. And that's why Musk\nputs his designer's desk right next to the assembly\nlines in the factories so that they have to\nvisualize what they drew as it becomes the physical object. - So understanding\neverything from the physics all the way up to the software, so like end-to-end. - Well having an end-to-end\ncontrol is important. Certainly with Steve Jobs, I'm looking at my iPhone\nhere, it's a big deal. That hardware only works\nwith Apple software, and for a while the iTunes\nstore and only what worked, you know, so he has an end-to-end that makes it like a zen garden in Kyoto. Very carefully curated,\nbut a thing of beauty. For Musk, when he first was at Tesla and before he was the CEO, when he was just the executive chairman and basically the finance\nperson funding it, they were outsourcing everything. They were making the batteries in Japan, and the battery pack would\nbe at some barbecue shop in Thailand and then sent to\nthe Lotus factory in England to be put into a Lotus Elise chassis. That was a nightmare, and you did not have end-to-end control of the manufacturing process. So he goes to the other extreme. He gets a factory in Fremont from Toyota, and he wants to do everything in-house, the software in-house,\nthe painting in-house, you know, the battery. He makes his own batteries. And I think that end-to-end control is part of his personality. I mean there's a... But it also what allows\nTesla to be innovative. - Yeah, I got to see\nand understand in detail one example of that,\nwhich is the development of the brain of the car in Autopilot going from MobileEye to in-house building the Autopilot system to, basically getting rid of all sensors that are not rich in data\nto make it AI friendly. Sort of saying that we\ncan do it all with vision, and like you said,\nremoving some of the bolts. So sometimes it's small things, but sometimes it's really big things like getting rid of radar. - Well, vision only, getting\nrid of radar is huge, and everybody's against it, and they're still fighting it a bit. - [Lex] Yes.\n- They're still trying to do a next generation\nsome form of radar. But it gets back to the first principles. We're talking about visualizing. Well he starts with the first principles, and the first principles are physics, involve things like, well humans drive with only visual input. They don't have radar,\nthey don't have lidar, they don't have sonar. And so there is no reason\nin the laws of physics that make it so that vision only won't be successful in\ncreating self-driving. Now that becomes an\narticle of faith to him and he gets a lot of pushback. But now, and he's by the\nway not been that successful in meeting his deadlines\nof getting self-driving. He's way too optimistic. But it was that first principles of get rid of unnecessary things. Now you would think lidar, why not use it? Like why not use a crutch? It's like, yeah, we can\ndo things vision only, but when I look at the stars at night, I use a telescope, too. Well, you could use lidar but you can't do millions\nof cars that way at scale. At a certain point you have to make it not only a good product but\na product that goes to scale. And you can't make it based\non maps like Google Maps 'cause it'll never be able to, you know, then drive from New Orleans to Slidell where I want to go when\nit's too hot in New Orleans. Take for example, full self-drive. He has been obsessed with\nwhat he calls the Robotaxi. We're gonna build the next generation car without a steering wheel.\n- Um hm. - Without pedals because it's\ngonna be full self-drive. You just summon it, you\nwon't need to drive it. Well, over and over again, all these people I've\ntold you about, you know, Lars Moravy and Drew Baglino and others, they're saying, \"Okay fine,\nthat sounds really good, but you know, it ain't happened yet. We need to build a $25,000\nmass market global car that's just normal with a steering wheel.\" And yeah, he finally turned\naround a few months ago and said, \"Let's do it.\" And then he starts focusing on how's the assembly line gonna work? How are we gonna do it? And make it the same platform for Robotaxi so you can have the same assembly line. Likewise for full self-drive. They were doing it by\ncoding hundreds of thousands of lines of code that\nwould say things like, \"If you see a red light, stop. If there's a blinking light, if there are two yellow lines do this. If there's a bike lane, do this. If there's a crosswalk, do that.\" Well that's really hard to do. Now he's doing it through\nartificial intelligence and machine learning only. FSD 12 will be based on\nthe billion or so frames from Tesla each week of\nTesla drivers and saying, \"What happened when a human\nwas in this situation? What did the human do? And let's only pick the best humans, the five-star drivers, the\nUber drivers,\" as Elon says. And so that's him changing his mind and going to first principles, but saying, \"Alright, I'm even gonna\nchange full self-driving so there's not rules-based,\nit becomes AI based. Just like ChatGPT doesn't\ntry to answer your question, who were the five best popes\nor something by (indistinct). ChatGPT does it by having ingested billions of pieces of writing\nthat people have done. This will be AI, but real\nworld done by ingesting video. - Sometimes it feels like he and others, they're building things in\nthis world successfully, are basically confidently\nexploring a dark room with a very confident, ambitious vision of what that room actually looks like. Like they're just walking\nstraight into the darkness. There's no painful toys\nor legos on the ground. \"I'm just going to walk. I know exactly how far the wall is.\" And then very quickly willing to adjust as they run into, they step on the Lego, their body is filled with a lot of pain. What I mean by that is\nthere's this kind of evolution that seems to happen where you discover really good ideas along the\nway that allow you to pivot. Like to me, since, you know, since a few years ago when you could see with Andrej Karpathy the software 2.0 evolution of Autopilot, it became obvious to me that\nthis is not about the car, this is about Optimist, the robot. This is like, if we look\nback 100 years from now, the car will be remembered as a cool car, nice transportation, but the Autopilot won't be the\nthing that controls the car. It'll be the thing that\nallows embodied AI systems to understand the world broadly, that kind of approach, and you kinda stumble into it. Will Tesla be a car company? Will it be an AI company? Will it be a robotics company? Will it be a home robotics company? Will it be an energy company? And then you kind of slowly discover this as you confidently like\npush forward with a vision. So it's interesting to\nwatch that kind of evolution as long as it's backed by this confidence. - There are a couple of things\nthat are required for that. One is being adventurous. One doesn't enter a dark room\nwithout a flashlight and a map unless you're a risk taker,\nunless you're adventurous. The second is to have\niterative brain cycles where you can process information and do a feedback loop and make it work. The third, and this is\nwhat we failed to do a lot in the United States and perhaps around the world, is when you take risks, you have to realize you're\ngonna blow things up. You know, first three rockets\nthat the Falcon Rockets that Musk does, they blow up. Even Starship three-and-a-half minutes, but then it blows up the first time. So I think Boeing and NASA and others have become unwilling\nto enter your dark room without knowing exactly where the exit is and the lighted path to the exit. And the people who created\nAmerica, whenever they came over, you know, whether the Mayflower, or as refugees from the Nazis, they took a lot of risk to get here. And now I think we have more referees than we have risk takers, more lawyers and regulators and others saying, \"You can't do\nthat, that's too risky,\" than people willing to innovate. And you need both. I think you're also right\non 50, 100 years from now, what Musk will be most remembered\nfor besides space travel, is real-world AI. Not just Optimus, the robot, but Optimus, the robot\nand the self-driving car. They're pretty much the same. They're using, you know, GPU clusters or Dojo chips\nor whatever it may be to process real-world data. We all got, and you did on your podcast, quite excited about large language model, you know, generative predictive text AI. That's fine, especially\nif you want to chitchat with your chat bot. But the holy grail is\nartificial general intelligence. And the tough part of\nthat is real-world AI, and that's where Optimist, the robot, or full self drive are, I think, far ahead of anybody else. - Well,\n(Lex chuckling) I like how you said \"chitchat.\" I would say for one of\nthe greatest writers ever, it's funny that you spoke about language and the mastery of languages\nas merely chitchat. You know, people have fallen\nin love over some words. People have gone to wars over some words. I think words have a lot of power. It's actually an interesting question where the wisdom of the\nworld, the wisdom of humanity is in the words or is in\nvisuals, in the physical. I don't really-- - [Walter] It's in mathematics. - Maybe it all boils down\nto math and in the end, this kind of discussion\nabout real-world AI versus language is all the same, maybe. I've gotten a chance\nto hang out quite a bit in the metaverse with Mr.\nMark Zuckerberg recently, and boy is the realism in there, like the thing that's coming up in the future is incredible. I got scanned in Pittsburgh for 10 hours into the metaverse and there's like a virtual version of\nme and I got to hang out with that virtual version. - Do you like yourself? - Well, I never like myself. But it was easier to like that other guy. That was interesting. I was like--\n- [Walter] Did he like you? - He didn't seem to care much. (Lex laughs) - That's the lack of the empathy gene. (Lex laughing) - But that was, you know, it made me start to question\neven more than before, like, well how important\nis this physical reality? Because I got to see, you\nknow, myself and other people in that metaverse like\nthe details of the face, all the things that you think\nmaybe if you look at yourself in the mirror are imperfections,\nall this kind of stuff. When I was looking at\nmyself and at others, all of those things were\nbeautiful and it was like, it was real, and it was intense, and it was scary because you're like, \"Well are you allowed to murder\npeople in the metaverse?\" Because like, are you allowed to... 'Cause what are you allowed to do because you can replicate\na lot of those things and you start to question what\nare the fundamental things that make life worth living\nhere as we know it as humans. - Have you talked to Elon about his views of we're living in the simulation, maybe, and how you would figure\nout if that's true? - Yes, there's a constant lighthearted but also a serious sense that\nthis is all a bit of a game. - One of my theories on\nElon, a minor theory, is that he read \"Hitchhiker's\nGuide to the Galaxy\" once too often. (Lex laughing) Yeah.\n(Lex chuckling) And as you know, there's\na scene in there that says that there's a theory about the universe that if anybody ever discovers the secrets of meanings of the universe, it will be replaced by an\neven more complex universe. And then the next line\nDouglas Adams writes is, \"And there's another theory\nthat this has already happened.\" (Lex laughing)\n- [Lex] Yeah. - So I'm not sure to\nget my head around that, but I know that Elon Musk tries to. - Well, there's a humor to that. - There's an enormous humor\nto \"Hitchhiker's Guide,\" and I really think that helped Musk out of the darkest of his periods to have sort of a sense of fun of figuring out what life is all about. - I wonder if this is a\nsmall aside, we could say, just having gotten to know Elon very well, like the silliness, the\nwillingness to engage in the absurdity of it all and have fun. What is that? Is that just a quirk of personality, or is that a fundamental aspect of a human who's running six-plus companies? - Well, it's a release\nvalve just like video games, and Polytopia, and Elden Ring\nare release valves for him. And he does have an explosive\nsense of humor, as you know. And the weird thing is when\nhe makes the abrupt transition from dark demon mode, and\nyou're in a conference room, and he has really become\nupset about something, and not only are there dark vibes, but there's dark words\nemanating, and he's saying, \"Your resignation will\nbe accepted if you die,\" you know, et cetera. And then something pops\nand he pulls out his phone, and pulls up a Monty\nPython skit, you know, like the \"School of Silly Walks,\" or whichever John Clees it was, and then he starts laughing\nagain and things break. It's almost as if he has different modes, the emulation of human\nmode, the engineering mode, the dark and demon mode, and certainly there is\nthe silly and giddy mode. - Yeah, you've actually\nopened the Elon book with the quotes from\nElon and from Steve Jobs. So Elon's quote is, \"To\nanyone I've offended, I just wanna say,\" this is on SNL, \"I just wanna say I\nreinvented electric cars and I'm sending people\nto Mars on a rocket ship. Did you also think I was going\nto be a chill normal dude?\" And then the quote from\nSteve Jobs, of course, is, \"The people who are crazy enough to think they can change the world are the ones who do.\" So what do you think is the role of the old madness and genius? What do you think of the\nrole of crazy in this? - Well, first of all, let's both stipulate that Musk\nis crazy, at times I mean, and then let's figure out, and I try to do it through storytelling, not through highfalutin preaching, where that craziness works. You know, gimme a story,\ntell me an anecdote, tell me where he's crazy. And you know, the almost final example, AI, but him shooting off\nStarship for the first time, and between an aborted\ncountdown in the shoot-off, he goes to Miami to an ad sales conference and meets Linda Yaccarino\nfor the first time, makes her the CEO. I mean there's a very\nimpulsiveness to him. Then he flies back, they launch Starship, and you realize that there's\na drive in their demons, and there's also craziness, and you sometimes wanna pull those out. You wanna take away his phone so he doesn't tweet at 3:00 a.m. You want to say, \"Quit being so crazy.\" But then you realize\nthere's a wonderful line of Shakespeare in \"Measure\nfor Measure\" at the very end. He says, \"Even the best\nare molded out of faults.\" And so you take the faults\nof Musk, for example, which includes a craziness\nthat can be endearing but also a craziness that's\njust like effing crazy, as well as this drive and demon mode. I don't know that you can take\nthat strand out of the fabric and the fabric remains whole. - I wonder, sometimes it saddens me that we live in a society\nthat doesn't celebrate even the darker aspects of crazy in acknowledging that it\nall comes into one package. It's the man in the\narena versus the critic. - And the man in the arena\nversus the regulator, and, to make it more prosaic. (Lex laughing) - Well let me ask about, not\njust the crazy but the cruelty. You've written when\nreporting as Steve Jobs, Woz told you that the\nbig question to ask was, \"Did he have to be so\nmean, so rough and cruel, so drama addicted?\" What is this answer for Steve Jobs? Did he have to be so cruel. - For Jobs? I asked Woz at\nthe end of my reporting, 'cause that's what he\nsaid at the beginning. We're doing the launch of, I think, the iPad two, it may have been. Steve is emaciated because,\nyou know, he's been sick. And so I say to Woz, \"What's\nthe answer to your question?\" And he said, \"Well, if I\nhad been running Apple, I would've been nicer to everybody. Everybody got stock ops and\nwe'd been like a family.\" And then I, I don't know if you know Woz, but he was like a teddy bear. He paused, he smiled and he said, \"But if I had been running Apple, I don't think we would've done\nthe Macintosh or the iPhone.\" So yeah, you have to sometimes be rough. And Jobs said the same\nthing that Musk said to me, which is he said, \"People like you love\nwearing velvet gloves.\" Now I don't know\n(Lex chuckling) that I've worn velvet gloves often,\n(Lex laughing) but you like people to like you. You like to sweet talk\nthings, your sugarcoat things. He says, \"I'm just a working class kid and I don't have that luxury. If something sucks, I\ngotta tell people it sucks, or I got a team of B players.\" Well Musk is that way as well, and it gets back to what I said earlier, which is yeah, I probably\nwould wear velvet gloves if I could find them at my haberdasher.\n(Lex laughing) And I do try to sugarcoat things. but when I was running CNN-- - [Lex] Yeah. - it needed to be reshaped, it needed to be broken, it needed to have certain things blown up. - [Lex] Yeah.\n- And I didn't do it. - [Lex] Yeah.\n- You know, so bad on me. But it made me realize, \"Okay, I'll just write about\nthe people who can do it.\" - Well that thing of saying,\nI think probably both of them, but Elon certainly saying things like, \"That is the stupidest\nthing I've ever heard.\" - [Walter] Um hm. By the way I've heard Jeff Bezos say that. I've heard Bill Gates say that. I've heard Steve Jobs say it. I've heard Steve Jobs\nsay it about a smoothie. They were making it at\nWhole Foods or something. (Lex laughing)\nPeople, they used the word stupid really often.\n- [Lex] Yeah. - And you know who else\nused it? Errol Musk. He kept making Elon stand\nin front of him and saying, \"That's the stupidest thing.\nYou're the stupidest person. You'll never amount to anything.\" I don't know, you know, as Jon McNeil, the president of Tesla said,\n\"Do you have to be that way?\" Probably not. There are a lot of successful\npeople who are much kinder, but it's sometimes necessary to be much more brutal and honest, brutally honest, I would say, than people like, who are,\nwin Boss-of-the-Year trophies. - Well as you said, this kind of idea did also send a signal, this idea of Steve Jobs of A players, it did send a signal to everybody. It was a kind of\nencouragement to the people that are all in. - Right, and that happened at Twitter. When we went to Twitter headquarters the day before the takeover, he was having Andrew and James, his two young cousins, and other people from the Autopilot team\ngoing over lines of code. And Musk himself sat there with a laptop on the second floor of the building looking at the lines of\ncode that had been written by Twitter engineers, and they decided they were\ngonna fire 85% of them because they had to be all in. And this notion of psychological safety, and mental days off, and working remotely, he said either... And then it came up, actually one of his, I think it was one of the\ncousins or maybe Ross Nordeen came up with the idea of,\n\"Let's not be so rough and just fire all these people. Let's ask 'em, 'Do you\nreally wanna be all in? 'cause this is gonna be\nhardcore, it's gonna be intense, you get to choose. But by midnight tonight, we\nwant you to check the box. I'm hardcore all in, I'll be\nthere in person, I'll work, you know as much, or that's not for me. I've got a family, I got work balance.'\" And you got different\ntype of people that way and different stages of their life. I was a little bit more\nhardcore and all in when I was in my 20s than when I was, you know, in my 50s. - Yeah, and you write about this, it's a really nice idea actually that there's two camps\n- [Walter] Um hm. - and you find out, I\nwonder how true this is. It rings true that you\ncan just ask people, \"Which camp are you in? Are you the kind of person\nthat prides themselves, that enjoy staying up till 2:00 a.m. programming or whatever? Or do you see the value\nof unquote unquote, you know, life, work-life\nbalance,\" all this kind of stuff. And it's interesting, I mean you, like you could, people\nprobably divide themselves in different stages in life, and you could just ask them and it makes sense for certain companies in certain stages of their\ndevelopment to be like, \"We only want--\"\n- Or certain teams. It doesn't even have\nto be a whole company. And you're right, it goes back to what I\nwas saying about rule. The first secret is sort of know thyself, obviously comes from Plato and everything comes\nfrom Plato and Socrates. But, and decide in this stage of my life, am I, do I wanna be a hackathon all in all night and change the world? Or do I want to bring wisdom and stability but also have balance? I think it's good to\nhave different companies with different styles. The problem was Twitter\nwas at almost one extreme with yoga studios, and\nmental health days off, and enshrining psychological safety as one of the mantras that people should never feel\npsychologically threatened. And he, I remember the\nbitter laugh he unleashed when he kept hearing that word. He said, \"No, I like the words hard core. I like intensity. I like a intense sense of urgency as our operating principle.\" Well yeah, there are\npeople that way as well. So know who you are, and know what type of\nteam you wanna build. - Versus psychological safety\nand too many birds everywhere. - Oh yeah, a lot of times Musk did things and I go, \"What the hell?\"\n- [Lex] Yeah. - And among them was\nchanging the name Twitter and getting rid of the birds. Hey man, there's a lot\ninvested in that brand. But when I watched him he thought, \"Okay, these sweet little chirpy birds tweeting away in the name Twitter, it's not hardcore, it's not intense.\" And so for better and for worse, I think he's taking X\ninto the hardcore realm with people who post hardcore things, with people with hardcore views. It's not a polite playpen for the blue-checked anointed elite. And I thought, \"Okay,\nthis is gonna be bad. The whole thing's gonna fall apart.\" Well it has had problems, but the hardcore intensity of it has also meant that there's\nnew things happening there. So it's very Elon Musk to not like this sweetness of birds chirping and tweeting and saying, \"I want something more hardcore.\" - As you've written in referring to the previous Twitter CEO, Elon said, \"Twitter needs a fire breathing dragon.\" I think this is a good opportunity to maybe go through some\nof the memorable moments of the Twitter saga as\nyou've written about extensively in your book.\n- [Walter] Um hm. - Like from the early days of\nconsidering the acquisition to how it went through to the details of, like you mentioned, the engineering teams. - Well, at the beginning of 2022, he was riding high, but as we say, he's a drama addict. He doesn't like to coast. And you know, Tesla\nsold a million vehicles, I think 33 boosters had, you know, Falcon 9's had been shot\nup and landed safely in the past few months, and he was the richest person on Earth, and Time's person of the year. And yet he'd said, you know, \"I'm still wanna put all\nmy chips back on the table. I want to keep taking risks. I don't wanna savor things.\" He had sold all of his houses. So he started secretly\nbuying shares of Twitter. January, February, March, becomes public, at a certain point he has to declare it. And we were here in Austin at\nGigafactory on the mezzanine and he was trying to figure out, \"Well, where do I go from here?\" And at that time, it was early April, they were gonna offer him a board seat, and he was gonna do a standstill agreement and stop at 10% or something. And I remember, you know,\nwe were standing around, it was Luke Nosek, whom you know well, Ken Howery, some of his\nfriends on that mezzanine here, and all afternoon and\nthen late into the evening at dinner is like, \"Should we do this?\" And I didn't say anything,\nI'm just the observer, but everybody else is saying, \"Excuse me, why do you\nwant to own Twitter?\" (Lex chuckling)\nAnd Griffin, his son, joined at dinner, and Maye for some reason was in town. And like everybody says, \"No, we don't use Twitter.\nWhy would you do that?\" And Maye said, \"Well, I use Twitter.\" And then it is almost like, okay, the demographics are\npeople my age or Maye's age. And so it looked like he\nwasn't gonna pursue it. And they offered him a board seat, and then he went off to Hawaii\nto Larry Ellison's house, which he sometimes uses. He was meeting a friend,\nAngela Bassett, an actress. And instead of enjoying\nthree days of vacation, he just became supercharged and started firing off text messages, including the fire breathing dragon one. I think, you know, he used\nthat phrase a few times that Parag wasn't the person who was going to take\nTwitter to a new level. And then by the time he gets to Vancouver where Grimes meets him, they stay up all night playing Elden Ring. He was doing a Ted Talk. And then at 5:30 he finishes\nplaying the Elden Ring and sends out that, \"I've made an offer.\" Even when he comes back, people are trying to intervene and say, \"Excuse me, why are you doing it?\" And so it was a rocky period\nbetween late April and October when the deal closes. And people ask me all the time, \"Well, did he wanna get out of the deal?\" I said, \"Which Elon are you talking about at what time of day?\"\n- [Lex] Yeah. - Because there'll be times in the morning when he'd say, \"Oh, the Delaware court's gonna force me to do it, it's horrible.\" Talk to his lawyers,\n\"You can win this case, get me out of it.\" He met here in Austin with three\nor four investment bankers, Blair Effron at Centerview,\nBob Steel at Perella Weinberg, and they offered him options,\n\"Do you wanna get out? Do you wanna stay in? Do you wanna reduce the price?\" And I think his, he was mercurial. There were times he would\ntext me or say to me, \"This is gonna be great. It's gonna be the accelerant to do X.com the way we thought about 20 years ago.\" And so it's not until\nthey finally tell him at the beginning of October, right when Optimist, the robot is being unveiled in California actually, that the lawyers say, \"You're not gonna probably win this case. Better go through with the deal.\" And by then he's not only\nmade his peace with it, he's kind of happy with it at times. Eventually the deal is gonna close on a, I think a Friday morning,\nI have it in the book, and we're there on Thursday and he's wandering around looking at the Stay Woke tee-shirts and psychological safety\nlingo they're all using. And he and his lawyers and bankers hatched a plan to do a flash close. And the reason for that\nwas if they closed the deal after the markets had closed for the day, and he could send a letter\nto Parag and to others firing them, quote for cause, and this'll be something the courts will have to figure out, then he could save 200 million or so. And it was both the money,\nbut for him, a matter, I won't say of principle, but of, \"Hey, they misled me about the numbers. I got forced into doing it. So I'm gonna try this jujitsu maneuver and be able to get some money out of 'em.\" Then when he takes over,\nit's kind of a wild scene. Him trying to decide in\nthree different rounds how to get the staff down\nto 15% of what it was. Him deciding on Christmas Eve after he'd been at a\nmeeting where they told him, \"We can't get rid of that\nSacramento server farm because it's need of a redundancy,\" and he says, \"No, it's not.\" And he's flying here to\nAustin and young James says, \"Why don't we just do it ourselves?\" And he turns the plane around, they land in Sacramento and\nhe pulls him out himself. So it was a manic period. - We should also say\nthat underneath of that, there was a running desire to, or a consideration to\nperhaps start a new company, to build a social media\ncompany from scratch. - Well, Kimbal wanted to do that, and Kimbal here at a wonderful restaurant in Austin at lunch is like, \"Hey, why are you buying Twitter? Let's start one from scratch\nand do it on the blockchain.\" - [Lex] Yes. - Now it took them a\nwhile and you can argue it one way or the other, to come to the conclusion\nthat the blockchain was not fast enough in\nresponsive time enough to be able to handle a billion tweets, you know, in a day or so. He gets mad when they\nkeep trying to get him to talk to Sam Bankman\nFried, who's trying to say, \"I'll invest, but we have\nto do it on the blockchain.\" Kimbal is still in favor\nof starting a new one and doing it on blockchain-based. In retrospect, I think\nstarting a new media company would've been better. He wouldn't have had the\nbaggage or the legacy that he's breaking now in\nbreaking the way Twitter had been. But it's hard to have\nmillions and million, hundreds of millions of true, true users, not just trolls, and start from scratch as others have found, as\nMacedon and BlueSky and Threads, and I mean Threads even had a base, so it would've been hard. - Yeah, and to do that in the way he did requires another part that you write about with the Three Musketeers\nand the whole engineering, the firing and the\nbringing in the engineers to try to sort of go hardcore. So there's a lot of\ninteresting sort of questions to ask there, but the high level, can you just comment about\nthat part of the saga, which is bringing in the engineers and seeing like what can we do here? - Right, he brought in the engineers and figured that the amount of people doing Tesla full self-driving Autopilot and all the software there was about one-10th of what was\ndoing software for Twitter, and he said, \"This can't be the case.\" And he fired 85% in\nthree different rounds. The first was just firing people because they looked at the coding and they had a team of people\nfrom Tesla's Autopilot team grading the codes of all that was written in the past year or so. Then he fired people, you know, who didn't seem to be\ntotally all in or loyal, and then another round of layoffs. So, at each step of the way, almost everybody said, \"That's enough, it's going to destroy things.\"\n- [Lex] Yeah. - From Alex Spiro, his\nlawyer, to Jared Burchell he's like, \"Whoa, whoa, whoa\" you know. And even Andrew and\nJames, the young cousins who are tasked with making a list and figuring out who's good or bad, say, \"We've done enough. We're going to be in real trouble.\" And they were partly right. I mean there was degradation\nof the service some, but not as much as half the services I use half the time, you know? And I wake up each morning and hit the app and okay, still there. - Well, do you think, was that too much? - I think that he has an algorithm\nthat we mentioned earlier that begins with question\nevery requirement, but step two is delete, delete, delete, delete every part there. And then a corollary to\nthat is if you don't end up adding back 20% of what you deleted, then you didn't delete\nenough in the first round 'cause you were too timid. Well, so you asked me did he overdo it? He probably overdid it by 20%, which is his formula, and they're probably trying to hire people\nnow to keep things going. - But it sends a strong signal to people that are hired back or the people that are still there, the A-player idea.\n- Yeah. And what Steve Jobs and many\nother great leaders felt, and certainly Bezos, and certainly in the early days of\nMicrosoft, Bill Gates, it was hardcore only A players. - So how much of Elon's\nsuccess would you say Elon's and Steve Jobs's success, is the hiring and managing of great teams? - When I asked Steve Jobs at one point, \"What was the best\nproduct you ever created?\" I thought he'd say maybe the Macintosh or maybe the iPhone. He said, \"No, those products are hard. The best thing I ever created was the team that made those products.\" And that's the hard\npart is creating a team. And he did, you know,\nfrom Jony Ive to Tim Cook and Eddie Cue and Phil Schiller. Elon has done a good\njob bringing in people. Gwynne Shotwell,\nobviously, Linda Yaccarino, she's, you know, can navigate\nthrough the current crises. Certainly stellar people at SpaceX like Mark Juncosa, and then at Tesla, like Drew Baglino and Lars Marovy, and Tom Zhu and many others. He's not as much of a team collaborator as say Benjamin Franklin, who by the way, that's the best team ever created, which is the founders. And you had to have really smart people\n- [Lex] Yes. - like Jefferson and Madison and really passionate\npeople like John Adams and his cousin Samuel and really a guy of high rectitude like Washington. But you also needed a Ben Franklin who could bring everybody together and forge a team out of them and make them compromise with each other. Musk is a magnet for awesome talent. - Magnet, interesting. But there's like the priorities of hiring of based on excellence,\ntrustworthiness and drive. These are things you've described. - [Walter] Yeah.\n- Throughout the book. I mean there is a pretty concrete and rigorous set of ideas based on which the hiring is done. - Oh yeah, and he has a very\ngood spidey intuitive sense, just looking at people who could, I mean not looking at\nthem but studying them, who could be good. One of his ways of operating is what he calls a skip level meeting. And let's take a very specific\nthing like the Raptor engine, which is powering the Starship\nand it wasn't going well. It looked like a spaghetti bush and it was gonna be hard to manufacture. And he got rid of the people who were in charge of that team. And I remember that he\nspent a couple of months doing what he called skip level, which means instead of meeting\nwith his direct reports on the Raptor team, he would meet with the\npeople one level below them. And so he would skip a\nlevel and meet with them. And he said, this is, \"And I'd just ask 'em what they're doing and I drill them with questions,\" and he said, \"and this is how I figure out who's going to emerge.\" He said it was particularly difficult, I was sitting in those meetings. 'cause people were wearing masks. It was during the height of COVID and he said it made it a\nlittle bit harder for him because he has to get the input. But I watched as a young kid, dreadlocks, named Jacob McKenzie, he's in the book, is sitting there and he is a bit like you, engineering mindset, speaks\nin a bit of a monotone. Musk would ask a question\nand he would give an answer and the answer would be\nvery straightforward, and he didn't, you know, get rattled. He was like this. And Musk said one day,\ncalled him up at 3:00 a.m., well I won't say 3:00\na.m. but after midnight said, \"You still around?\" Jake said, \"Yeah, I'm still at work.\" And he said, \"Okay, I'm gonna make you in charge\nof the team building Raptor.\" And that was like a big surprise. But Jacob McKenzie has now\ngotten a version of Raptor and where they're building\nhim at least one a week and they're pretty awesome. And that's where his\ntalent, Musk's talent, for finding the right\nperson and promoting them, that's where it is. - And promoting it in\na way where it's like, here's the ball, here catch. - [Walter] Yeah. Yeah. - And you run with it. I've interacted with quite a few folks from even just the Model X all throughout where\npeople, you know, on paper don't seem like they would\nbe able to run the thing, and they run it extremely successfully. - And he does it wrong sometimes. He's had a horrible track record with the solar roof division. Wonderful guy named Brian\nDow, I really liked him. And when they were doing\nthe battery factory surge in Nevada, Musk got rid\nof two or three people and there's Brian Dow,\ncan do, can do, can do. Stays up all night and he\ngets promoted and runs it. And so finally Musk goes\nthrough two or three people running the solar roof division, finally calls up Brian Dow. I was sitting in Musk's\nhouse in Boca Chica, that little tiny two bedroom he has, and he offers Brian Dow the\njob of running solar roof. And you know, Brian there, \"Okay, can do, can do.\" And two or three times Musk insisted that they install a solar roof in one of those houses in Boca Chica. This is this tiny village\nat the south end of Texas. And late at night. I mean I'd have to climb\nup to the top of the roof on these ladders and\nstand on this peaked roof as Musk is there saying, \"Why do we need four screws\nto put in this single leg?\" And Brian was just sweating\nand doing everything. But then after a couple of\nmonths it wasn't going well and boom, Musk just fired him. So I always try to learn what is it that makes those who stay thrive? - What's the lesson\nthere? What do you think? - Well, I think it's self-knowledge like an Andy Krebs or others. They say, \"I am hardcore. I really want to get a rocket to Mars and that's more important\nthan anything else.\" One of the people, I think it's Tim Zaman, I hope when he hears this, I'm getting him the right person who, you know, took time, he was working for Tesla Autopilot and it was just so intense. He took some time off and\nthen went to another company. He said, \"I was burned out at Tesla, but then I was bored at the next place. So I called,\n(Lex laughing) I think it was Ashok at Tesla,\nsaid, 'Can I come back?'\" He said, \"Sure.\"\n- [Lex] Yeah. - He said, \"I've learned about myself, I'd rather be burned out than bored.\" (Lex laughing)\n- That's a good line. Well, can you just linger\non one of the three that seem interesting to\nyou in terms of excellence, trustworthiness, and drive? Which one do you think\nis the most important and the hardest to get at? The trustworthiness is an interesting one, like are you ride or die kind of thing? - Yeah, I think that\nespecially when it came to taking over Twitter, he thought half the people\nthere were disloyal. - [Lex] Yeah.\n- And he was wrong. About two-thirds were disloyal, not just half.\n(Lex laughing) And it was how do we weed out those? And he did something and made\nthe firing squad, I call it, or the Musketeers, I think\nis my nickname for them, which is, you know, the young cousins and two or three other people, he made them look at the Slack messages these people had posted,\neverybody at Twitter had posted, and they went through\nhundreds of Slack messages. So if anybody posted\non the internal Slack, \"You know, that jerk, Elon\nMusk, is gonna take over and I'm afraid that he's\na maniac or something,\" they would be on the list\nbecause they want all-in loyal. They did not look at\nprivate Slack messages. And I guess people who are posting on a corporate Slack board should be aware that your company can look at them. But that's more than I would've done or most people would've done. And so that was to figure out who's deeply committed and loyal. I think that was mainly\nthe case at Twitter. He doesn't sitting\naround at SpaceX saying, \"Who's loyal to me?\" At other places it's excellence, but that's pretty well a given. Everybody is like a Mark\nJuncosa, just whip smart. It's are you hardcore and all in? Especially--\n- [Lex] Yeah. - If you've got to move\nto this spit of a town in the south tip of\nTexas called Boca Chica, you know, you gotta be all in. - Yeah. And that's the drive, the last piece. So you, in terms of collaborating, one of the great teams of all time, (Lex chuckling)\nBen Franklin, I like that, thought it was the\nBeatles but Ben Franklin is pretty good.\n- [Walter] Oh, no, no, no. - I'm sorry.\n- Yeah. - [Lex] Sorry to offend you. - Read the Constitution\nthen read Abbey Road. (Lex laughing)\nLook at Abbey Road. They're both good but they're\nin a different league. - Yeah, different league. Okay so one of the many\nthings that comes to mind with Ben Franklin is\nincredible time management. - [Walter] Um hm. - Is there something you could say about Ben Franklin and about Steve Jobs? I think interesting with Elon is that he, as you write, runs six companies. It depends upon how you count Starlink 'cause it's own thing. I don't know.\n- [Walter] Yeah. - What can you say about these people in terms of time management? - Well, Musk is in a league of his own in the way he does it. First of all, Steve Jobs had to run Pixar and Apple for a while, but Musk every couple of\nhours is switching his mindset from how to implant the Neuralink chip and what will the robot that\nimplants it in the brain look like and how fast\ncan we make it move. And then the heat shield on the Raptor or switching to human\nimitation, machine learning, full self-drive. On the night that the Twitter\nboard agreed to the deal, this is huge around the world. I'm sure you remember,\nlike Musk buys Twitter. It wasn't when the deal closed, it was when the Twitter\naccepted his offer. And I thought, \"Okay.\" But then he went to Boca\nChica, to South Texas, and spent time fixating on, if I remember correctly, a valve in the Raptor engine\nthat had a methane leak issue and what were the possible ways to fix it. And all the engineers in that room, I assume are thinking about,\n\"This guy just bought Twitter. Should we say something?\"\n- [Lex] Yeah. - And he's like... And then he goes with Kimbal to a roadside joint in Brownsville and just sits in the\nfront and listens to music with nobody noticing\nreally him being there. One of the things that's\none of his strengths and sort of weaknesses in\na way is in a given day, he'll focus serially, sequentially\non many different things. He will worry about uploading video onto x.com or the payment system, and then immediately\nswitch over to some issue with the FAA giving a permit for Starship, or with how to deal with\nStarlink and the CIA. And when he's focused\non any of these things, you cannot distract him. And it's not like he's\nalso thinking about, \"I'm dealing with Starlink, but I've gotta also worry\nabout the Tesla decision on the new $25,000 car.\" Now he'll, in between these sessions, process information, then let off steam, and for better or worse, he lets off steam by either playing a friend in Polytopia or fire off some tweets, which is often not a healthy thing, but it's a release for\nhim and he doesn't... I once said he was a great multi-tasker and that was a mistake. People corrected me. He's a serial tasker, which means focuses intensely\non a task for an hour, almost has a, what do they\ncall it at restaurants where they give you a-- - [Lex] Palate.\n- Palate cleanser. (both laughing)\n- [Lex] Yeah. - He does some palate\ncleanser with Polytopia. - [Lex] Yeah.\n- And then focuses on the next task. - I mean, is there some\nwisdom about time management that you can draw from that? - There's some things that these people do and you say, \"Okay, I can be that way. I can be more curious. I can question every rule and regulation.\" I just don't think anybody should try to emulate Musk's time management style because it takes a certain set of teams who know how to deal with everything else other than the thing he's focusing on, and a certain mind that can shift, just like his moods can shift. You and I go through transitions. And also if I'm thinking about what I'm gonna say on this podcast, I'm also thinking about\nthe email my daughter just sent about a house\nthat she's looking, you know, and I'm, I'm multitasking. He doesn't actually do that. He single tasks sequentially\nwith a focus that's hardcore. - I don't know, I think there's wisdom to draw from that to like, first of all, he makes me... Ben Franklin makes me feel that way, that there's a lot of hours in the day, there's a lot of minutes in the day. Like there's no excuse\nnot to get a lot done, and then requires just an extreme focus, an extreme focus,\n- [Walter] Yes. - and like an urgency. - I think the fierce urgency that drives him is important. And it's sometimes ginned up, like I say, the fierce urgency of getting to Mars. And on a Friday night at\nthe launchpad in Boca Chica at 10:00 p.m., there are\nonly a few people working 'cause it's a Friday night and they're not supposed to launch for another eight months. And he orders a surge. He says, \"I want 200\npeople here by tomorrow working on this pad. We have to have a fierce sense of urgency or we will never get to Mars.\" - That sense of urgency, you know, is also a vibrancy that's like really taking on life fully. I mean that, to me\nthat's the lesson is like even the mundane can be\nfull of this just richness and like you just have to\nreally take it in intensely. So like the switching enables\nthat kind of intensity, 'cause most of us can't hold\nthat intensity in any one task for a prolonged period of time. Maybe that's also a lesson. - Right, and I guess it goes\nback to also know who you are, meaning--\n- [Lex] Know who you are. - There are people who\ncan focus intensely, and there are people who can see patterns across many things. Look, Leonardo da Vinci, he was not all that focused. He was easily distracted.\n- [Lex] Procrastinated. - It's why he has more\nunfinished paintings than finished paintings in his canon.\n- [Lex] Yeah. - But his ability to see\npatterns across nature and to, in some ways, process,\nprocrastinate, be distracted, that helped him some, but Musk is not that way. Every few months there's a new surge. You don't know where it'll be, but you'll be on solar\nroofs and all of a sudden we'll have a surge and there has to be, you know, 100 solar roofs built, or this has to be done by tomorrow, or make a Starship dome by dawn, and surge and do it. And there are people\nwho are built that way. It is inspiring. But also let's appreciate, you know, that there are people\nwho can be really good, but also can savor the success, savor the moment, savor\nthe quiet sometimes. Musk's big failing is he can't savor the moment or success. And that's the flip side\nof hardcore intensity. - In \"Innovators,\" another\nbook of yours that I love, you write about individuals\nand about groups. So one of the questions\nthe book addresses is, is it individuals or is it groups that turn the tides of history? - When Henry Kissinger was\non the shuttle missions for the Middle East peace is\nthe first book I ever wrote. He said, \"When I was a\nprofessor at Harvard, I thought that history was determined by great forces and groups of people. But when I see it up close, I see what a difference\nan individual can make.\" He's talking about Sadat and Golda Meir, probably talking about himself too, or at least in his mind. And we biographers have this dirty secret that we know we distort history a bit by making the narrative too\ndriven by an individual. But sometimes it is\ndriven by an individual. Musk is a case like that. And sometimes, as I did\nwith \"The Innovators,\" there's teams and people\nwho build on each other, and Gordon Moore and Bob Noyce, then getting Andy Grove\nand doing the microchip, which then comes out and Wozniak and Jobs find it at some electronic store and they decide to build the Apple. And so sometimes there are flows of forces and groups of people. I guess I err a little bit on the side of looking at what a\nSteve Jobs, and Elon Musk, and Albert Einstein can do. And I also try to figure out\nif they hadn't been around, would the forces of history\nand the groups of people have done it without them? That's a good historical question, as, you know, somebody who loves history. And you think about special relativity, one of the 1905 papers. Even after he writes it, it's four years before people\ntruly get what he's saying, which is it's not just how\nyou observe time is relative, it's time itself is relative. And on the general theory, which he does a decade later, I'm not sure we would gotten that yet. What about moving us\ninto the era of an iPhone in which it's so beautiful\nthat you can't live without 1,000 songs in your pocket, email, and the internet in\nyour pocket and the phone? There are a lot of brain-dead people from Panasonic to Motorola\nwho didn't get that, and it may have been a while. I certainly think it's true of\nthe era of electric vehicles. Jim and Ford, all the great people there, they crushed the bolt,\nand I mean that literally. They ended up smashing 'em because they decided to discontinue it. Likewise, nobody was sending up rockets. Our space shuttle was about\nto be grounded 12 years ago. And so Musk does things, and there'll be people\nwho say and read the... Well if they read the book\nthey'll see the full story. But they'll say it wasn't\nMusk who did Tesla, it was Martin Eberhard or Marc Tarpenning. No, no, no. You know, there were people\nwho had helped create, you know, the shells of\ncompanies and other things, and they were all deserved\nto be called co-founders. But the guy who actually gets us to a million electric\nvehicles a year is Elon Musk, and without him, I don't think we... Look, if anybody, five years from now, buys a car that's gasoline-powered, we'll think, \"That's quaint.\" You know, \"That's odd.\" I mean suddenly we've changed. We're not gonna do it. 90% of that is Elon Musk. - We're all mortal. When and how do you think Elon will retire from the insanely productive\nschedule he's on now? - I would think that he\nwould hate to retire. I think that he can't\nlive without the pressure, the drama, the all-in feeling. It's never been anything that seemed to have crossed his mind. He's never said, \"Maybe I\nlove Larry Ellison's house on the beach in Hawaii. Maybe I should spend time in doing.\" Instead he says things like, \"I learned early on that\nvacations will kill you.\" (both laughing) He gets malaria when he goes on one... I mean he goes on vacation at one point and they oust him from PayPal, and then he goes to Africa at one point, he gets malaria. He says, \"I've learned, vacations kill you.\"\n- Lesson learned. Well it's interesting because the projects are 100-plus year projects, many of these.\n- One of the weird things is watching him think\nincredibly long term. One of the meetings every week early on when I was watching\nhim was Mars colonizer. And we'd sit through a two-hour meeting about what would the governance\nstructure be on Mars? What would people wear? How would the robots work? And would there be democracy or should there be a\ndifferent form of governance? And I'm sitting there saying, \"What are they doing? What are they talking about?\" I mean, they're trying\nto build rocket ships and everything else. They are worrying about the\ngovernance structure of Mars? And likewise, whenever\nhe's in a tense moment like there's a rocket's\nabout to be launched, he'll start asking people about\nsomething in the way future, like the new Elite engine or something, if we're gonna build that. \"Do we have enough\nmaterials ready to order?\" Or, I don't know, he'll\njust ask questions. Like when he's building\nRobotaxi, the global car, the $25,000 inexpensive global car, that's not a total passion. He was talked into doing that. His passion is Robotaxis. But his passion is how are\nwe gonna make this factory to do a million cars a year? So even the Robotaxi is\na longer range vision. I mean he's been touting it since 2016, but you know, we're not,\nthere are no Robotaxis. I mean there's, Waymo may be\ndoing a little experiment, but there's not cars being manufactured without steering wheels that are going to take over the highways. Yet so he is always looking way\ninto the future is my point. - I just hope that there's\na lot of da Vinci's and Steve Jobs's and\nEinstein's and Elon Musk's that carry the flame forward. - That's one of the\nreasons you write books about these people is so that if you're a young woman in a school where you're not being told to do science and you read \"The Code\nBreaker\" about Jennifer Doudna, you say, \"Okay, I can be that.\" And when you say, \"Oh,\nmaybe I'll be a regulator,\" or you say, \"Oh no,\nmaybe I'll be the person who pushes the boundaries,\nwho pushes the lines, who pushes,\" as Steve Jobs\nsaid, \"the human race.\" - Well, lemme ask you about your mind, your genius, your process. - I'll give you two out of three. - All right. Take me through your process\nof writing a biography, I mean the full of it. Not just writing a biography, but understanding deeply which your books have done for the human story and\nlike the bigger ideas underlying the human story. So you've written biographies, both of individuals which\nare hardly individuals. It's a really big complex picture. And biographies of ideas\nthat involve individuals. - Well, step one for me\nis trying to figure out how the mind works. What causes Einstein to make that leap? For Elon Musk to say stainless steel while he's looking at\na carbon fiber rocket. Or how do you make the mental leap? Because I write about smart people. Smart people are a dime a dozen. They don't usually amount to much. You have to be creative, imaginative, to think different, as Jobs would say. And so what makes people creative? What makes them take imaginative leaps? That's the key question you gotta ask. You also ask the questions\nlike you've asked earlier, which is what demons are\njangling in their head and how do they harness them into drives? So you look at all that\nand you try to observe really carefully the person. One of the more mundane things I do is a lot of writers try to give you a lot of their opinions\nand preach or whatever. As I said, this mentor said,\n\"Two people types come out, preachers or storytellers,\"\nto be a storyteller. I try, whenever I'm trying\nto convey a thought, there's six magic words that I almost should\nhave written on a card pinned above my desk, which is, \"Let me tell you a story.\" So if somebody says, \"How does Elon Musk\nfigure out good talent,\" as you did, I think, \"Well\nlet me tell you the story. I'll tell you the story of Jake McKenzie.\" Or this is not something I invented. I mean this is what, the good\nLord does it in the Bible. I mean that's the best\nopening lead sentence ever. You know, \"In the beginning,\" comma, and then it's stories. And secondly, to pick up\non that lead sentence, \"In the beginning,\" make it chronological. Everybody in the 40th year of their life has grown from the 39th\nyear and the 38th year. And so you want to show\nhow people evolve and grow. I have the greatest of all\nnon-fiction narrative editors, Alice Mayhew at Simon & Schuster, who among other things created,\n\"All the President's Men,\" with Woodward and Bernstein. But she had a note she'd put\nin the margins of my books. That was a Ticta and it meant\nall things in good time. Keep it chronological. If it's good enough for the Bible, it's good enough for you. - Interesting to me,\nlike that's a small note, but to you it's extremely important. - Because it's the framework\nfor how you structure things, but also how you understand things, which is if you keep it a\nchronological narrative, then you're showing how a person has grown from one experience you've talked about to the next one. And that moral growth, creative growth, risk-taking growth, wisdom, that's the essences of creativity. But you can't do it. You know, there's a term,\nbuildings (indistinct), you know, which is a, you know, book of, you know, that carries a narrative, entails how people learn something. I'm a big believer in narrative. If you are an academic, you sometimes, not today, but in like 20 years ago, 30 years ago, there were two things\nyou thought were bad. One was having a great\nperson theory of history in which you decided to do biography. I had a great professor\nwhen I was in college. Her name was Doris Kearns. She later married Dick Goodwin. And she, when she was going\nfor tenure at the university, wrote a biography of \"Lyndon Johnson and the American Dream.\" And they denied her tenure because it was beneath\nthe dignity of the academy to write history through one person. That's great. It opened up the field of\nbiography to us non-academics, starting with David McCullough, Bob Caro, but maybe Jon Meacham and\nmyself are in a new generation, and certainly there's a\ngeneration coming after us. But the second thing besides\ntelling it through people, is the academy tended to disdain what they called imposing a narrative in which you made it storytelling, 'cause that meant you\nwere leaving things out and making it into a narrative. Well that's how we form\nour views of the world. - Well let me ask you this question. In terms of gathering an understanding, how much of it is one observing, and how much of it is interviews? - Yeah, it obviously\ndepends on the subject. I mean, with a Ben Franklin, it's all based on archives and every... Of course, we have 40\nvolumes of letters he wrote. That was the good old days when every day you'd write 20 letters. The Musk book is based\nmuch more on observation than almost any of my books because he opened up in a way that was breathtaking to me. You know, even when he would be sitting playing Polytopia or seething\nat other people, you know, he'd have me just sitting there watching. I mean, I spent a lot of time with Jennifer Doudna at her side. I went to her lab and edited a human gene, and you know, with a\npipette and a test tube. But I would say I spent 30 hours with her. I can't count, you know, 100 hours or more just observing Musk. And I'm not sure that any biographer, perhaps since Boswell took on Dr. Johnson, has ever had quite as much up close, meaning five feet away\nat all times access. And because of that, I'll go back to what I said a moment ago, I try to get out of the way of the story. It's not about me. I try to just say, \"Okay, here's what happened, here's this story, here's what happened the\nnight he came in to Twitter for the first time,\" and let you form your own judgment. - What about the interviews? You've had a lot of conversations you give acknowledgement to the people you've done interviews with. Well, one, I have to ask, as an inspiring interviewer myself, how? - People love to talk. People just love, you know that.\n(Lex laughing) - I've had 140, maybe 150\npeople, they're all listed in the back.\n- [Lex] Yeah. - One of the little things\nthat people won't notice, but I'll say it now, is all of 'em are on the record. Getting 'em to talk is easy. They all wanna talk about Musk. But then at a certain point say, I don't put anonymous quotes in my book. I cite things. I say, \"If you're tough enough and you've gone through this,\" and a lot of times it takes\ntwo or three calls back, somebody will tell me a story and say, \"Oh, no, no, no, I (indistinct).\" But I think it's important to know where everything came from. And with Musk it's, you know, I had that from the very beginning because I was a Time Magazine reporter. I'd worked reporter for the Times, pick a year, New Orleans. First day on the job, I\nhad to go cover a murder. I phoned in the story from\na payphone and my editor, you know, the city editor said, \"Well, did you talk to the family?\" I went, \"No, Billy, I\nmean the family, you know, the daughter just got...\" He said, \"Go knock on the door.\" I knocked on the door. An hour later they were still talking. They were bringing out her yearbooks. Lesson one I learned, people want to talk if you're willing to just listen. And whether it be Henry Kissinger, you just push the button\nand say \"Kissinger,\" and people tell you the stories, all the way through Elon Musk. Everybody talked, everybody in his family, everybody he fired, everybody. I mean, I think it's\nimportant to listen to people. And the other thing I\nlearned as a reporter, back when I was covering\npolitics in New Hampshire, in the early campaigns, I learned from two or\nthree great reporters, a guy named David Broder and Tim Russert, the late NBC guy. They do what was called door knocking. You just walk in a\nneighborhood, knock on a door and ask people about the election. But they said, \"Here's the secret. Don't ask any leading questions. Don't have any premise. Just say, 'Hey, I'm trying\nto figure out this election. What's going on? What do you think?' And then stay silent.\" With Musk, a third secret. You know this well. He'll go silent at times. Sometimes a minute, two\nminutes, four minutes. Don't try to fill the silences. If you're a listener, you gotta learn, \"Okay, he's not saying\nanything for four minutes. I can outlast him.\" - It's tough. It's us humans, it's very tough. Respecting his silence is\nreally, really difficult. Speaking of demons, when there's silence, all the demons show up in my head. - Oh dear. - The fear, I think is, if I don't say anything, it's boring, and if I say something,\nit's gonna be stupid, and that the basic engine\nthat just keeps running, not on the podcast, well on the podcast, but also in human interaction. And so I think there's that nervous energy when interacting with people. - You can never go wrong by staying silent if there's nothing you have to say. Not something I've mastered. But I do when I'm a\nreporter try to master that, which is don't ask complex questions, don't interject. And when somebody hasn't\nfully answered the question, don't say, \"Well let me,\nyou haven't fully...\" just stay silent. And then they'll keep talking. - Just give 'em a chance to keep talking, even if they've kind of\nfinished, you still... - Sometimes they haven't given you enough. Instead of following up, I'll just nod and keep waiting. - You're making it sound simple. Is there a secret to getting\npeople to open up more? - I'm somewhat lucky because, you know, I started off working\nfor a daily newspaper, and people back then, they wanna talk to the newspaper reporter. - But you also have a way about you. Like, I feel like you have\nlike a cowboy in a saloon. Like you just kinda wanna talk, like there's a draw to... I don't know.\n(Lex laughing) I don't know what it is. Maybe it's, I don't know if it's developed or you're born with it, but there's a, it feels like I want to tell\nyou a story of some sort. (Lex laughing)\n- [Walter] Go ahead, and tell me a story.\n(both laughing) A couple things. I did learn to be more quiet. I'm sure, I know, when I was younger or even I'll see videos of me at, you know, news things\nwhere I'm always trying to interject a question, and so you learn to be quieter sometimes. I haven't mastered it, I\nhaven't learned it enough. You learn to be naturally curious. Many reporters today,\nwhen they ask a question are either trying to play gotcha, or trying to get a news scoop, or trying to, you know, gig\nsomething that can make a lead. And if you actually are curious, and you really want to know\nthe answer to a question, then people can tell that you asked it because you want the answer, not because you're\nplaying a game with them. - I'm sure some of them off the record, some of them on the record, you had maybe, you know, just some incredible conversations. I was gonna say some of the\ngreatest conversations ever, but who knows. Some of the best conversations ever are probably somewhere in South America between--\n- [Walter] Yeah. - two drunk people that\nwe never get to hear. So I don't, I don't know. But is there advice you can give from what you've learned, to somebody like me on how\nto have good conversation, especially when it's recorded? - Well, to be actually curious. I mean, every question you've asked me is 'cause I think you actually\nwant to know the answer and you've done your homework, to be open and not to have an agenda. I mean, we all suffer from there being too many agendas in the world today. - Yeah, so that, just genuine curiosity. But there's something, when you talk about just\none-on-one interaction, whether it's Elon or Steve Jobs, there's something beautiful\nabout that person's mind, and it feels like it's\npossible to reveal that, to discover that together efficiently, and that's kind of the\ngoal of a conversation. - Well, I mean, look, you're amongst the top\npodcasters and interviewers, you know, in the world today. You have an earnestness to you. Ben Franklin is the person who taught me, I mean by reading him, the most about on conversation. He wrote a wonderful essay on that. It includes on silence. But it includes trying\nto ask sincere questions rather than get a point across. I mean, it's somewhat Socratic, but whenever he wondered or wanted to like start a\nFireman's Corps in Philadelphia, he would go to his group that he called, \"The Leather Apron Club,\" and they would pose a question,\n\"Why don't we have it? What would it take? What would be good?\" And then the second part is\nto make sure that you listen. And if somebody has even\njust the germ of an idea, give them credit for it. Like, \"As Joe said,\" you know, \"the real problem is this.\" And I do think that if I'm in situations, and I just mean even\nat dinner or something and I'm with somebody, I'm usually curious and I'll... The conversation will proceed, you know, with questions. And I guess it's also\n'cause I'm pretty interested in what anybody's doing,\nwhoever I happen to be with. And so that's a talent you have, which is, you're pretty genuine in your interests. There're people like Benjamin Franklin, like the, I'll say Charlie Rose, even though he is in disfavor, who are interested in a\nhuge number of subjects, and I think that helps as well, to be interested in basketball, and opera, and physics, and metaphysics. That was a Ben Franklin,\nthat was a Leonardo trick, which is they wanted to know everything you could possibly know\nabout every subject knowable. - But there's a different aspect of this, which is that I would love to hear how you've solved it or if you've faced it that you're certainly disarming. Sound like peppering you\nwith compliments here, (Walter laughing) trying to get you to open.\n- That's a very disarming method.\n- [Lex] Yeah. I've recently talked\nto Benjamin Netanyahu. We'll talk again. We unfortunately, 'cause of\nscheduling and complexities, only had one hour,\nwhich is very difficult, very difficult with the charismatic--. - Yeah, he's the prime minister. - I understand this. But he's also a charismatic talker, which is very difficult to\nbreak through in one hour. But there, people have built up walls, whether it's because of demons or because of, they're politicians, and so they have agendas,\nand narratives, and so on, and so to break through those, I wonder if there's some advice, some wisdom you've learned on how to sort of wear down through water or whatever method the\nwalls that we've built up as individuals. - I mean, you call it disarming, which I don't know that I am, but disarming basically means you're taking down their shields, also. And you know, when people have a shield and you try to give them comfort. I had zero of that problem with Elon Musk. I mean, it was like disarming to me, which is, I kept waiting to say, \"Okay, he's not gonna... He's got a shell, or he won't do that.\" But he was almost crazily open and did not seem to wanna be spinning, or hiding, or faking things. And I've been lucky. Doudna was that way. Steve Jobs was that way. But you have to put in time, too. In other words, you can't say, \"Okay, there's a one-hour interview and I'm gonna break down every wall.\" It's like on your fifth visit. - Yes, well actually\nthere's one of the things in my situation you learn, fifth visit is very nice, but sometimes you don't get a fifth visit. Sometimes it's just the first date. And I think what it boils down to, and we said disarming, but there's something about\nthis person that you trust. I think a lot of it\njust boils down to trust in some deep human way. And I think with many other\npeople I've spoken with, sometimes the trust happens\nlike after the interview, which is really sad because\nit's like, \"Ah, man.\" - I've never been in your\nsituation where I have a show. I usually have--\n- Second acts. - At the wheel. (both laughing) I'm not a first-date person. - [Lex] Yeah. Yeah, yeah. Well, you know. - But then I'm lucky. I mean, I say lucky, but I'm in print, you know.\n- [Lex] I understand. - Print is a couple\nthousand year old medium. But there are those of us who love it. - Well, the nature of the podcast medium is that I'm a one\none-night-stand kinda girl. Let me ask you about objectivity. You've followed Elon\nand you've followed... Like you're, I mean, I don't even know if you\nwould say you're a friend. You have to be careful\nwith words like that. But you're, there's an intimacy. And how do you remain objective? Do you want to remain objective while telling a deeply human story? - Yeah, I mean, I want to be honest, which I think is akin to being objective. I try to keep in mind\nwho am I writing for? I'm not writing for Elon Musk, as I say, I haven't sent him the book. I don't know if he... I don't think he's read it yet. I've got one person I'm writing for, the open-minded reader. And if I can put in a story and say, \"Well, that will piss off the subject,\" or, \"That will really\nmake the subject happy,\" that's irrelevant, or I try to make that\na minor consideration. It's will the reader have\na better understanding because I've put this story in the book. - I'm a bit of a romantic. So to me, even your Einstein book-- - [Walter] Yeah. - had lessons on romance\nand relationships. - Ooh dear. (both laughing) - So how important are\nromantic relationships to the success of great men,\ngreat women, great minds? - Well, sometimes people who\naffect the course of humanity have better relationships with humanity than they do with the\nhumans sitting around 'em. Einstein had two interesting relationships with wives, you know. Mileva, his first wife\nwas a sounding board and helped with the mathematics of the special relativity\npaper in particular, but he didn't treat her well. I mean, he made her like sign a letter that she wouldn't interrupt\nhim, she wouldn't, you know. And finally when she wanted a divorce, he couldn't afford it 'cause\nhe was still a patent clerk. And so he offered her a deal, which is I think totally amazing. He said, \"One of these days, one of those papers from 1905 is gonna win the Nobel Prize. If we get a divorce,\" you know, \"I'll give you the money.\" That was a lot of money back then, like a million dollars now or something. And she's smart, she's a scientist. She consults with a few other scientists, and after a week or so she takes the bet. Is that until what, 1919\nthat he wins his Nobel Prize? And she gets all the money. She buys three apartment\nbuildings in Zurich. With his second wife, Elsa, it was more a partnership of convenience. It was not a romantic love, but he knew. And that's sometimes\nwhat people need in life is just a partner, I mean somebody who's\ngonna handle the stuff you're not gonna handle. So I guess if you look at my books, they're not great inspiring guides to personal relationships. - Let me ask you about actually the process of writing itself. When you've observed,\nwhen you've listened, when you've collected all the information, what's maybe even just\nthe silly mundane question of what do you eat for breakfast\nbefore you start writing? When do you write? - First of all, breakfast\nis not my favorite meal. And those people who tell you that you have to start\nwith a hearty breakfast. - [Lex] A raw--\n- Look Askens. - [Lex] Yes. - And morning is not my favorite day part, so I write at night. And because I love narrative, it's easy to structure a book, which is, I can make a outline that if I printed it out or notes would be 100 pages, but\neverything's in order. In other words, if there's a Burning Man, and he's coming back from Grimes, and then there's a solar roof thing, and then there's something, I put it all in order\nday-by-day as an outline. And that disciplines me\nwhen I'm starting to write, to follow the mantra from\nAlice Mayhew, my first editor, which is all things in good time. Don't get ahead of the story,\ndon't have to flashback. And then after you get it so that it's all chronological,\nyou know, things, then you have to do some clustering. You know, you have to say, \"Okay, we're going to do the decision to do Starship or to\nbuild a factory in Texas or to whatever.\" And then you sometimes have\nthe organizational problem of, \"Yeah, and that gets\nus all the way up to here. Do I keep that in that chapter or do I wait until later when it's better chronologically?\" But those are easy. - Well, what about the actual\nprocess of telling the story? - Well, that's the mantra\nI mentioned earlier, which is whenever I get pause or I don't know how to say something, I just say, \"Let me tell you a story.\" - [Lex] Yeah. - And then I find the actual anecdote, the story, the tale that encompasses what I'm trying to convey. And then I don't say what\nI'm trying to convey. I don't have a transition\nsentence that says, you know, \"Elon sometimes changed his mind so often he couldn't remember whether\nhe had changed his mind.\" You know, you don't need\ntransition sentences. You just say, \"All right, here's the point I need to make next.\" And so you start with\na sentence that says, you know, \"One day in January in the factory in Texas, comma.\" - Well one of the things\nI'd love to ask you is for advice for young people, to me first advice would\nbe to read biographies in the sense, because\nthey help you understand of all the different ways you can live a life well lived. But from having written biographies, having studied so many\ngreat men and women, what advice could you give to people of how to live this life? - Well, I keep going back to the classics, and Plato, and Aristotle, and Socrates, and I guess it's Plato's Maxim, but he may be quoting Socrates, that the unexamined life\nis not worth living. And it gets back to the know\nthyself and other things, which is, you don't have to figure out what is the big meaning of it all. But you have to figure out why you're doing what you're doing. And that requires something that I did not have enough\nof when I was young, which is self-awareness and examining every\nmotive, everything I do. - Where does the examination lead you? Is it to a shift in life trajectory? - I mean, it's not for me sort of, \"Alright, I've now decided\nhaving been a journalist, I'll run a think tank,\nor I'll run a network, or I'll write a bio.\" It is actually something\nthat's more useful on an hourly basis. Like why am I about to\nsay that to somebody? Or why am I going to\ndo this particular act? What's my true motive here? And also in the broader sense to learn as I did after\na couple years at CNN, my examination of my life is that I'm not great at\nrunning complex organizations. I'm not great as a manager. Given the choice, I'd rather somebody else have to manage me than\nme have to manage people. But it took me a while to figure that out. And I was probably too ambitious when I was young and at Time Magazine. That was when I was green and, oh well, that was when\nI was in my salad days, and green in judgment. (Lex laughing) And it was like chasing the next level at Time, Incorporated, whatever it might be. And then one day I caught the brass ring and I became an editor\nand then the top editor. And after a while I realized that wasn't really totally\nwhat I'm suited to be, especially when I got\nput in charge of CNN. I mean, all young people\nare almost by definition in their salad days and green in judgment. But you learn what's motivating you and then you learn to ask, \"But is that really what I want? Should I be careful of\nwhat I'm wishing for?\" - One of the big examinations you can do is the fact that you and\neverybody dies one day. How much you, Walter\nIsaacson, think about death? Are you afraid of it? - No, and I don't think about it a lot, but I do think about Steve Jobs as, \"Let me tell you a story,\" you know, which is the wonderful Steve Jobs story of, I think after he was diagnosed, but before it was public. And he gave both a Stanford\ntalk, but other things in which he said, \"The fact that we are going to die gives you focus and gives you meaning,\" if you're gonna live. And Elon Musk has said that to me, which is a lot of the tech\nbros out in the Silicon Valley that are looking for ways to live forever. \"I can think, Musk\nsays,\" of nothing worse.\" We read the myth of Sisyphus and we know how bad it is to\nbe condemned to eternal life. So there was in ancient Greece, the person who walked\nbehind the king and said, \"Memento mori, remember you're gonna die.\" And it kept people from losing it a bit. - Do you think about legacy? - The lucky thing about being a biographer is that you kinda know\nwhat your legacy is. There's gonna be a shelf, and\nit'll be of interesting people and you will have inspired a\n17-year-old biology student somewhere to be, you know, the next great biochemist or somebody to start a\ncompany like Elon Musk. And what I think more about, I won't say giving back,\nthat's such a trite thing. I moved back to New Orleans for a reason. First of all, the hurricane hit. And after Katrina, I was asked to be vice-chair of\nthe recovery authority. And I realized everything\nI've got going for me, it all comes from this beautiful\ngem of a troubled city. The wonderful high school I went to, the wonderful streets where\nI learned to ride a bike, you know, and it's got challenges. I'm never gonna solve challenges at the grand global level, but I can go back home\nand say part of my legacy is going to be, I tried to pay it back to my hometown. Even by teaching it Tulane,\nwhich I don't do as a favor. I mean, I enjoy the hell out of it. But it's like, \"All right,\nI'm part of a community.\" And I think we lose that in America because people who are lonely are lonely 'cause they're not part of a community. But I've got all my high school kids, there's friends that are\nall still in New Orleans. I've got my family,\nbut I also have Tulane, institutions in New Orleans\nthat have been there forever. And if I can get involved in helping the school\nsystem in New Orleans, of helping the youth empowerment programs, of helping the innovation\ncenter at Tulane. I was even on the city\nplanning commission, which worries about zoning ordinances for short term rentals. You know, go figure. But it was like \"No, immerse\nmyself in my community, 'cause my community was\njust so awesomely good at allowing me to become who I became, and has trouble year-by-year,\nhurricane-by-hurricane, making sure that each new generation can be creative and it's\na city of creativity from jazz, to the food,\nto the architecture. So when I think of, I won't say legacy, but what am I gonna do to pay it forward, which is a a lower level\nway of saying legacy, I pay it forward by\ngoing back to the place where I began and trying to\nknow it for the first time. That was a ripoff of a T.S. Eliot line. I don't want you to think\nI thought of that one. (Lex laughing) - Always cite your\nsources. I appreciate it. - T.S, Eliot, if you ever\nneed to figure it out, \"The Four Quartets,\" it's\nthat part at the end, which is, \"We shall not\ncease from exploration, and the end of all of our exploring will be to return to the\nplace where we started and know it for the first time through the unknown but\nhalf-remembered gate.\" It's just beautiful. And that's been an inspiration of what do you do in, I guess if it's a Shakespeare\nplay, you'd call it Act Five. Well, you go back to\nthe place where you came and--\n- [Lex] See for the first-- - So you don't sit there\nworrying about legacy, but you'll sit there saying, \"How do I make sure that somebody else can have a magical trajectory\nstarting in New Orleans? - Well, to me, you're one\nof the greatest storytellers of all time. I've been a huge fan.\n- That's definitely not true, but it's so sweet of you. You see, you can be--\n- Brutally interrupting. I think probably Ben Franklin, so far, I don't know how\nmany years, 15 years, Einstein all the way through today Ive just been a huge fan of yours. And you're one of the\npeople that I thought surely would not lower themselves to appear and have a conversation with me. And it's just a giant gift to me. - Hey, I flew into Austin for this because I am a big fan, and especially a big fan because\nyou take people seriously and you care. - Thank you 1,000 times. Thank you for respecting me and for inspiring just millions\nof people with your stories. Again, an incredible\nstorytelling, incredible human, and thank you for talking today. - [Walter] Thank you, Lex. - Thanks for listening\nto this conversation with Walter Isaacson. To support this podcast, please check out our\nsponsors in the description. And now let me leave you with one of my favorite\nquotes from Carl Jung. \"People will do anything\nno matter how absurd in order to avoid facing their own souls. One does not become enlightened by imagining figures of light, but by making the darkness conscious.\" Thank you for listening and\nhope to see you next time."
    }
}