{
    "Az7y8zxqNvc": {
        "title": "Marjorie Taylor Greene Tries To Play Victim After Attacking Everyone",
        "thumbnail": "https://i.ytimg.com/vi/Az7y8zxqNvc/hqdefault.jpg",
        "author": "Farron Balanced",
        "date_of_release": "2021-12-07T16:00:03Z",
        "duration": "PT5M11S",
        "view_count": "83134",
        "like_count": "6512",
        "comment_count": "1371",
        "description": "Republican Representative Marjorie Taylor Greene loves to attack people - people in the government, the media, and anywhere else she can find them - but apparently she can't take it as well as she dishes it out. Greene recently went on a rant where she cried about being the most attacked person in Congress, completely ignoring that her attacks on others have led to serious threats against them by Greene's crazed followers. Farron Cousins explains Greene's victim complex and why no one should buy it.\n\nLink - https://www.alternet.org/2021/12/rep-marjorie-taylor-greene/\n\nDon't forget to like, comment, and share! And subscribe to stay connected!\n\nConnect with Farron on Twitter: https://twitter.com/farronbalanced\n\n*This transcript was auto-generated. Please excuse any typos.\n\nMarjorie Taylor green is sad. I know that's not an emotion we usually see from Marjorie, but she posted a video recently where she expressed her sadness and a little bit anger about the fact that she is allegedly, according to her, the most attacked freshman lawmaker in the history of, of the United States. Here's what she said in her idiotic video. I have been the most attacked freshman member of Congress, probably in United States history. The media's defamed me. They have completely smeared my character called me names and labeled me horrible things. None of which I am. None of the things they have said are true about me.  let's not forget, um, that a lot of the things that have been said about you, there's actually video evidence to back it up. I mean, we've, we've talked about a lot of it right here, but here's the most important thing, Marjorie. \n\nYou dish it out better than anybody else in Congress. Now you're telling us you can't it little too weak. Huh? You can go out there, call everybody else names. But when somebody calls you a horrible human being, it's, it's the breaking point. And you're the most attacked person ever. Really. I think you could be a little tougher than that. Don't you? So let's look at the facts right here. Right? Let's examine her claim that she is the most attacked freshman lawmaker in history. So let me ask you this. Marjorie has your staff had to undergo special training because of all the death threats you received? No, they haven't. But you see that is what happened to the freshman lawmakers in the squad, specifically representative Alexandria, Ocasio, Cortez, and Ilan Omar during their first two years in office, their staffs had to undergo specialized training because of the death threats. \n\nOh, and let's not forget, actually, while she was a freshman representative AOC, you showed up at her office and you posted a video of you harassing her through her slot. So of all the harassments she received you, even though you weren't a lawmaker at the time, you were actually one of the people who did that, you recently said that we have to start calling all Democrats communists because that's what all Democrats are. Right? Look here. Here's your quote. You know, a lot of people are swallowing down the word socialist, but that's not a good enough word for Democrats. They are communists. That's the word we need to keep using with them because they're using these unprecedented authoritarian, tyrannical controls on the American people to force people to comply for the record. That is not at all. What communism actually is, but you call everything communism because you don't know the word means, cuz everything you don't like is communist. And it just makes you look even dumber. Every time you've used that word out of context, there is no way. There is no reality in which you are the most attacked member of Congress. \n\nAll of the attacks that you have received have been well deserved. And of course you're the first one to go out there, attack your fellow lawmakers both before and during your time in office, you're attacking the press. You're attacking president Biden. You're attacking everyone. You could possibly tack in the cruelest ways possible. You are harassing them. When they're talking to the media again, video of that, this woman is an absolute abor human being. Forget about her being a Republican, forget about her. Even being a lawmaker as a human. She sucks. Let's also not forget the time. Just a few months ago, you posted a video of yourself in the middle of a workout. Like you literally stopped working out to record a video of yourself where you just called Joe Biden. A piece of, but no, no, no, no, no. You're the victim here, right? \n\nBecause that's all conservatives know how to do. They go out there, attack everybody, smear everybody, liable, slander every opportunity they get. Then when anybody has the audacity to fight back against them, Republicans lie down and claim I'm being attacked. I'm being canceled. Everything's so horrible for me. And they're idiot followers because that's what they all are.",
        "transcript": "Marjorie Taylor green is sad. I know that's not an emotion we usually see\nfrom Marjorie, but she posted a video recently where she expressed her sadness and a little\nbit anger about the fact that she is allegedly, according to her, the most attacked freshman\nlawmaker in the history of, of the United States. Here's what she said in her idiotic video. I have been the most attacked freshman member\nof Congress, probably in United States history. The media's defamed me. They have completely smeared my character\ncalled me names and labeled me horrible things. None of which I am. None of the things they have said are true\nabout me.  let's not forget, um, that a\nlot of the things that have been said about you, there's actually video evidence to back\nit up. I mean, we've, we've talked about a lot of\nit right here, but here's the most important thing, Marjorie. You dish it out better than anybody else in\nCongress. Now you're telling us you can't it little\ntoo weak. Huh? You can go out there, call everybody else\nnames. But when somebody calls you a horrible human\nbeing, it's, it's the breaking point. And you're the most attacked person ever. Really. I think you could be a little tougher than\nthat. Don't you? So let's look at the facts right here. Right? Let's examine her claim that she is the most\nattacked freshman lawmaker in history. So let me ask you this. Marjorie has your staff had to undergo special\ntraining because of all the death threats you received? No, they haven't. But you see that is what happened to the freshman\nlawmakers in the squad, specifically representative Alexandria, Ocasio, Cortez, and Ilan Omar\nduring their first two years in office, their staffs had to undergo specialized training\nbecause of the death threats. Oh, and let's not forget, actually, while\nshe was a freshman representative AOC, you showed up at her office and you posted a video\nof you harassing her through her slot. So of all the harassments she received you,\neven though you weren't a lawmaker at the time, you were actually one of the people\nwho did that, you recently said that we have to start calling all Democrats communists\nbecause that's what all Democrats are. Right? Look here. Here's your quote. You know, a lot of people are swallowing down\nthe word socialist, but that's not a good enough word for Democrats. They are communists. That's the word we need to keep using with\nthem because they're using these unprecedented authoritarian, tyrannical controls on the\nAmerican people to force people to comply for the record. That is not at all. What communism actually is, but you call everything\ncommunism because you don't know the word means, cuz everything you don't like is communist. And it just makes you look even dumber. Every time you've used that word out of context,\nthere is no way. There is no reality in which you are the most\nattacked member of Congress. All of the attacks that you have received\nhave been well deserved. And of course you're the first one to go out\nthere, attack your fellow lawmakers both before and during your time in office, you're attacking\nthe press. You're attacking president Biden. You're attacking everyone. You could possibly tack in the cruelest ways\npossible. You are harassing them. When they're talking to the media again, video\nof that, this woman is an absolute abor human being. Forget about her being a Republican, forget\nabout her. Even being a lawmaker as a human. She sucks. Let's also not forget the time. Just a few months ago, you posted a video\nof yourself in the middle of a workout. Like you literally stopped working out to\nrecord a video of yourself where you just called Joe Biden. A piece of, but no, no, no, no, no. You're the victim here, right? Because that's all conservatives know how\nto do. They go out there, attack everybody, smear\neverybody, liable, slander every opportunity they get. Then when anybody has the audacity to fight\nback against them, Republicans lie down and claim I'm being attacked. I'm being canceled. Everything's so horrible for me. And they're idiot followers because that's\nwhat they all are. Believe it. They eat it up. Marjorie Taylor green is not now nor has she\never been a victim. She is a bully that doesn't know how to handle\nit when people fight back against her. So she starts whining and crying and and moaning\non social media. Trying to get more attention because if she\ncan, can't get attention by being a complete of a human being, she's gonna try to get it\nby claiming that everybody's just so mean to her."
    }
}