{
    "beniNcXaAKQ": {
        "title": "01 - Initial Setup Wizard - UDM-Pro Complete Setup 2021",
        "thumbnail": "https://i.ytimg.com/vi/beniNcXaAKQ/hqdefault.jpg",
        "author": "Crosstalk Solutions",
        "date_of_release": "2021-06-24T19:00:10Z",
        "duration": "PT15M27S",
        "view_count": "361204",
        "like_count": "6462",
        "comment_count": "302",
        "description": "The UniFi Dream Machine Pro (UDM-Pro) is an excellent home user router/firewall/switch/surveillance system device.  The UDM-Pro runs the UniFi OS and includes UniFi Network, UniFi Protect, UniFi Access, and UniFi Talk bundled in as applications.  \n\nIn this series, we will dig deep into how to set up the UDM-Pro and related applications mostly focusing on Network and Protect.  In Part 01, we will talk about the device itself and go through the initial setup wizard.\n\nUDM-Pro Complete Setup playlist:  https://youtube.com/playlist?list=PL1fn6oC5ndU82-3W4LLynLmEB6z7BAgpE\n\nUDM-Pro (affiliate):  https://store.ui.com/collections/unifi-network-unifi-os-consoles/products/udm-pro?a_aid=crosstalksolutions\n\nZufall Protect calculator:  https://zufall.co/protect-calculator/\n\nTimecodes: \n\n00:00 Intro\n01:35 UniFi OS explained\n02:54 Hard drive considerations\n04:08 Initial Setup Wizard\n09:37 UniFi OS overview\n14:09 Add a local administrator account\n---------------------\nBuy me a beer!  https://ko-fi.com/crosstalk\nOr donate some Crypto!  https://crosstalksolutions.com/contact/\n\nFollow me on Twitter:  @crosstalksol\n\nCrosstalk Solutions - RECOMMENDED PRODUCTS:  https://crosstalksolutions.com/recommendations/\n\nCrosstalk Discord:  https://discord.gg/crosstalksolutions\n\nAmazon Wish List:  http://a.co/7dRXc67\n\nCrosstalk Solutions offers best practice phone systems and network/wireless infrastructure design/deployment.  Visit https://CrosstalkSolutions.com for details.\n\nConnect with Chris:\nTwitter:  @CrosstalkSol\nLinkedIn:  https://goo.gl/j2Ucgg\nYouTube:  https://goo.gl/g4G58M",
        "transcript": "(bright music) - Welcome to Crosstalk Solutions. My name's Chris, and today we are starting a new journey with a Complete Setup series\non the Ubiquiti UDM Pro, or Dream Machine Pro. Now, the UDM Pro is one of Ubiquiti's sort of all-in-one devices. The focus for this series is going to be on complete\nsetup of the UDM Pro with a home user environment in mind. Now why a home user environment instead of a business environment? It's because in my opinion, where the UDM Pro really really\nshines is for home users. For a business environment,\nit has a couple of drawbacks that I personally would\nprefer other equipment, a little bit more robust equipment, equipment that has a little\nbit more redundancy built in for a business. For home users though, the\nUDM Pro is really great. So let's take a quick\nlook at the product page, if you're not familiar\nwith this device already. $379 for this device, and it becomes your firewall,\nit can run UniFi Protect, it can run all of your access\npoints, your guests networks, and IOT networks, stuff that we're gonna set\nup as part of this series. And it also has UniFi\nAccess for access control, as well as UniFi Talk for a phone system. So I'll put a link to this page\ndown below, but the UDM Pro is one of the devices\nthat UniFi and Ubiquiti are calling their UniFi\nOS consoles, right? So what does that mean exactly? Well, essentially there\nare devices out there such as the UDM Pro, the UDM, the Cloud Key Gen2 Plus\nis another example, where they run what's\nnow called the UniFi OS as the base operating\nsystem in the backend. And then on top of that\nbase operating system are separate applications. So for instance, we have UniFi Network, which controls your\nfirewalling, your WiFi, your network switches and stuff like that. We've got UniFi Protect, which is for cameras, video surveillance, UniFi Access, and Talk as well. The UDM Pro can have all\nfour of those applications running on UniFi iOS. Whereas something like\nthe non-pro version, the standard UDM, only has UniFi Network\nrunning on top of it. So you can see the full comparison online. We're not gonna dig into this too deeply, because this video is\ngoing to specifically focus on the UDM Pro. Before we dig in though, make sure you're following\nCrosstalk Solutions on YouTube, and give us a like, both of\nthose things are completely free and it really helps out the channel. Plus you'll be notified\nwhen additional videos in this series are released. And you can also follow us\non Twitter, @CrosstalkSol to see the stuff that we've got going on on a day-to-day basis. And if you just wanna buy me a beer, there's a link down below to do that too. Installing a hard drive into the UDM Pro is really straightforward. You simply pop out the drive bay, make sure the power is off\nwhen you do this by the way. And the included drive bay\nwill allow you to install either a 2.5 inch or 3.5 inch hard drive. Right here I just have\nthis one-terabyte Toshiba, I think this originally came\nout of my Cloud Key Gen2 Plus, since I don't use this for\na live protect environment, I don't really need a ton of storage. But I would recommend something like a surveillance hard drive, either the Seagate Skyhawk or\nthe Western Digital Purples. They come in all sorts\nof different flavors; four terabyte, eight terabyte, it really depends on what\nkind of cameras you're running and what quality you're recording in. Now, if you're interested\nin an online calculator for figuring out exactly how\nmuch dry space you might need in your UDM Pro, I will put a\nlink down in the description to a really nicely done calculator from Zufall Communications. Where he allows you to pick your cameras, set your recording quality, and then it will tell you\nwhat kind of hard drive is best suited. Once you have your hard drive, you simply install it in this drive bay, and slide it right back in.\n(hard drive clinks) So let's dive in right now. I have the UDM Pro in a\nfactory default state. In a factory default state, the IP address of the UDM Pro is 192.168.1.1. So the first thing that you\nhave to do to set up this device is connect your computer to it, and then set up your computer\nin that same network. So here we can see I've pulled\nup my network connections, I'm going to right click\non my ethernet connection, and I'm gonna choose properties. And I'm gonna double click on IPV4, and we can see that I have\nmanually set up my computer as 192.168.1.2. Now, you don't have to use dot two, you can use anything from two dot, all the way up to 254. You just can't use dot one, because that is what the\nUDM Pro is by default. So we're gonna say, okay, okay. And then you can put\n192.168.1.1 in your browser bar, and you should come up\nto this page right here, that says, \"Your\nconnection is not private.\" That's totally okay, we're gonna click advanced and proceed. And here we are getting started with the UDM Pro installation wizard. All right, so they have a\nmessage here about how UI is committed to protecting\nyour privacy and security. It says, \"Our goal is to\nkeep as much of your data \"off cloud. \"The diagnostics data that we do collect \"is used to improve\nperformance and stability \"of the products we deliver to you, \"keeping your personal\ninformation private from everyone, \"including us. \"You have the option\nto opt out of that data \"from the settings page after setup.\" So we're gonna say set up UDM Pro. And let's go ahead and give it a name. We're gonna call it\nUDM Pro Complete Setup, 'cause that is the name of this series. We're gonna agree to the\nterms and conditions, and say next. And then we have a setup type. Now, it allows you to\nchoose personal or business. I've tried both, and I don't see any actual\ndifference between these two, other than when you choose business, it asks you some additional questions about the type of business\nand the size of business, whereas for personal, it does\nnot ask you those questions. I've gone through the complete install using both of these setup types, and I did not notice any\ndifference actually in UniFi iOS or in UniFi Network or Protect. So if you know of any\nadditional differences, put those down in the comments below. But to me, these are\nalmost exactly the same other than the questions that it asks you if you select business. So we're gonna choose\npersonal and say next. And now it's gonna want\nus to sign into ui.com. Now, this has been a point of\ncontention for the UDM Pro, you are not allowed to have\na local login to this device to set it up, right? You have to set it up with a ui.com login. So we're gonna go ahead and\nlog in with our ui.com login. And it's now gonna ask me for my two-factor authentication token, which I highly highly recommend, since this is a cloud-only\nlogin for the UDM Pro, set up two-factor authentication. Either with something like\na YubiKey, like I use, or you can use something\nlike Google Authenticator on your smartphone. All right, so you may or\nmay not receive this screen. When the UDM Pro takes backups, those backups are available even after you've\nfactory reset the device. So we can see here that I\nhave a couple of backups that I took while I was\ninitially setting up this device in preparation for these videos. I'm not gonna choose either\nof these backups though, we're just gonna go ahead and\nsay continue without backup. But in most cases, you're actually not gonna see this step, especially if you've just\npurchased your UDM Pro and are setting it up for the first time. Next, it's gonna ask us\nabout our update schedule. How often do we want\nto update the UDM Pro? For me personally, I do\nnot like automatic updates, so I'm gonna set these to disabled. Your mileage may vary. If you are comfortable with letting the UDM Pro update itself, you can choose if it's daily\nor weekly and then set a time. All right, next. And here we have\nconfiguration, auto optimize. So I'm gonna leave auto optimize on, and it says UniFi Network\nautomatically detects and sets the most commonly\nmissed but vital settings for improved WiFi and network performance. So we're gonna let this thing be the brains of the operation,\nand we're gonna say next. Now we are starting an\ninternet speed test, we can see that I'm pushing\nabout 700 megabits per second, which believe me, I'm paying for. And our upload is capping out at about 40 megabits per second. Now you can adjust these\nresults to the speeds that you're actually\npromised from your ISP, or you can just take these defaults. I'm just going to take the\ndefaults that it detected and say next. And now we have a summary of our setup, and we will click finish. Okay, so we can see here that\nright after I clicked finish, within about 15 seconds or so, I have now started getting\npings from the internet, meaning that we are internet\nconnected, so that's good. However, if you have\ninternet that requires something like a static IP address, you might not yet have internet access, but I'm gonna assume that\nmost home users use DHCP for their internet connection. So at this point in the\nsetup, when you get this, you know, \"How was your experience?\" You should now have internet access. So now it's asking us, \"How would you rate the\ninstallation experience \"of your Dream Machine?\" We'll give it five stars. And we'll say, \"OMG! \"What an amazing setup wizard!\" Submit. We are now at the\ndashboard of the UDM Pro, or at the dashboard of\nwhat's called UniFi OS. And from here, we can see all of the\napplications that are installed. By default we have Network\ninstalled as well as Protect, but if we wanted to set up Access or Talk, we'd actually have to click\nthese buttons to set those up. You can see the versions that\nI'm working with right now, we are version 6.1.71 on UniFi Network, version 1.17.4 on UniFi Protect. For the system itself,\nwe're version 1.9.3. And your versions may be different depending on when you're\nactually going through this setup process. So before we start diving\ninto adding our devices and access points, let's take\na look around this interface. So we have the dashboard,\nwe have our applications, and we have users, where we can add users\ndown here at the bottom. Those users can be used for basically all of these\nother applications, right? So you can create users that can view cameras in UniFi Protect, you can create users that can\nhave a phone in UniFi Talk, or can have access to\na door in UniFi Access. All of that is done through\nthe users right here. And the user that you\ncreate is essentially shared across all of these UniFi applications. By the way, a shortcut\nto all of this stuff is always up here with these nine dots. If you click these nine dots, you can click this UDM Pro Complete to get back to this dashboard. You can choose an individual application, and there's also a shortcut\nto users and settings. So now let's take a look\nat the UniFi OS settings. And here we can see device name, WAN IP, gateway IP, et cetera, et cetera. We can see the performance\nstatistics for our device. We can see the hardware for the device. And then down here, we can\nsee the storage and capacity. If we click on updates, it's going to tell us if\nthe UDM Pro or UniFi OS needs an update, and in my case, mine is\ncompletely up to date. But I have a couple of applications\nthat are not up to date. So the first thing that we wanna do here, is get our applications up to date. So we're gonna choose\na UniFi Network first, we're gonna say update. And now we're up to date. That took about two minutes to\nrun the UniFi Network update. Let's now update UniFi Protect as well. And Protect is now updated as well, we were on version 1.18.1 as\nof the release of this video. If you look a little bit further down, these are where you can change\nyour auto update settings. So remember, during the wizard,\nwe turned off auto updating, but if you ever wanna make\nchanges to those settings, you can do that down here\nin the auto update section. If we click on location and time, this allows us to set our exact address as well as our time zone. And if we come over here to advanced, we can rename the device. We can turn on SSH, which\nI actually recommend. There are some instances where you may need to get\ninto the device via SSH. For instance, if an application update\ncrashed that application, and you wanna roll it\nback to a previous version or something like that, it's just always helpful\nto have SSH access. So let's go ahead and turn on SSH access. And you wanna give it\na nice strong password that you're going to remember, and click confirm. Now you can also turn\non remote access, right? So this will allow the device\nto reach out to unifi.ui.com, and show up as a device\nthat can be configured through that portal. It's a really nice way\nto be able to configure your home network from\nanywhere in the world, and you don't need to\nopen up ports through to your UDM Pro to do so. However, keep in mind that\nyou are now connecting out to a cloud-based application,\nand so if you do not like that you have control of your device through a cloud-based application, you can disable remote access, but I would strongly recommend creating a local administrative\nuser on the UDM Pro first, before you do that. Scrolling down a bit, we\ncan restart the device, power it off, do a factory\nreset, download a support file, that's if you call in to support, and they ask you to\ndownload a support file, that's where you do it right here, or you can restore a backup. And then at the very bottom we have our backup configuration, and this is where we turn\non backup of the device. You remember when we went\nthrough initial setup wizard, we saw those backups were available even after a factory reset. So this is a really good idea to have these backups turned on. You can run a manual backup by clicking backup button right here, or you can schedule a backup, where I've got mine set by\ndefault at Monday at 12:00 AM. I'm actually gonna change that to Sunday, we'll say 1:00 AM instead. And confirm. Okay, let's pop over to our users now, and as I was talking about earlier, so I have one user in here already. I also wanna add a local administrator just in case I ever need it,\nso we're gonna say add user. For role, we wanna choose super\nadmin and local access only. So we're gonna call this super admin, the name that I'm gonna\ngive it as UniFi Admin, and then I'm gonna give\nit a nice strong password. Employee ID and group settings, that's stuff that we don't\nneed to deal with right now, so we're just gonna add\nour user and say, add. And now we have a new super admin user that we can log into\nthe device locally with. That's gonna do it for this video. In our next video, we're gonna start digging\ninto UniFi Network, and setting up some devices, and going through the\ninitial configuration steps of that application.\n(bright music) If you guys have suggestions for what you would like to see me cover as part of this UDM Pro series, make sure you put those\nsuggestions down below. I read every single comment\nthat comes into YouTube. All right, I hope you enjoyed this video, remember to like and subscribe,\nit's absolutely free, and we will see you in the next video. (bright music fades)"
    }
}