{
    "bHBZaPGBaQ0": {
        "title": "'Absolutely unprecedented': George Conway weighs in on Trump in 2024 election",
        "thumbnail": "https://i.ytimg.com/vi/bHBZaPGBaQ0/hqdefault.jpg",
        "author": "CNN",
        "date_of_release": "2024-01-22T22:48:32Z",
        "duration": "PT9M55S",
        "view_count": "545869",
        "like_count": "7924",
        "comment_count": "2678",
        "description": "Conservative lawyer George Conway discusses the number of legal cases former President Trump is facing as the 2024 presidential campaign continues ahead of the next election. #CNN #News",
        "transcript": "In US presidential politics. Former President Trump continues to bounce around\nfrom courthouse to the campaign trail. This morning, he was back to face trial\nfor his statements about former columnist Jean Carroll's\nsexual assault allegations in 2019, just ahead of the New Hampshire primary. He got a boost from Florida Governor\nRon DeSantis, who decided to drop out of the race\nand back him. Conservative lawyer George Conway now\njoins Michel Martin with incisive analysis on how Trump's legal woes are playing out in shaping this campaign. Thanks, Christiane. George Conway,\nthank you so much for talking with us. Thank you for having me. So, look, I know you're a lawyer\nand a legal analyst. You're not a political analyst per se. But I did want to get your take on\nwhat we've just seen in Iowa as we are speaking now. The Iowa caucuses are just behind us. You know, it's by all accounts, a decisive victory\nfor the former president there. Just what are your thoughts about that? Well, I mean, this is where we are. I mean, I've been saying\nfor quite some time that I thought that we're going to have the first\nfor the first time running as a major party candidate\nand a convicted felon. And that's what he I think he will\nbe that by the time the fall rolls around, because I do think the trial here\nin the District of Columbia, the January six trial,\nthe one brought the case brought by Jackson just against him before\nJudge Sharpton here in the district. I think that one's going to go to trial. You know, it's\njust a remarkable confluence of firsts. I mean, we have the first adjudicated rapist who is going to win\na major party nomination. The first person who has been, you know,\nwho is under indictment in four separate jurisdictions\nwith 91 counts. I mean,\nit is just absolutely unprecedented. But with Donald Trump, it's almost it's almost inevitable\nthat this was going to happen. Do you have any thoughts\nabout why these very serious allegations don't seem to make much difference\nin the political realm? I mean, you have, you know, close connections to people\nin the Republican political world. And I'm just interested in what you think\nabout that. It's partizanship run amok in part. And that I think a lot of this\nI mean, I do think there is some segment of the population\nthat wants a strong man. And I don't mean\nthat in a complimentary way. I mean not in the in the sense of of a crazy dictatorial\nauthoritarian figure. They want to just basically assume the facts, the basic\nwhich are true are true. They don't want to think. They don't\nthey're not interested in evidence. But I think another thing\nthat's going on here, I think a lot of this is that people don't want to admit\nthat they were wrong about Donald Trump. They don't want to admit that he's a bad person, because\nif they admit that he's a bad person, then they by extension, are admitting\nthat they are not good people for supporting it more. At least\nit tarnishes them in their own eyes. So they have to justify where they've been\nand and and where they're going, because they just don't want to miss that he led them astray\nand that they've been suckered and that that they're wrong\nand that he's bad. I think that's a big part of it. Is that true? You think that's true\nfor people in your own orbit? Well, you know, I mean, my orbits changed\na bit over the last few years, But I think, you know, part of it\nis not wanting to make your home a party. And it also is there's an identity there. There's a there's a a tribalism there. And, you know, you don't you don't want to be excluded from the tribe because you don't\nyou think the other tribe, the liberals who you've been hating on\nfor so many years, they're never going to accept you. And if you if you dare question\nthe leader, you'll be cast out of your own group\nand your vote. The other thing that I think is going on is there is an economy\nthat has been built around Trump. And Trump is I think there's a whole\nyou know, you have all of these consultants\nand all these politicians whose livelihoods or their chosen careers\nor their chosen course of of their\nlives is dependent upon not antagonizing\nother people in that community. And so, I mean, you see that\nwith members of Congress who are who who have to fear being primary. You see that with political consultants. I mean, for example, the\nit was reported just the other day that the Trump campaign is saying\nnobody should hire Jeff Rowe, who was a political adviser, a\nchief political adviser for Ron DeSantis, that they he's going to be blacklisted\nand nobody wants to be blacklisted. Nobody wants to be cast out of the tribe. And there is just there's also fear\nof physical intimidation. And I think we saw that to some extent with Lindsey Graham\nback in January of 2021, where he dared utter that he was done with Trump\nor something like that, and he was accosted at an airport\nby bike by Trump. And you saw also\nI mean, one of the things that you see when Liz Cheney\nwas running for reelection in Wyoming, she had a big security detail\nin Wyoming with the general. And there is a there is certainly a degree\nof physical intimidation. And that, you know, frankly,\nif that's what January 6th was all about. So let's pivot around to the subject. That sort of brought us together today,\nwhich is you have actually said that you think that Trump will, quote,\nspend the rest of his life in jail. You really think that? I do think that. I mean, he's either going to be in prison\nor he's going to spend\nthe rest of his life in prison. And he certainly deserves to spend a life\nof the rest of his life in prison. I think that if you take any combination of the counts in these four indictments with which she's been charged,\nyou will take almost any conviction. And almost any combination of them is going to put him in jail\nfor a number of years. And, you know, this is a\nthis is a 77 year old man. So I think there is a very good chance\nhe'll spend the rest of his life in jail. And and that's part of the dynamic\nthat is going on here. He knows that. I mean, he's not a strategic thinker. He's a he's a sociopath. He's a he's a he's a man with a million\nI'm not going to say intellect, but he understands that he is cornered. And that's when people you know, people\nlike him with that kind of psychology are the most dangerous.\nBut he understands that. He understands that the only way for him to escape the trouble\nthat he's in is to be elected president. Do you think that the purpose of this\npresidential campaign is to keep him out of jail? I think that is one major purpose. I think another major purpose is to be\ndoes you know, he's motivated by the things that motivate\nnarcissistic sociopaths, which is our praise and a desire to to inflict\nrevenge on people who have defied him. And I think that we've seen that in\nsome of what what what he used is people are planning for 2025\nshould he be elected. I mean, they're going to\nthey're going to seek retribution. He says he's seeking retribution\non behalf of the American public, or at least his slice\nof the American public. But that's what motivates him. I don't think you can understand\nwhat Donald Trump says and does on a daily basis\nsimply by saying, oh, he's a bad guy, he's\na Republican, he's a authoritarian, he's he's racist, he's misogynist, he's\nthis or that. You have to tie it in\nto his fundamental psychological profile. People should not shy away from that. Okay. Because I do not think you\ncan understand his behavior without understanding his psychology. And I think we're seeing that in\nthe courtroom as as it's happening today or this week in the evening, Carol. Trial going\nsee it even more in the future. So let's talk about of of he's got 91 felony account\nfelony counts across four cases. What do you think\nis the strongest of those? Oh, well, I think the strongest one\nwith the strongest case I think is which is a slam dunk case\nbecause it's so simple is the case in Florida\nthe moral documents case? You know, there is no there\nthere's really no factual dispute about what happened there because he was caught\nred handed with the documents. The documents do not belong to him.\nThey belong to the United States of America. They had classified document markings. And it doesn't even matter\nthat they were in fact, quote unquote, classified because the charges\nthat he has been that were filed against him were to include charges\nunder the Espionage Espionage Act. And and those charges\ndo not turn on the specific mark. Whether they are specifically\nmarked as classified. They simply turn on whether or not it's\nnational defense information of any degree\nof significance, sensitivity. And you have that\nand the fact that there are witnesses and there's video and and all sorts\nof evidence that he tried to hide those and did hide those documents from the FBI\nand that he failed to produce them when he was served with a subpoena\nby the Department of Justice and that he had his lawyers\nlied to the Department of Justice. And that's those are simple, simple, easily\nprovable acts of obstruction of justice. And when that case goes to trial, I think I don't know that it's\ngoing to go to trial this year because it's hard to say what the judge\nthere is doing in terms of scheduling. But I don't he doesn't have a defense in that case,\njust not not a shred of a defense."
    }
}