{
    "F6XPR71-KRo": {
        "title": "This MINI PC Is The PERFECT Home Server",
        "thumbnail": "https://i.ytimg.com/vi/F6XPR71-KRo/hqdefault.jpg",
        "author": "Server Science",
        "date_of_release": "2023-12-13T14:00:10Z",
        "duration": "PT18M51S",
        "view_count": "253232",
        "like_count": "4055",
        "comment_count": "160",
        "description": "We're taking a look at this HP Prodesk 400 G3 Mini PC to see if it's a good power efficient home server for virtualisation. We're testing it with Proxmox and Debian to run a Minecraft server. \n\nIt has an Intel Core i3 7100T, 4GB of DDR4 SODIMM memory and a 256GB NVMe SSD in a 1 litre form factor. It's affordable and only draws 10 watts of power.\n\nThis video is fully captioned in English.",
        "transcript": "Hello folks, today, we’re taking a look\nat a system that, as we’ll soon see, might be the perfect answer to your home lab needs. It’s powerful, but power efficient, and\nhas some really great features and upgrade potential in a tiny form factor. And here it is, it’s this little computer\nfrom HP, and it’s one of the best low power systems that you can buy right now for your\nhome lab. We’re going to take a close look into the\nhardware, as well setting up Proxmox to do some virtualisation and run a Minecraft server. This is the HP Prodesk 400 G3 Mini that I\npicked up on eBay for less than 80 US dollars. And before you run to the comments to correct\nme on the price,  remember that I don’t live in the US, and don’t buy things in US dollars. Anyway, why do these systems exist and who\nbuys them new? Well, they’re for businesses. Really big businesses, who need a whole load\nof computers that perform well but consume very little power and don’t take up much\nspace. They’re basically thin clients, but aren’t\nterrible and underpowered because they don’t need a virtualised environment on the network\nto do any actual serious computing tasks. We’re not talking about a system this size\nwith an integrated Celeron or Pentium, no this has an entire Intel desktop\nprocessor in a one litre form factor. These systems keep the power bills down while\nstill providing decent performance for everyday tasks, and even though the target audience\nis very clearly businesses, it doesn’t mean they can’t be a great addition to your homelab. You can use them as something like a media\nserver, virtualisation node, or they can even fill more important roles within your home\nnetwork as something like a  router, firewall and DNS server, all in one. The whole system draws as little as eight\nwatts of power at idle, meaning, for at least the power consumption, it’s comparable to\nRaspberry Pis and other single board computers. I have an older Pi 2B somewhere that I used\nfor quite a few years, but I don’t know where it is, so you’ll just have to imagine\nthat I’ve got it here. I’ve used a variety of Pis over the last\nfew years, and, like the 2B, they all typically consume around 2-3 watts of power at idle, so\nthe increase of 5 watts for the HP system is pretty much nothing. That is basically as much as charging a \nphone. In terms of power bills, it would cost me\naround 9 or 10 dollars to run this system 24/7 for an entire year, or basically the price of\ntwo McChickens. That’s pretty much nothing, and is surprisingly\nquite a bit less than the router provided by my ISP. Coming back to single board computers, I really\ndo like Raspberry Pis, but I haven’t had much interest in them recently because I’ve\nfound them to be a bit limited, especially in terms of features and expandability. Don’t get me wrong, I spent many years using\nmy Pi 2B for retro gaming and web server stuff, and it was great, but it really wasn’t perfect. They definitely have their uses for some people,\nbut they’re just not cheap anymore  like they used to be. I remember when they were meant to be\naround $30, and now you’d be hard pressed to get a Pi 5 for less than like $90, at least\nwhere I live. It gets worse though, because the problem\nwith buying Pi’s on their own is that they don’t include a power supply, case or any\ncooling at all, so many people go for a bundle, which, of course, costs more. Starter kits that include all the necessary\ncomponents are cool and very useful, but you still need add-on boards, or Pi hats, to get\nsupport for features like M.2 storage. That’s why I’ve found myself really liking\nthis mini PC, because having an Intel processor with M.2 and upgradable memory in a compact\nsize is really useful,  and is actually really affordable too. While it is substantially larger than a Raspberry Pi,  I think the features and performance make up for the size. So, what hardware did I get? While there are many different configurations\nfor these HP systems, this Prodesk 400 G3 has an Intel Kaby Lake i3 7100T dual core\nprocessor. It’s not a particularly powerful processor,\nwhich is something I think is important to keep in mind. If you want more cores, you’ll end up spending\na bit more, but older generations  of these systems can often be quite a bit cheaper. While it definitely isn’t difficult to get\na more powerful computer for the same price, if you want something that’s compact and actually\npower efficient, then this, so far, seems to be a really good way to go. The third generation of these HP systems support\nboth 6th and 7th generation processors, but we are limited to the 35 watt processors in\nthe Prodesk 400. There’s a 65 watt version of the Elitedesk,\nwhich supports up to the i7 7700, but the immediate question is, how do they cool it? For starters, the CPU cooler in the 65w model is copper\ninstead of aluminium, which is great, but they also just stamped a bunch of holes in the\ntop panel because that’s where the  laptop style blower fan draws in the air. Too bad they didn’t do that for all the\nother models. The processor we got with this system is an\nodd one, because, while it does have hyperthreading, it doesn’t support, or even actually need\nturbo boost. To keep the TDP at only 35 watts, the more\npowerful processors like the i5s and i7s have reduced base clocks, but then use turbo boost\nto bring the speeds up, and as a consequence, the power draw is increased too, but only\nfor short time periods. The i3 7100T doesn’t need to do that because\nit only has two cores and can run at 3.4 gigahertz all the time. It also doesn’t produce much heat for that extra speed. My prodesk came with four gigabytes of DDR4\nSODIMM memory, which I know isn’t much, but it doesn’t really matter for my needs. The included module is actually rated for\nup to 2666 megahertz, which this processor isn’t compatible with. Like the majority of the non-HEDT Kaby Lake\nprocessors, the 7100T’s memory support maxes out at 2400 megahertz, so the included memory\nwill just run a little bit slower than it’s meant to. The system’s support maxes out at 32 gigabytes,\nusing two 16 gigabyte modules, although that does go up to 64 gigabytes in the newer generations. This system didn’t come with any storage\nor a WIFI card, because I asked the eBay seller if they would remove both before sending it to me, and they offered a reduced price for that. It’s always worth asking for something like that, because I’d\nrather not pay for features and hardware  that I’m not going to use. The WIFI antennas are still installed in this system, so\nI could get a WIFI card later on if I want. I also have plenty of storage that is faster\nand more reliable than a functionally useless SATA laptop hard drive, even something as cheap\nas a WD green SSD would do. I understand the need for the hard drive so\na copy of Windows can come preinstalled for the average user, but I’d rather not contribute\nto E-waste any more than I already do. One really important thing to keep in mind when buying these\non eBay is that many of them are sold as barebones, which means they don’t include processors\nor memory, and often don’t include the proprietary and mandatory power brick either. I’d steer clear of these kinds of listings,\nbecause it tends to mean that eBay seller has taken all the good parts to resell them. That kind of system could be good if you already have a processor\nand memory, but it can also affect your ability to get a refund if the system is faulty and\nthe seller decides to be less than honest  about whose problem it is. Moving on, it’s time to take a look at the\ndesign and the hardware features. I really like the styling of this generation\nof HP mini PCs because they come in this good looking little chassis, that I think contrasts\nthe angled vents on the front with the silver accent for the ports and power button quite\nwell. Compared to the other options from around\nthe same time, I think the HP systems look the best, mostly because the Thinkcentres\nuse cheap feeling shiny plastic, and although the Optiplexes are a bit better, I still think they look quite dated too.  You might not agree with me on that, but I\ndo think the latest models from all three companies are a big step up, it’s just that\nthe HPs looked better for longer. The build quality is really nice too. The entire chassis and top panel of the Prodesk are made from metal with a very nice black\npaint finish. Even the front panel feels nice, although\nit is still clealy painted plastic. One downside for these is that the vents on\nthe front are mostly fake, with tiny slits in some of them to let air through. I don’t know how much actual vents would\ndo, because the fan doesn’t really draw air from the front of the system anyway. Speaking of the fan though, it was kind of\nloud at 50% speed, but  kept the processor at reasonable temperatures under a 100% load. Next up is the ports and the hardware. On the front of the system, we’ve got two\nUSB 3.1 ports, as well as the typical 3.5mm audio jacks. There’s one thing missing that the higher\nend models get, and that’s the USB C port, but, as someone who doesn’t use USB C, I’m\nnot bothered by the lack of it. Moving to the rear of the system, we get a\nsingle DisplayPort connector, as well as a serial connector, FlexIO expansion with a\nVGA port, two more USB 3 ports, two USB 2 ports, a single gigabit Ethernet nic and\na barrel power jack. There is some variation in the ports you get\non the different models, but even here on the Prodesk 400, it’s an alright selection\nfor most uses. The serial port is normally replaced with\nDisplayport or HDMI on the higher end systems though, and with the integrated HD 630 GPU, you can\nrun three monitors at once. The major feature we don’t get on this Prodesk\n400 is Intel vPro, which isn’t a big deal for me, but if you do want it, you’ll need\na compatible system and processor. The easiest way to tell if your system has\nit is that the Intel sticker will say vPro on it, provided the sticker is original, of\ncourse. vPro gives you access to remote management features\nthat allow you to control and configure the system, over the network, similar to IPMI on a server motherboard. I don’t think vPro is as good as IPMI in\nmost cases, and it can be a serious security risk on some incorrectly configured systems with outdated firmware. I don’t use it on any of my systems because\nI really don’t have much hardware to manage, but, like most of the things I don’t use,\nit might actually be really useful for you. Now we’re going to take a look at the internals. To open the system up, we just undo the single\nthumbscrew on the rear, and slide the top cover off. The thumbscrew is retained in the back of the system, which\nis really great because it means I can't lose it. Inside, we find what is basically a laptop\nfan, along with this tiny heatsink that exhausts hot air out the back. Under the fan, we find the two SODIMM memory\nslots, only one of which is populated at the moment, but the 7100T does support dual channel\nmemory for extra bandwidth. The memory in this system is just regular\nlaptop memory, and while it is good being able to upgrade it, the board doesn’t support\nECC. There is space for a 2.5 inch hard drive or\nSSD on the left side of the system, connected with a flexible ribbon cable that combines\nSATA power and data into a single connector. The hard drive tray and all four screws to\nmount a drive were included with my system, but that unfortunately isn’t going to be\nthe case for all of the systems on eBay. The big problem is that many of these, especially\nthe newer ones, were optioned to only have an M.2 drive and won’t have the metal tray, screws or\neven the sata cable. We do get a single HP FlexIO V1 expansion bay in\nthe rear, which has a card installed that gives us a VGA connector, for whatever reason\nyou’d need or want that. The expansion bay does allow us to install\none of a variety of small modules that add extra ports, but there isn’t much available for\nit. I did a bit of looking, and all I could really\nfind was USB and video connectors, as well a serial port for the higher end models that don’t\nalready have it. There’s a much better range of cards for\nthe two newer versions of FlexIO, since they’ve released 2.5 and 10 gigabit Ethernet options,\nas well as thunderbolt and a gigabit fibre module, as well as extra USB and video connectors, as mentioned before. By removing the VGA card that I already have,\nwe’ve got this open space to put things in, and I have a much better, and cheaper,\noption that I’m going to be taking a look at in the future. There’s definitely room for some pretty\ngood hardware upgrades in this system, even though there isn’t much space for storage. The storage is a big trade off when you go\nwith a system this small, but if you actually need full sized hard drives, this isn’t\nreally the system to go with. sata connector is only wired for the 5 volts\nrequired by laptop drives, and doesn’t have the 12 volts required for desktop hard drives, if you could even fit one in. I’m going to be using a 256 gigabyte\nM.2 SSD from an old laptop. The drive saw around two or three thousand hours of use, but barely\nany significant  writes at all and should have a lot of life left in it. Keep in mind that this system only supports\nM.2 NVMe, and not M.2 sata drives, which are slower but often significantly cheaper. HP didn’t wire the connector up for sata,\nsince they probably didn’t expect anyone to want to use it for that. The drive I selected gave a perfect result\nfrom a SMART test, without any bad sectors and barely any terabytes written. I’ve removed the cooler to replace the thermal\npaste because I don’t know how old it is, but it does seem like the seller had already\nreplaced it. It would’ve worked fine, even though they\nmade a small mess of it by using way too much. I have a bit of this Deepcool z5 left over\nfrom another video, so I’ll just put a little blob in the middle of the heat spreader and\nreinstall the heatsink. The air guide goes in behind it and then the\nfan slides back into place in front of it. Now, let’s take a look at the kinds of things\nwe can do with a system like this. My first thought was maybe that we could install\nTrueNAS, but that wouldn’t really be practical because there’s only one sata drive connection. There are newer models that have dual M.2\nslots for SSDs, and they would probably make great flash servers, but this one is a bit\ntoo old for that. There are a few ways to get around the storage\nlimitation, but they’re a bit janky and involve M.2 cards with either sata or SAS connectors and\nan external power supply. It is completely possible to add external drives to these mini PCs,  and might even work quite well, but really, why? I think it would be better if you need a storage server, to just get the  larger small form factor models that have actual hard drive bays and low profile PCIe slots. You can easily setup two mirrored drives in\nthose, which is pretty much the bare minimum for a NAS, and with those PCIe slots, you could also install a graphics card for video encoding. Unfortunately, the prodesk mini doesn’t\nhave any of those options, but it can do plenty of other things, so let’s take a look. Figuring out what to do with it was just a\nlittle bit more difficult than it should’ve been, because I only normally use a TrueNAS\nas a file server, and haven’t put much thought into anything else. The answer turned out to be virtualisation,\nalthough this won’t be a tutorial, but I thought it was quite interesting to figure\nout how it all works. I started by installing Proxmox on the system\nso we can virtualise Debian linux and run a basic Minecraft server. The main reason I chose Debian is because\nit’s the distro I’m the most familiar with, mostly because of the Raspberry\nPi’s custom version called Raspbian, but I don’t want to get into Linux distros because\nthat tends to anger some people. Debian is great for a server because the installer\nincludes an option to just not install a desktop environment at all, meaning we can use remote\naccess to control it via the terminal and the GUI won’t take up all the system resources. With Proxmox installed, I went to the web\ninterface, uploaded the ISO file, went through the setup and configuration for the VM and\nbooted it. Once we got into it, I downloaded the packages\nfor the Minecraft Spigot server, which, is way better optimised than the vanilla server,\nbut still pretty much keeps the normal gameplay that we all know and love. I know everyone has their own preferences\nfor Minecraft servers, but the biggest problem I’ve had with the vanilla version is its\nperformance, even on systems that really should be able to handle it. And here it is, we’re in the game and it\nseems to be running decently without any lag, although the server had all the available\nmemory assigned to it. An extra four gigabytes really doesn’t cost\nvery much, and more memory would probably help with lag from having extra players, although\nwe still only have two cores. With only two cores, we wouldn’t want to\nrun anything else at the same time, but can at least handle a single Minecraft server\npretty well. There’s definitely more advanced things\nwe can do, like port forwarding so people outside of your home network can play, or we could've installed mods \nor plugins. I don’t plan on actually running a Minecraft\nserver regularly because I don’t really play it anymore, but it was interesting to figure out how Proxmox works and see what we can do with it. There’s also plenty more you can do with\nProxmox, it’s not just limited to Minecraft. As it currently is, I don’t think this system\nwould be able to run more than one or two VMs like this at once, but we have plenty\nof storage left, so we can have others that don’t have to run all the time. We definitely don’t have the crazy core\ncounts of platforms like X99, but that’s why mini PCs like these have become very popular\nfor clustered Proxmox and other virtualisation setups. My fairly limited understanding of it is that you have a controller, along with multiple worker nodes that actually run the services and VMs. What that means is that if one node fails,\nthe services are easily moved to and run on a different one, and then the failed node\ncan be fixed. That gives better availability of services\nand reliability of the cluster overall, and with systems like this, the power consumption\nis still kept at a minimum. That’s really why these systems are so great\nfor homelabs, because they keep power consumption at a minimum, so your power bill doesn’t\nlook like the entire US defence budget, even with multiple system running at once. You get great performance for running software\nand services without breaking the bank, and it’s super easy to get virtualisation set\nup and running, even if you’ve never done it before, and before this video, I hadn't. The minecraft server is all we’re going\nto be taking a look at in terms of virtualisation today, although I have a couple of very interesting\nthings planned for this system in the future. So you don’t miss out on future content,\nmake sure to subscribe to the channel and turn on notifications with the bell icon. Also, if you’d like me to take a look at\nother models of mini PCs in the future, let me know which ones in the comments. Thanks for watching, I’ll see you all next\ntime."
    }
}