{
    "hdwaWxY11jQ": {
        "title": "Apple Vision Pro review: magic, until it’s not",
        "thumbnail": "https://i.ytimg.com/vi/hdwaWxY11jQ/hqdefault.jpg",
        "author": "The Verge",
        "date_of_release": "2024-01-30T14:00:35Z",
        "duration": "PT28M45S",
        "view_count": "1874679",
        "like_count": "55498",
        "comment_count": "4815",
        "description": "Apple’s long-awaited entry into the world of computers you wear on your face is here. Apple claims that the Vision Pro, a VR headset that starts at $3,499, is the beginning of something called “spatial computing,” which basically boils down to running apps all around you. The Verge’s Editor-in-Chief Nilay Patel answers all your Vision Pro questions. #Apple #Technology #AppleVisionPro\n\nRead more: https://trib.al/oniBlvx\n\nListen to The Vergecast: https://www.youtube.com/watch?v=pANxZ62BtBo \n\n0:00 Intro \n2:00 Spatial computer or a VR headset?\n2:59 EyeSight and front display\n3:38 Hardware and accessories\n6:38 Displays & field of view\n8:27 Video passthrough (latency, dynamic range, motion blur)\n11:41 Personas and FaceTime call with Marques Brownlee (@mkbhd) and Joanna Stern (@wsj) \n14:29 Eye tracking \n16:26 Hand tracking \n17:41 VisionOS (apps and window management)\n19:27 Secondary Mac display\n20:22 AR & MR \n21:25 Watching movies with Vision Pro \n23:18 Spatial videos \n25:01 Conclusion \n\nSubscribe: http://goo.gl/G5RXGs\nLike The Verge on Facebook: https://goo.gl/2P1aGc\nFollow on Twitter: https://goo.gl/XTWX61\nFollow on Instagram: https://goo.gl/7ZeLvX\nFollow on TikTok: http://bit.ly/42VeCVU\n\nThe Vergecast Podcast: https://pod.link/430333725\nDecoder with Nilay Patel: http://apple.co/3v29nDc \nMore about our podcasts: https://www.theverge.com/podcasts\n\nRead More: http://www.theverge.com\nCommunity guidelines: http://bit.ly/2D0hlAv\nWallpapers from The Verge: https://bit.ly/2xQXYJr\n\nSubscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday: https://bit.ly/3I6nJtz\n\nIf you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit: https://www.theverge.com/ethics-statement",
        "transcript": "- Well, it's here. The Apple Vision Pro is\nApple's long awaited entry into the world of computers\nyou wear on your face. It's a headset that starts at 3,499 that Apple claims is the beginning of something called spatial computing, which basically boils down to\nrunning apps all around you. Apple has to claim that the Vision Pro is the beginning of something new because people have been\nbuilding VR headsets for over a decade now. I first tried on the\nOculus Rift at CES in 2013. - Here it is. This is a stereo. Oh, oh. Can you still see it? - No.\n- My foot just hit this thing. - Oh, we're back. The latest successor of that\nOculus is the Meta Quest 3. A very complete $500 headset\nwith a huge library of games. \"Verge\" editor Addie Robertson, who helped me with this review has tried on basically every other headset that's been released in between. In the meantime, Apple,\nfrom Tim Cook on down, has largely insisted that it's\nfar more interested in AR, augmented reality, than VR, but now Apple has up and\nlaunched the Vision Pro, which is meant to be a full-fledged\ncomputer with real apps that lets you get real work done. Something that can sit right\nalongside the Mac and the iPad in Apple's ecosystem of devices, but the Vision Pro also\nrepresents a series of really big trade-offs. Trade-offs which are impossible to ignore. Like this wacky external battery is a really big design trade off, but there are other more\nphilosophical trade offs as well. And as I've been using the\nVision Pro for the past few days, I kept boiling them down\nto a series of questions. (bright upbeat music) Is using the Vision Pro so good that I'm willing to mess up my\nhair every time I put it on? Is it so good that I wanna lug around this giant carrying case\ninstead of my laptop bag? Is it so good that I wanna look at the world\naround me through screens instead of with my own eyes? Basically, do I prefer using a computer in there or out here? Let's talk about it. Apple doesn't want anyone\nto think of the Vision Pro as a VR headset, but it's a VR headset. It's a VR headset with\nincredibly good spatial tracking that almost lets you pretend\nit's not a VR headset, but it's a VR headset. You put it on your head in a way that blocks out reality entirely and then it shows you video feeds passed through from the\ncameras in the front, making it look like you can\nsee right through the device, but it can also show you anything else at various levels of immersion. Here I am on the moon. Here I am halfway immersed at Joshua Tree and halfway still in the loft. It's neat. The Vision Pro hardware is stunning compared to most other VR headsets, which are largely plastic and\noften downright goofy looking. The Vision Pro is built of\nmagnesium, and carbon fiber, and an aluminum enclosure that feels like a natural extension of Apple's familiar design language. There's a little iPhone 6 in there, a little AirPods Max,\na little Apple Watch. It is the cutting edge of technology in a package that seems\ninstantly familiar. Almost everyone I've shown it to thinks it looks smaller in\nperson than they expected, especially compared to some\nof the huge VR headsets we've seen over the the past decade. The front display on the Vision Pro is a little bit of marketing genius. In photos, it looks\nlike a big bright screen that shows your eyes to people around you in order to keep you\nconnected to the real world. In reality, it's a\nsomewhat dim low res OLED covered in glass so reflective it's actually hard to see in\nmost normal to bright lighting. And from the inside, there's no indicator of what other people outside are seeing, so no matter what's on\nthe front of the headset, everyone just perceives\nyou as being in there. It's not like you're\nmaking real eye contact. On top of that, the eyes themselves are pretty creepy and kind of off-putting. I'm not sure any of this\nworks like Apple wants it to. The other thing under the cover glass is cameras and sensors, a\nlot of cameras and sensors, and underneath those\nyou've got an M2 processor and Apple's new R1 spatial co-processor along with a pair of fans to move the heat from all those cameras, processors,\nand displays at the top. You never really hear or feel\nthe fans as far as I've seen, but this thing definitely gets warm, and you can feel that warmth\nafter long sessions wearing it. On the top edge, you'll\nfind a large version of familiar Apple Watch controls. A Digital Crown that\nadjusts both the volume and the level of virtual\nreality immersion on the right and a camera shutter button on the left that lets you take 3D photos and videos. You get two headbands in the box. The solo knit band and the dual loop band. They both attach and detach easily. You just pull the little\norange tab to disconnect them. The solo band is unquestionably cooler and messes up your hair less, but they both mess up your hair, so if the dual loop fits\nyou better, just go with it. The other two pieces are the light seal, which comes in various sizes, and the headband, which\ncomes in two thicknesses. Both attach magnetically, which means they also detach magnetically. You wanna pick this thing up by the frame because grabbing it by the\nlight seal can lead to disaster. If you have glasses you can click in custom Zeiss lens insert. Apple sent us these reader lenses to see what it all looks like, but I just use the Vision Pro while wearing my soft\ncontacts and it was fine. The speakers are housed in\nthe little arms on the side, and they are good and loud and do a convincing job of\nrendering spatial audio. Things really sound like they're happening where they appear to be\nhappening, which is cool. The downside is they're pretty loud, and everyone else around you\ncan hear what you're up to unless you use headphones. You can use any Bluetooth\nheadphones you want, but you get a bunch of extra features if you use the latest AirPods Pro, like lower latency and lossless audio. The main thing about the Vision\nPro is that it's just heavy. You're supposed to wear\nthis thing on your face for long stretches of computer time. Depending on what band\nand light seal you use, the headset alone weighs\nsubstantially more than an 11-inch iPad Pro and gets close to a 12.9-inch iPad Pro. In a very real way, this\nis an iPad on your face. It's also substantially heavier\nthan the familiar Quest 2 or even the heavier Quest 3, and those headsets include\nbuilt-in batteries. Apple specifically chose to\ngo with an external battery to reduce weight. The battery itself is\nbarely worth talking about. It's a silver brick with a USB-C port and an LED that's green when it's charged and orange when it's not. The cable is permanently\nattached, so don't break it. I don't really have strong\nopinions on this battery, which feels like a particular kind of win. It's funny that Apple of all companies shipped this compromise,\nbut it's also very Apple that the battery isn't actually\nbigger so it can provide more than two and a half\nhours of battery life. The battery being external means that all of the Vision Pro's heft is totally front loaded. Other big headsets like the Quest Pro have elaborate headbands to\nbalance out their weight, but no matter which of\nApple's bands you're using, the Vision Pro just\nrests it all on your face and after a long session in\nthere, you definitely feel it. (bright upbeat music) Apple is very proud of the\ndisplays inside the Vision Pro, which are tiny microOLEDs with incredible pixel\ndensity and resolution. These displays are the main reason this thing is so expensive, and they're at the heart of\nthe Vision Pro experience. You're always looking at them after all, and that's the thing that makes a video review\nlike this the hardest. I can't actually show you what it's like to look through these\nlenses at these displays. They don't light up\nunless you're wearing it. And even if we could trick the Vision Pro into turning on without a head inside, there's no camera that\nreally acts like your eyes, so I'm just gonna describe it to you and our art director, Alex Parkin, is gonna layer effects over a\nscreen capture to simulate it. The first thing about the displays is that the field of view isn't huge, and the essential nature of VR displays makes that field of\nview feel even smaller. Apple won't tell me the exact number, but it's certainly smaller\nthan the Quest 3's 110 degrees. So you have fairly large black borders around what you're seeing, a bit like you're looking\nthrough binoculars, and then there's a little bit\nof color fringing, distortion, and vignetting around\nthe edges of the lenses, which shrinks the usable\nfield of view even more. You can't just glance to\nthe side of the displays because they're not sharp edge to edge. You have to turn your head a little. And whenever I looked at something particularly high contrast,\nlike a white window of text floating above a dark desert landscape, I could see highlights\nreflecting in the lenses. If you've been paying attention\nto VR for the past decade, you know these are very familiar\nVR headset display issues, but Apple is charging\n3,499 for the Vision Pro and making it sound like these displays are perfect representations of reality, which is where you can really\nfeel the company's ambitions getting ahead of the product itself. See, this thing, a VR headset with a silly external\nbattery pack, isn't the goal. Apple's been talking about AR forever, and the true goal of AR is optical AR where light passes directly\nthrough a lens to your eyes and digital information\ngets layered on top of it. The tech for that dream\njust isn't there yet. Optical AR headsets like the Magic Leap 2 have huge compromises in them that simply can't deliver\neverything Apple wants to do, so Apple settled for video pass through. It is the defining trade\noff of the Vision Pro, and let me tell you, the video pass through on\nthe Vision Pro is great. It works. It's convincing. You put the headset on,\nthe display lights up, and you're right back where you were only with a bunch of visionOS\nwindows floating around you. It sounds simple, but it is an astonishing\nengineering achievement to do all of this in real\ntime and high resolution in a computer that fits over your eyes. Apple claims there's only\n12 milliseconds of latency between what the cameras see\nand what's on the display, and that latency includes\nthe exposure time of the cameras themselves. The actual data processing is faster. Do the math, and Apple says there's not even a\nframes worth of latency. The next frame of video is ready before you're done\nlooking at the last one, and you can see Apple's incredible\nskill at processing video right in front of your eyes. I just sat around scrolling on my phone while wearing the Vision Pro with no blown out screens\nor weird frame rate issues. I did some work on my\nMac in front of a window, which is a torture test for dynamic range, and yeah, there were some\nweird exposure issues, but it was usable in a way that basically nothing else would be. The problem is that\ncameras are still cameras and displays are still displays. Cameras have motion blur, for example. In low light, cameras have to\neither increase exposure time at the cost of sharpness or increase ISO at the cost of noise, which then requires noise reduction, which makes things blurry and dull. And cameras and displays\nboth have real limits in terms of color reproduction. So yes, you can easily see motion blur when you move your head in the Vision Pro. Motion blur that increases in low light and leads to some weird\nwarping of straight lines. Low light also causes\nthe overall sharpness of the video pass through to drop as noise reduction kicks in. My iPhone screen got noticeably\nblurrier when the sun set. And Apple specs say the display supports 92% of the DCI-P3 color space, which represents about 54% of\nall the colors people can see, which carry the one, that means the Vision\nPro can only show you 49% of the colors your\neyes can actually see. Look, here's something really silly. This is what it looked like\nwhen I glanced at the clock on my microwave last night. That's just some weird camera stuff, and stuff like that happens all the time. I'm a huge display\nnerd. I love this stuff. I would never tell you\nabout the color gamut of a phone or a laptop, but if you're asking me to\nput this thing over my eyes and perceive reality through it, I kind of want it to look like reality. I want all the colors of the rainbow. I'm serious when I say this\nis the best video pass through I've ever seen on the sharpest VR displays any regular person will ever come across, but reality is really hard to reproduce, and the Vision Pro constantly reminds you that you are looking at video on screens. I think reality is just\nmore interesting than that. This is the best anyone has\never made in there look, and it's still not as good as out here. One of the headline features of the Apple Vision Pro and visionOS is something called Personas, where Apple has the\nVision Pro scan your face, scan your head, and make a 3D model of you that you can then use to\nvideo conference with. I'm gonna go through the\nprocess of making that model and then we're gonna call some friends and see what they look like. It's in beta. Apple says this isn't final. They're still tuning it. They wanna see how regular\npeople react to it. I'm just gonna hit Get Started, and it's actually prompt\nme to take the headset off. - [Vision Pro] Slowly turn\nyour head to the right. Now slowly turn your head to the left. Now tilt your head up, then tilt your head down. Next, let's capture\nyour facial expressions. Smile with your mouth closed. Then make a big smile\nwith your teeth showing. Now raise your eyebrows.\nClose your eyes for a moment. Capture complete. Put Vision\nPro back on to continue. - Oh boy. Let's see how this looks. I would say I look like\nI'm wearing a beret. Let's be honest. I feel like I'm wearing\na beret in this capture. Let's call some people\nand see what they think. (Vision Pro beeping) Marques, you look the most like you of anyone I've seen in this, I would say. - [Marques] You guys, you both look like not like a photo of you, but like someone drew you from a memory. - From a nightmare they had of me. Like I can't move my hair, so it's just all like on my chest kind of. - [Marques] Like connected\nto your collar, yeah. - Can you do a big hair swish\nin real life? What happens? - Yeah. (Nilay laughing) - It just did not move at all. - Not even a little bit. - I will say the spatial\naudio helps a little bit. It's actually coming from the\nside that the person is on. Also, do you see my hand? I've seen people where their hand shows up.\n- Oh yeah. You're like this emoji, right? You're like doing this thing, yeah. - [Marques] Yeah, I can see it. Okay. - [Joanna] All right, how am I? Is it good?\n- Yeah yours are good. A little faded out. - [Marques] It's a little cartoon hand. - Also when you're close to\nthe face, it does the blur, but if you've got like\na little bit of space. - It's both really impressive and really bad at the same time. (Nilay laughs) Because I'm thinking about all the things that it's figuring out with\nwhat our faces are doing. Like it is getting us blinking and our like eyebrows moving\nup and down and even the mouth. I don't know how it sees\nmy mouth, but then I blink and I look at it again\nand it looks absurd, so. - Literally while Marques was saying it was getting little\nmovements, his face froze on me. It's like hard to have this\nconversation right now. That's what I will say about this. I understand why it's in beta. I think if they're like, \"This is done,\" people would be like, \"Is it?\" (bright music) The other thing Apple is very proud of is the hand and eye\ntracking control system, which again is light years beyond any other mass market hand\nor eye tracking systems. The Vision Pro unlocks\nwhat Apple calls Optic ID, so it just sees your eyes\nand it's ready to go, and then you just look at\nthings you want to control and you tap your fingers to control them, and that's how you get\naround the entire interface. The first few times you use hand and eye tracking on the\nVision Pro, it's awe inspiring. It feels like a superpower. The Vision Pro's external\ncameras can see your hands in a pretty large zone around your body. You can have them slung\nacross the back of the couch, resting in your lap, up in the air with your elbows on a\ntable, whatever you want. It actually takes a minute to realize you don't have to gesture\nout in front of you with your hands in the air,\nwhich it's pretty fun to watch other people instinctively do that the first time they try the Vision Pro on. The next few times you\nuse hand and eye tracking, it stops feeling like a superpower, and in some cases it actively makes using the Vision Pro harder because forcing you to look\nat what you want to control is actually really distracting. Just think about every\nother computer in your life. The input mechanism is independent of whatever you're looking at, like I don't think I've looked at my mouse while I'm using it in years. Then there's the fact that visionOS feels designed for eye tracking that's just slightly more\nprecise than it actually is. All the controls are a little too small and a little too close together to let you bop seamlessly\naround the system. You have to look, make sure\nyou're looking, and then tap, or you might end up\nclicking on the wrong thing. I was talking to Addie about this and she described it as\nit works until it doesn't. It's magic until it's not.\nThink about it like this. The touchscreen on iPhone\ndirectly controls the phone, the keyboard on a Mac\ndirectly controls the Mac, the click on an iPod\ndirectly controlled the iPod, but your eyes aren't actually\ncontrolling the Vision Pro. Cameras are watching your eyes\nand turning that into input. Sometimes it isn't perfect.\nIs it the best I've ever seen? Yeah, but it's not perfect. It's the same with hand tracking.\nIt works until it doesn't. Your hands aren't actually\ncontrolling the Vision Pro. Cameras are watching your hands\nand turning that into input, which means, one, the cameras have to always see your hands, and two, the cameras are\nalways turning your hands into input. What do I mean by this? Well, first, even if the cameras cover a large bubble of space,\nthey don't reach everywhere. If you're like me and you drop your hands\nto your sides in a chair, you can't see your hands. If you're lying down in a dark room and those IR illuminators\ncan't reach far enough, you can't see your hands. If you're sitting at a counter and your hands are on your\nlegs under the counter, it can't see your hands. Look, I know you're already\nheaded to the comments to say I'm complaining about\nthe hand tracking system needing to see your hands, like I get it, but what I'm saying is\nit's magic until it's not. Using the Vision Pro\nmakes you constantly aware of what you're looking at\nand where your hands are in a way that's unlike any\nother computer I've ever used. It's a trade off that you are constantly\nbeing made aware of. The best example of this is the\nhilarious onscreen keyboard, which is not worth using for anything beyond\nentering a wifi password. For any longer than that,\nyou'll want to use dictation or connect a Bluetooth keyboard so you can directly control the input. If you're like me, talk with your hands, you will find things\nscrolling and clicking all over the place. Be warned. (bright upbeat music) The Vision Pro runs visionOS, which Apple told me is based on iPad OS with a lot of customization\naround latency and vision to make it work for spatial computing. Starting with the iPad as a foundation is an incredible headstart for Apple. It's taking years for Meta to build out all the features of the Quest\nOS and populate its App Store, and it's still mostly just games. Apple gets to start with the\nfull set of iPad OS features and most of the huge iPad app library. Although some huge developers\nlike Netflix, Spotify, and YouTube have decided to wait before allowing their apps\nto run on the Vision Pro. By the way, VR videos on YouTube.com don't seem to work either. The really big difference\nbetween visionOS and iPad OS is that iPad OS has a lot of opinions about how you can arrange apps and how many apps you can run at a time, and visionOS is full on\nfree floating window chaos. You can have apps from three\ndifferent operating systems going on at once. Native visionOS apps, iPad apps, and then you can also connect your Mac and have a whole 4K Mac display with the chaotic glory of Mac OS floating around in space as well. I love it, it is bananas, but it can also be a little\noverwhelming to be honest, and there's just not a lot\nof window management tools to help you out. The ones that exist are\nbasically hidden in the UI that no one would ever\ndiscover on their own. For example, there's no\nExpose or Stage Manager. You can't collect all your open windows and put them into preset arrangements, but you can tap and hold\non the X button in an app to hide all your other apps, and you can ask Siri\nto close all your apps. If you need to just take a break, you can double tap on the digital crown and it'll hide everything. It's not nothing, but it\nmeans you'll be thinking about literal window management in space more than any other iOS\ndevice I can think of, and maybe even more than a Mac, which has vastly more\nwindow management tools built into the OS. Speaking of the Mac, I know a lot of you are excited about the idea\nof buying a Vision Pro just to use it as a giant MAC display. I've got good news. I've got bad news. The good news is that\nthe Mac display sharing works really well, and the\nlittle Apple ecosystem tricks like Handoff and Continuity are pure joy. You can copy in your Mac and\npaste in vision OS, just works. You can open your Mac display in visionOS, drag the mouse off the screen, and suddenly your Mac's trackpad is controlling the Vision Pro and the keyboard is entering text. I love it. It was amazing to just\nput a huge virtual display over my MacBook Pro display\nand edit photos in Lightroom like I had a 50-inch MacBook. Although I will say no one\nelse could see what I was doing or look at the photos on my\nscreen, which is a little sad. The bad news is that you only get one single 2560 by 1440\nMac display in visionOS. You can't have multiple Mac\nmonitors floating in space. I know. That's gonna break\na lot of hearts out there. Let's stay strong. One of the weirder things about visionOS, the Vision Pro itself really, is that there's not a lot of AR in there, as in actual interaction between physical objects\nin space and digital ones. I counted exactly three true AR things in my entire time with the Vision Pro. One, when you look at your Mac, the Vision Pro sometimes puts up a Connect display button above\nit and starts screen sharing, and when you're typing\non a Bluetooth keyboard and look down at your hands, it pops up a little text preview window so you can see what you're typing. These are little features, yes, but they are some of the first\ntrue AR computing features that have ever shipped\non a mainstream device, and they also happen to\nbe incredibly useful. The third AR thing I saw was the loading screen\nof \"Super Fruit Ninja,\" which allows you to throw\na strawberry at a pig that's running around on the floor. It seems slightly less\nhistoric. But that's it. There's not a lot of AR in visionOS in the sense of reality being augmented. There's a lot of MR, or mixed reality, where virtual objects\nfloat around in real space, and there are a lot of\nreally great VR features because the Vision Pro is so\nfundamentally a VR headset. Watching movies on this\nthing is so much fun, especially in the immersive theater mode that lets you pick what\nseat you wanna sit in. It's also very cool to watch a movie in one of Apple's virtual\nenvironments, like Mount Hood, and see the colors from the screen reflect onto the landscape. You can get pretty far making the argument that the Vision Pro is worth it simply as a very expensive TV. For many people, it will be the\nbiggest and best TV they own with capabilities no other TV can match. Since the Vision Pro is sending\nseparate images to each eye, it can do true 3D movies, and Apple and its partners, like Disney, have already released quite a few, but you know what I'm gonna say. There are trade-offs. After a while, the\nweight of the Vision Pro reminds you that it's on your face, and it's a very expensive TV that doesn't have an HDMI input, so you're limited to\nApple's game situation, which, you know. And unlike any other TV in your life, the Vision Pro can DRM your eyes. If you're watching a movie in Disney+ and go to take a screen\ncapture, the content blacks out. It is strange to think\nof living in a reality where big companies can block you from capturing what you see. Plus, it goes without saying,\nyou'll be watching TV alone. By the way, it's notable that there aren't any real VR\ngames or fitness apps so far. There's nothing like\n\"Supernatural,\" or \"Red Matter,\" or \"Population One.\" All hit games on the Quest. The Vision Pro just doesn't seem suited to those kinds of physical experiences. You don't really want to\nmove around while wearing it, and that might be a good thing because there are no guardrails\nagainst VR motion sickness anywhere in visionOS. I watched a handful of 3D\nmovies and immersive shows and sort of immediately realized\nI'd gone too far too fast. What's weird is that I know I have issues with certain kind of VR motion from my time and other headsets, but the Vision Pro is so convincing and so unconcerned with\nwhether you might have limits that it's easy to just get\nyourself a little queasy. I recommend early adopters go slowly and make sure you find your limits gently. That first bout of VR\nmotion sickness is no joke. It's possible that the best\nfeature of the Vision Pro is actually taking spatial\nvideos on the iPhone 15 Pro Max and then watching them\nback on the Vision Pro. (gentle music) They play back in a sort\nof ghostly white haze, and the overall effect is\nincredibly bittersweet. You can relive a brief memory, but you're alone in the headset and you can't share it with anyone else. The other problem is that\nyou can currently choose to shoot iPhone video in spatial at 1080p 30 frames per second or at the full 4K resolution\nthe phone supports, but not both. For now, I'm gonna pick\nthe higher res video, but there's gonna come a moment where shooting in spatial by\ndefault will be the smart move and that will be a real turning point. I would not recommend shooting photos with the Vision Pro cameras\nunless you really need to. Pressing the shutter button a single time delivers a 2560 by 2560 still, which works out to about 6.5 megapixels. As far as I can tell, the photos are always\nfrom the left main camera, which the EXIF says has an\n18 millimeter F2.0 lens. The photos look like 6.5 megapixel photos from a tiny camera sensor\noptimized for video, which means they look bad. Video is slightly better. The Vision Pro shoots\n2200 by 2200 square videos at 30 frames per second. They look a little better than the photos, but there's still an awful\nlot of compression going on, and if you happen to watch them on anything but a Vision Pro, you'll notice some barrel distortion as the camera moves around. All of these videos and screen captures come with a ton of excess motion from your head moving\naround, and I will just note, you'll look fundamentally ridiculous trying to take photos of your family with ski goggles on your face. I think it's fair to assume\nmost Vision Pro buyers also own iPhones, which take great videos. Just use your phone, you'll be fine. (upbeat music) So that's the Vision Pro.\nIt is an astounding product. It's the sort of thing\nonly Apple can really do. From the incredible display\nand pass through engineering to the use of the whole ecosystem to make it seamlessly useful,\nto even getting everyone to ignore the whole battery situation. There's a part of me that says\nthe Vision Pro only exists because Apple is so incredibly\ncapable, stocked with talent, and loaded with resources that the company simply\nwent out and engineered the hell out of the hardest\nproblems they could think of in order to find a challenge. That's good, I think. There are a lot of ideas in this thing, and they're all executed with the kind of thoughtful intention that few other companies\ncan ever deliver at all. But I think the shocking thing is that Apple may have inadvertently revealed that some of these ideas are bad, that they can never be\nexecuted well enough to become mainstream. VR headsets with camera\nmixed reality pass through might just be a dead end. Replacing input devices\nwith hand and eye tracking may never be good enough. There is so much technology in this thing that makes it work like\nmagic until it doesn't. Joanna looks like the worst\nPS3 version of herself. I just wanna be honest. (laughs) The other way to look at the Vision Pro is that Apple knows all this and the technology to\nbuild the true AR glasses it has long hinted at is simply not there, so the Vision Pro represents\nsomething like a simulator, a dream factory, for hardware yet to come. You can look at this whole\nthing as a trade off. The hardware it can ship right now to get everyone thinking about these ideas while it pours all those resources into the hardware it wants to build. Maybe. It's fun to think about. But I wanna come back to\nthe idea of trade-offs in this device. The one you can go out and buy right now. One of the oldest rules at \"The Verge\" is that you review what's in the box, not the promise of what's to come. And so I wanna come back\nto all those questions I've been asking myself ever since I first strapped the\nVision Pro onto my head. Starting with the most important one. Do you want a computer\nthat messes up your hair every time you use it? Do you want a computer that\nallows the Walt Disney Company to prevent you from taking\npictures of what you see? Do you want to use a computer where you can't easily show anyone else what you're looking at? Do you want to use a computer that has two and a half\nhours of battery life? Do you think the fanciest TV you own should have HDMI inputs? Do you want to use a computer that doesn't work as well in a dark room? Listen to me. Do you want to use a computer that is always looking at your hands? That's just a lot of trade-offs, big trade-offs, not little ones. And the biggest trade off of all is that using the Vision Pro\nis such a lonely experience. Regardless of the weird eyes on the front and the uncanny Personas, you're in there having\nexperiences all by yourself that no one else can take part in. I think that's fine for\ntraditional VR headsets, which have basically turned\ninto single-use game consoles over the past decade, but it's a lot weirder for\na primary computing device. It's fun to look at this Vision Pro as a glimpse of the kinds of experiences spatial computing might one day provide. There's a wild new kind of future coming if some of these huge\ntrade-offs get resolved. But right now with this Vision Pro, the one you can actually buy, the trade-offs of going in\nthere just aren't worth it. I get my work done with other people, and I'd rather be out here with them. - Almost five. - [Joanna] Five hours. I haven't\ntaken it off in five hours. - Are you (bleep) kidding me? - [Joanna] No. - Are you ever coming out? - Not coming out. - [Nilay] You've been wearing that thing for five hours straight? - Five hours straight. - So you're just plugged into the wall. You haven't moved from your chair. - I've been in two chairs today. - Has someone fed you? - [Joanna] I ate a sandwich\nwith this headset on. - I love you, but I\nworry about you. (laughs)"
    }
}