{
    "hPWk8jLuUWg": {
        "title": "10 Breakthrough Technologies of 2024 | SXSW 2024",
        "thumbnail": "https://i.ytimg.com/vi/hPWk8jLuUWg/hqdefault.jpg",
        "author": "SXSW",
        "date_of_release": "2024-03-28T16:00:27Z",
        "duration": "PT55M34S",
        "view_count": "111770",
        "like_count": "2109",
        "comment_count": "262",
        "description": "Portuguese and Spanish language translations for SXSW 2024 Keynotes and Featured Sessions presented by Itaú\n\nEach year, MIT Technology Review reporters and editors assemble a list of the top breakthrough technologies that will change the world. This list is one of our most popular packages of the year. Elizabeth Bramson-Boudreau, the Publisher and CEO of MIT Technolgy Review will share the publication’s list of ten breakthrough technologies with the SXSW audience, explaining each one and how it will impact the way we live and work.\n\nAbout SXSW:\nSXSW dedicates itself to helping creative people achieve their goals. Founded in 1987 in Austin, Texas, SXSW is best known for its conference and festivals that celebrate the convergence of the interactive, film, and music industries. An essential destination for global professionals, SXSW features sessions, showcases, screenings, exhibitions, professional development and a variety of networking opportunities. For more information, please visit sxsw.com.\n\nSubscribe: http://www.youtube.com/user/sxsw?sub_...\n\nConnect with SXSW:\nWebsite: https://www.sxsw.com\nFacebook: https://www.facebook.com/SXSWFestival/\nTwitter: https://twitter.com/sxsw\nInstagram: https://www.instagram.com/sxsw/\nYouTube: https://www.youtube.com/sxsw",
        "transcript": "(audience applauding) - Hi. Hello, everyone. It is absolutely wonderful to be here with all of you at South by Southwest. It's great to be in this crowd. It's always great to be in\nthis crowd. The room's full. It looks amazing. I've got a lot to go through today. I wanna take you through 10 technologies that our team of reporters thinks are going to change the\nway we live and work over the next several years. And I also wanna talk to\nyou a little bit about what all of these technologies might mean for the way we live and work. So, I expect many of\nyou, if not most of you, are familiar with \"MIT Technology Review.\" So we are a media company owned by MIT. We publish journalism\nfor current and future tech leaders like yourselves. If you don't know us already, the name may make you\nthink academic journal. We are not an academic journal, rather, we're journalists\nthat we tell the stories about how technologies\nare being created and used and how those technologies\nwill impact all of our lives. We are inspired by our\nrelationship to MIT, the world's leading\nuniversity for engineering, physical sciences, computer\nscience, mathematics, and a bunch of other\nsubject areas besides. MIT alumni and faculty include 101 Noble laureates at last count. But every year that number increases. 26 touring award winners and more astronauts than any university other than the Naval Academy. MIT's influence, I don't have\nmy, my slides are not up, but MIT's influence in\nthe business community may be even more noteworthy. As of 2015, so in 2015,\npeople at MIT did a study and they took a look at the companies that had been founded by alumni. What they found is that of the people who had graduated from MIT, more than 30,000 companies\nhad been started by alumni. Those 30,000 companies\ngenerated collective revenue, if you add all 30,000 together, collective revenue of $2 trillion. At that point in time when\nthey did this in 2015, so about nine years ago, that $2 trillion meant more higher, it was higher than the GDP of the 10th largest economy in the world. At that point, it was right\nin between India and Russia. So we're talking about\na lot of economic might that comes through the institute. So MIT's known for all of this of course. So you probably knew much of that already. And it's also known for a hacker culture, a kind of playfulness, a\ncreativity which really comes through in unique ways\nin approaching problems and solving problems. And putting this together\nwith that interdisciplinary and trying to figure out could we hack something together here\nthat will be a cool solution to a problem. So out of this incredible institution comes this journalistic enterprise:\n\"MIT Technology Review.\" You can think of us like\n\"Harvard Business Review.\" Harvard Business Review comes out of Harvard Business School, very similar to the way we're organized or like the \"Smithsonian Magazine\", which is, you know, a\npart of the Smithsonian or sort of comes out of the Smithsonian. It also happens that this year, 2024, is the 125th year\nof \"MIT Tech Review.\" And so you can see sort\nof the very first copy, it's kind of an old\ncopy from our archives. We have the archives. And in its very first days, the purpose, you know, when it was set up, the purpose was always to\nexplain to the broader public what they called the always new and ever more complex problems\nthat we face as a society to share the stories of\nwhat humans can accomplish with the right amount of know-how, creativity, and commitment. That very first issue, again, as I say, we have, you know, all the\nissues in our archives. The very first article is about the function of a laboratory. You can imagine the kinds of innovations and the kinds of advancements\nwe've seen over the 125 years we've been doing what we do. But we've moved on as you\nwould hope and expect. And today we are a\nmulti-platform, media company. We publish in digital every day. We have a very nice app that we've just relaunched quite recently. We have a whole bunch of newsletters that are specific on particular\ntopics that we send out, you know, all the time to\nhundreds of thousands of people to get into their emails. We have a print magazine,\nwe have podcasts, and we have a really nice events series. We are aimed at anyone who wants to, is interested in the future of our world and how technology is shaping it. But who probably aren't\nexperts themselves. Probably, you know, you\ndon't have to be an MIT alum. I'm not an MIT alum. You don't have to be an\nengineer or a scientist. An awful lot of people who\nread us are not engineers and scientists and never\nhave ever thought about MIT as a place that they would even set foot. Rather what kind of\nbrings everyone together is the primary focus\nacross all the platforms is on kind of answering the question what is technology doing for people? And this zeitgeist moment\nthat we're in here, when all we've been talking about really in the business\npress for the last year or so has been artificial intelligence. We've also got technological\ndevelopment in robotics and biogenetics and\nengineering the human body, quantum computing, et\ncetera, et cetera, et cetera. We are providing rigor and insight to a very number of people who are using these technologies, who are making them or\ncreating them or who, you know, would like to\ntake the right decisions about how to implement or\nregulate those technologies in their own lives and world. So, all of us here, I expect believe, and you know, think that\nthe work we do matters. I hope we're all doing work\nthat we believe matters. I hope you'll tolerate\na slight indulgence. I wanna talk for a moment and then I'm gonna get into\nthe meat of the matter. I do wanna talk for just a moment about this time in media\nand journalism 2024. Now, I am aware that most of you are not paying much attention to the headlines around the collapse of the journalism and the media industry. We're talking about really\nkind of daily stories about are we heading\nfor an extinction level event for journalism? I don't know if you know\nthat \"National Geographic\", \"National Geographic\",\nwhich I read as a, you know, seven or eight year old,\nor I didn't read it, but I looked at the photos\nas seven or eight year old. You know, when it came,\nfirst time I saw photographs of the moon, first time I saw, you know, so many different parts\nof the planet photographs. That magazine is\nundergoing a slow shutdown. It more or less doesn't exist. They laid off all of their\nstaff six months ago. \"Popular Science\" announced in February, or excuse me, November, that it's also not gonna publish anymore. They've been around for 151 years, no longer gonna be publishing. If you add to this,\n\"Wired\", they laid off 20% of their editorial team\na couple of months ago, and that included every one\nof their science reporters. There's nobody any longer who's publishing at \"Wired\" about science. CNN did the same thing about a year ago in their tech reporters. So why is this happening? I'm not gonna bore you with it, but it goes back to the\nemergence of the internet. Everything went online,\neverything was free because remember we were\npaying with our eyeballs. That worked okay for a little while, but then digital\nadvertising got swallowed up by large platform companies\nlike Facebook and like Instagram and Google Ads and so forth. So there's simply not enough\ndigital advertising dollars to fund all the journalism that we have all become accustomed to. So people in my job have\nto ask people like you to pay for content. So that's why you're running into paywalls all over the internet. But because without people\nwilling to pay for content, as the expression goes, if\nyou don't have people willing to pay for content, well,\nwe can't have nice things. This is leading to closures of\nindependent media companies. We are in a very unique position because of our relationship to MIT but we don't get everything from them. We do need to continue to\nengage with our audience and convince our readers\nto pay for content. It's incredibly difficult\nto make a solid business out of reporting and telling stories about what's happening in the tech world, in the science world. And it's really hurt the\namount of information that most of us, that's\nreally hurt our industry because the amount of information that we have out there is diminishing. So it's perhaps no surprise that Pew Research Center, this came out sort of in the fall, about four or five months ago. This study says that today,\nfewer Americans than ever believe that science has had a mostly positive impact on society. I mean it's really, I'm\ngonna it say it again 'cause it's shocking. Fewer today as we stand here with COVID shots in our bodies and assembled together again,\nwe flew here on airplanes, we've got devices in\nour pocket, et cetera, fewer Americans than ever believe that science has had a mostly positive impact on society. To me, this is, you know, a giant flashing red light, sort of the reddest of red flags. It is critically important obviously, that we have an informed, educated society if we're gonna grapple with the major challenges\nthat are facing us. And of course, I'm talking about\nthings like climate change. I'm talking about artificial intelligence. I'm talking about making\nthe right decisions about how these systems are gonna work and control the world that we live in. Because we do have big problems. We do have to face these\nproblems as as a collective, as a society and think\nabout what the truth is. So I know you didn't come here for this, I still even so feel I need to ask you, invite you to support smart, objective and trusted journalism. This is a QR code. You might want us to be the folk, the publisher that you support. I would love that, but if\nit's not us, I don't care. Support someone, support journalism in your local newspaper, whoever. I would love it if you subscribe\nto \"MIT Technology Review.\" We have a nice offer, you'll\nget a little tote bag, that's all great. But again, if it's not\nus, let it be someone. (audience applauding) Thank you. I forget who it was who\nsaid, \"Don't clap, vote.\" I'm gonna just say,\n\"Don't clap, subscribe.\" (audience laughing) So it's time for our list now,\nand that's what you came for. And I have 10 items to go through. So because it's the 10\nbreakthrough technologies, I'm not gonna spend the same\namount of time on each of them but if you want to dig in and get more, definitely go to our site, dig in. There's quite lot here. It's listed under the 10\nBreakthrough Technologies. So you can go really deep dive down those down into these stories. So what is this list? Well, since 2001, we have been creating a list of the 10 new technologies or innovations that we believe will be game changers and that have staying power. All of these technologies are at today a critical breakthrough moment. And either that moment has just occurred, or it's coming very, very soon. This process of selecting the 10, which we do every year\ncomes out in the, you know, very beginning or sort of\nthe first couple of months of the New Years. But we start in the summer. So about six to eight\nmonths ahead of time, the tech reporters and\nthe editors get together and they start throwing ideas around and they start brainstorming. These ideas come from the\nconversations that they've had during their reporting\nwhen reading through and reviewing research\nand otherwise exploring their particular coverage areas 'cause all of our reporters have sort of really sub focus areas. That team considers\ndozens of different ideas across every area of\ntechnology that we cover. They debate, they take a straw vote, they come up with a preliminary list, and then they let it sit, kind of ferment for a couple of weeks\nuntil our editor in chief goes back with some of the sort the luxury of a little bit more time\nto make a final decision. Now, not every one of these breakthroughs is a positive development. We're not making a judgment\nabout the positivity or the negativity of a development. What we're doing is we\nare talking about the fact that they are at an important\nmoment in development and are about to get very,\nvery big and very significant. So last year, for example, I was here, I shared the list and one\nof the items on the list was the fact, it was about\ndrones used in warfare. And the reason we put that on the list was that prices for\nsmall but powerful drones had fallen to such a point that it was clear we were\ngonna start seeing them used in warfare because, you know, you could get a decent drone\nthat could have weapons on it for, you know, under $500. So it was clear that\nthat was going to start to become a big technology for war. And in fact we had already started to see it in Ukraine, Russia. So again, we're not endorsing necessarily these technologies, we're\nsimply wanting to point out that it's powerful and at an\nimportant moment in development and really important to pay attention to. So here's some covers of the magazine. As I say, we've been doing since 2001. You know, obviously most of\nwhat we do is in digital form, but we do put together a print magazine that has the list as\nsort of a key component of it once a year. And I thought I'd just flag\nup, I kind of went back sort of five years ago and\nearlier and pulled a few covers and I thought I'd just share\nsome of the technologies that got highlighted over these years. It's not, obviously I don't\nhave time to go through all of them, but in 2001 we had brain machine\ninterfaces on the list, which is something that, you know, is coming up more with\nNeuralink, for example. But quite interestingly, that was the first time, 2001, when we put natural language processing on the list of breakthrough technologies. And of course, natural language processing is what drives large language models that underpin or that are used in ChatGPT. So that was, you know, 20 something years before we came to ChatGPT. 2007 was mobile AR or augmented reality. 2009 Smart Assistance. At that point, Siri was,\neverybody's phones just woke up, but at that point, Siri was, you know, was sort of rolling out. So again, was getting bigger. 2012 was crowdfunding. So crowdfunding had been out for a while, but it was at 2012 when\nsome platforms were launched that would enable crowdfunding at scale. So at that point we said\nit's a breakthrough. 2013, smart watches. It's hard to believe\nthat 2013 was, you know, we weren't all wearing\nsmart watches before then, but it really wasn't until after that that we all started to get, everyone started to have a smartwatch. Deep learning in 2013. Additive manufacturing at scale. 2014 was a particularly exciting year because that was the first\nyear that we put CRISPR on the list and we called that the biggest biotech\ndiscovery of the century. And we had a lot of really\nwonderful exclusives that we published on CRISPR\nboth in that time period and in the decade since. 2016 was reusable rockets. We started talking about\nrockets being able to take off and then, you know, bring them\nback without sort of having to, you know, being able to reuse rockets and not, you know, lowering\nthe cost of rocket launches. 2018 generative adversarial networks. GANs, again, you know,\nwe've been looking at these elements of AI for a long time. And of course AI was\nborn, was developed at MIT so it's probably unsurprising\nthat we've been on top of it for as long as we have. And in 2019, bill Gates came to us and said he wanted to pick the list. So we said, \"Okay.\" You know, that's a nice invitation. So he came to us and said\nhe wanted to pick the list. We decided that seemed like a fine idea, and he chose two of the things that I'll mention was carbon\ndioxide capture technologies and also meatless burgers. So it brings us to today, you know, this is sort of\nthe, this is the aesthetic that we've got on our site\naround the list in 2024. And, you know, I wanna just\nbe clear that I am here as the voice of many, many people who are far more expert in\nthese technologies than I am. And that's my colleagues\nat \"MIT Technology Review\", who spend their days uncovering brilliant, sometimes weird, sometimes disturbing or challenging stories about technology. So I'm very much here as a person representing all the very, very deep detailed knowledge. So I'm gonna take you\nthrough sort of a more, we'll call it maybe a little\nmore accessible approach to some of these technologies. There's a lot more, as\nyou dig into the reporting and the content that we publish. I'm just about to get into the first item and I wanna say that to the crew here, my timer is not counting down. So someone should tell me\nhow much time I've got. I suspect saying that\nsomeone will maybe come out with a counter or something. Okay. Item one is AI for everything. So it's no surprise to see AI on the list. And I note that our very\nfirst list, as I said, released in 2001, included\nnatural language processing, the technology that underpins\nlarge language models that drive generative\nAI tools like ChatGPT. And last year when I was here, we talked about this,\ngenerative AI, of course, was also on the list. But 2023 was a wild year for AI. A lot happened. This first item is our\nattempt to sum it all up. We're now in a time when\nthe public is interacting with AI directly and consciously\nplaying around with it. I'm sure almost all of\nyou have used ChatGPT. Maybe you've made, you've\nwritten some code or I drafted, I used it to draft a condolence note 'cause I wasn't quite\nsure how to phrase it. So I got really specific\nabout the situation. You know, people are using\ngenerative AI to make images. There's obviously loads of\nadvances coming out all the time. Many generative AI tools are\nnow out that are, you know, incorporated in search and chat bots, email services and so\non and so on and so on. So there is a lot to say about AI, and of course, there are\nsessions all week I'm sure. I've gotten invited to several myself entirely focused on generative AI. So trying to kind of\nfigure out what to say here that would be perhaps different, I decided to ask some\nquestions, raise some questions and share some predictions\nin some of our thoughts. So the first thing is about bias. So we know that there is a\nbias problem in these tools and that's because the\nmodels are trained on data that comes from the web. That's images and texts that\ninclude gender stereotypes, for example, or racial discrimination. And because they're trained\non sort of the real world, they can encode those biases\nand reinforce them when used. So how will the bias problem be resolved and whom will it hurt\nbefore it gets resolved? That's the question. We predict that there will\ncontinue to be workarounds developed as awareness continues to rise around the problem of bias. And I think awareness is, I think people are pretty\naware that is a problem, but it's not gonna be\nsolved quickly or easily. So the bias problem, again, we expect there will be workarounds and there will be some improvements, but it's going to take a lot more than the progress that we've made. There's gonna be a lot more work before were talking about solving that. So, topic number two is copyright law. So as these models are being\ntrained on data and content and creative work, expect\nto see a lot more lawsuits. We've got celebrities like Sarah Silverman or the writer George R. Martin. We've got in the journalism industry \"The New York Times\" has sued OpenAI for its use of the content published by \"The New York Times\"\nto train the model. You can also expect to see some technology kind of solutions. Like there's a technology\nsolution called Nightshade that alters images in a way\nthat mucks up the algorithm. So there's a way to alter the images before they're published\nso that when that image is sort of absorbed into the model, it messes up the algorithm. So a little bit of\nprevention of that content, of that copyrighted content getting used. But it's gonna continue to\nbe a game of Whac-A-Mole. And I'm personally watching\nvery closely what happens with \"The New York Times\"\nlawsuit against OpenAI. In our sector, there's, you know, various, there's various industry groups that are working through, you know, policy protections and legal cases. But again, it's gonna continue\nto be a game of Whac-A-Mole. Big question as well. Number three is about jobs. Will they be lost? How many jobs are going to be lost or will they just be different? Generally speaking, what we hear today is that researchers largely think that jobs will change in their scope, but not necessarily in their numbers. So people will need to go\nthrough some retraining and rather than expecting\nto be out of work. So the way that, you\nknow, some of the research that has been done is\nit makes, for example, it makes researchers\nin a particular topics much more efficient,\nbut it doesn't take away the need for the human researchers. And there's obviously gonna\nbe a lot more work done to kind of figure that out since there's so much concern and there would need to be some action to retrain people, you know, if necessary. So topic number four is\nabout misinformation. So misinformation is going to remain a very, very big problem. It's probably going to get a lot worse before it gets better. And think about the\nelections that are coming up. Obviously the election in the\nUnited States for president, but there's elections taking place, awful lot of elections taking place all around the world in 2024. If you take a look at these\nimages, I don't know how many of you remember the dope\nPope, that was my favorite. (audience laughing) Then there was Donald Trump under arrest, then there was the\nexplosion at the Pentagon. Now all of those are fake,\nthose are all fake images. They were shared and viewed\nby millions of people. Policing these sorts of images, like if you think about the\nsexually explicit Taylor Swift fake video that went around, went viral a few weeks ago, policing those sorts of fakes\nis incredibly difficult. So there was an executive order signed on artificial intelligence in October that focus on the importance\nof labeling AI created content, but it did not legally require it. The EU has an AI act,\nit goes a little further for requiring that, but ultimately\nit's extremely difficult to ban deep fakes because so many of them come from open source systems or systems that are built by state actors and so are out of the reach of control and can be impossible to trace. So it's going to be a very messy 2024 in terms of misinformation\naround the elections, I think especially. And it's really important as, you know, as as consumers of media that we're taking into consideration what we're getting and\nthe fact that an awful lot of what we see may not be real. Another topic, sort of another subject, subject number five when\nit comes to generative AI is it is extremely costly and a lot, there isn't a broad understanding of how costly generative AI is, by which I mean environmental costs. It requires an awful lot of energy. The data centers require\nan awful lot of energy. And it's also costly on humans. And the reason for that is specifically the low paid workers,\noften in poor economies who are doing data labeling. And this is a really kind of an unseen part of the AI economy. They may be labeling thousands\nupon thousands of images of sexual explicit\ncontent, violent content, abuse of children. I mean, I'm talking people\nwho are spending every day going through hundreds and\nthousands of photographs in order to label them, we\nwant them to be labeled, but without a lot of\nunderstanding of the kind of the wear and tear it can\nhave on human beings psyche to confront that kind of imagery on a hour in and hour out basis. Tech companies have already\ncome under pressure. There's been some some journalism that has exposed the\nuse of low paid workers by OpenAI, for example. But there's an awful lot going on that is not well understood. There is going to continue to\nbe pressure on tech companies to address these costs,\nboth the human costs and the environmental\ncosts as awareness rises, but we don't ultimately expect there to be major improvements. And then the final thing is, you know, when it comes to this topic,\npeople are fond of asking, you know, well, what\nabout the existential, you know, societal human risk of AI? What's it gonna mean for the\ncontinuation of human beings? And our team's view is\nthat those, you know, and there's a battle or sort\nof there'll be arguments between high profile AI leader over here and high profile AI leader over there. And they'll yell at each\nother across the stage, maybe at a place like this or they'll shout at\neach other over Twitter and, you know, it becomes\na little bit of a kind of a muscle flexing of\nthese sort of tech bros. Which our view is ultimately distracting because these sorts of\nexistential questions are not imminent, not even close. But the other things\nthat I just talked about, the human costs, the\nenvironmental costs, the bias, the misinformation, those\nactually are happening today. And there's a whole lot of like, look over here, distraction that, you know, our position is keeping some of these tech leaders\nfrom really addressing much more solvable problems. So finally it's really\nimportant to ask like, what is even all this AI for? Like what's the use of generative AI? Like ultimately is there a killer app? Well, we don't really think\nthere is a killer app yet. It's fun to play with it. It's fun to, you know, see what it can do when I put in, do a cartoon of, you know, of a monkey riding a train and you know, with a top hat on. But it's unclear exactly\nwhat the needs are for some of these tools. People do like playing with it. But we have also done some research and surveyed tech executives. A thousand tech executives. we surveyed a couple of months ago and asked about how they\nwere using generative AI in their businesses. We wanted to know, you know, we knew that they all\nsaid, \"Look, we get it, it's transformative, but\nwe're not so confident when it comes to actually deploying it.\" Only 9% of those 1000 people surveyed, which you have to also realize\nif they're known to us, they're probably more tech interested than your average tech leader, or excuse me, business executive. So 9% of those 1000 executives we surveyed had a working use case with generative AI,\ninvolving generative AI. Only 9%. And you know, if you look at it by sector, government sector was the\nlowest, which is unsurprising. 2% had a working use case. 17% for for finance and 28% for IT. And they all said they got a lot of\nconcerns around the risks. 59% said we're really worried\nabout some of these risks largely around bias and the concerns about what the bias could introduce into their businesses. And they all felt that they needed to better understand these risks before they went, you know, wholeheartedly into rolling it out into their companies. So there's an awful lot that's\ngonna need to be worked out. But with AI for everything, you know, ultimately these problems are\ngonna be everyone's problems. So AI for everything, number one. Number two, changing subjects entirely. these are super-efficient solar cells. So this is our term for solar panels that add a layer of perovskites, which I don't know if\nthat's how you say it, but that's how it's spelled. These are tiny crystals that\nabsorb different wavelengths of light than traditional, more wavelengths of light than\ntraditional silicon cells. So solar cells that are\nmade with perovskites can be quite a bit more\nefficient at converting energy from the sun into electricity. So there's an image of\nthat, the tiny crystal cell. One of the leading companies in this space is called Oxford PV, and they are shipping\npanels later this year. We're talking about a 50%\nincrease in efficiency. There's been a lot of other movement too. A lot of major solar\nmanufacturers are adopting or investing in this technology\nand making acquisitions. We think this is going\nto be very important in the development of solar energy. You've obviously all heard of this one. This is Apple's new mixed reality\nheadset, Apple Vision Pro. Apple Vision Pro overlays digital content into a real world scene. That might be your living\nroom, it might be your office. You know, we have talked about\nface computers a long time, you know, Google Glass\nand Microsoft HoloLens or Meta's Quest, those\nare all face computers that fail for a number\nof different reasons. So what is different now? Well, there's one big\ndifference, and this is Apple. Apple knows a thing or\ntwo about consumer tech. I imagine there's nearly as\nmany iPhones in this room as there are people. But more salient is the tech behind it. So the headsets use a\ntwin micro-OLED display, which has the highest resolution of any headset ever on the market. I had to put the photograph of Tim Cook 'cause it's really goofy looking. (audience laughing) And you know, he was like,\n\"Yeah, Vanity Fair cover\" and he's got that on his face. Anyway. (chuckles) But mockery aside, our editor in chief who has been around a long\ntime and looking at tech, he's called this the most fully immersive experience he's ever seen. I don't know if you all have tried it. You know, it's too expensive\ntoday, it's $3,500, it's not accessible to most\npeople, but the price will drop and when it does, we expect\nthis to be transformational. Next. I am sure, ooh, the\nbuzz in the room. Nice. (audience laughing) So you've all heard of this one. I saw a story on \"The Today\nShow\" as I was, you know, getting ready to leave\nmy hotel room about this and the story is this, in\nthe lead up to the Oscars, Nova Nordisk, who is the manufacturer behind two of these drugs, is running an ad urging\npeople not to use them to fit into their Oscar\ndresses or tuxedos. That it's for, you know,\nfor health reasons. And it's about, you\nknow, treating obesity. It's a very odd premise for the ad. So they came into public\nconsciousness recently. These drugs, the two from Novo Nordisk, or kind of the leading drugs\nare Ozempic and Wegovy, and they have an active\ningredient called semaglutide that works by suppressing appetite through mimicking a hormone that the intestine releases after we eat. And so it causes the patient to feel full. They were originally developed\nfor diabetes treatments and have been shown to\nhelp anyone taking them lose an awful lot of weight. So 15, 20% and higher. Today, oops, I'm going back. Today, nearly 2% of the US population has been prescribed one of these drugs. So I did the math, that's\nlike six million people, six million people has been\nprescribed one of these. And that's only 2% of the population. You can imagine, when you think about the percentage of our population\nthat suffers from obesity. We could be talking a 10,\nmaybe 15 times increase in the number of people\nwho are taking these drugs. There are today 70 new\ntreatments in development and six are waiting,\nanother six are waiting for regulatory approval. There's also action being taken to move from the injection to pills. I mean we're talking\nabout a major sea change that is going to have a huge difference, make a huge difference\nfor both individual health and public health. And that is especially\ntrue when you think about the evidence coming out to show that not only do they enable\npeople to reduce their weight, but they may even protect\nagainst heart failure, strokes and heart attacks. So big, big change in the public health, a very exciting development\nfor a population like ours that suffers from weight\nand weight related sickness. So next is enhanced geothermal systems. So geothermal is the heat\nenergy that's in the earth. It is a really good stable\nsource of renewable energy, but it's only been practical\nto extract it from places with certain kinds of geological features and where the heat is\nrelatively close to the surface. So it's not, you know,\nit hasn't been accessible as a real solution for many,\nmany parts of the world. But now using fracking technologies or techniques that have been developed by oil and gas industry, and we all know about fracking, it's been around for at\nleast 10 years or so. Geothermal companies can\nnow crack open rocks, inject water at much deeper\ndepths, the steam that comes out because we're talking about\nthe heat that's down there, the steam drives turbines\nand produces electricity that can be used in, you know, and this can be used in\nlots and lots of places. There is a company called Fervo. Fervo, we listed it on our 2023 Climate Tech Companies to Watch, which we launched in the fall. We will be publishing every year. This company Fervo launched a commercial pilot plant\nlast year in Nevada and had been raising\nquite a lot of funding as recently as a week or so ago I saw that they had another\n250 million in funding that they're using all\nof this additional money to build another facility in Utah. So there's never, you know, it feels like there's never\na problem free solution. In this particular technology, in the case of this particular technology, these fracking techniques may\nresult in seismic activity. You may have heard this. There has been a geothermal\nfracked facility in Korea and there's concern, or\nthere appears to be research to suggest that this approach was behind a pretty big earthquake that occurred in South Korea in Pohang, which is a city near Seoul. Okay. Chiplets. So you're probably\nfamiliar with Moore's Law. Moore's Law says basically every two years the number of transistors\non a chip doubles. And that's been going on for decades. And engineers have been figuring out ways of making transistors smaller\nand smaller and smaller. And that explains why\nwe could have a computer in our pockets today when, you know, decades ago that would've\nbeen absolutely laughable. But it's getting much harder to do that. You know, the end of Moore's\nLaw, people talk about. So chiplets are smaller,\nmore specialized versions of conventional computer chips. They can be linked together\nin a number of different ways to build a system that performs similarly. So they're kind of modular. But they need, so that's great, sounds good, but they\nneed a packaging standard. This is very wonky stuff\nthat I'm telling you, but bear with me. They need a packaging standard to put all these modules\ntogether and connect them. And it just so happens\nthat the chip industry has recently made advances towards just that sort of standard and it is called the Universal\nChiplet Interconnect Express, which just rolls off the tongue. And that makes it possible\nto combine chiplets from a bunch of different manufacturers, which gives these chip makers more freedom to specialize in drive efficiencies and reduce costs and so on and so forth. All of this is expected\nto greatly boost adoption and support overall faster development and innovation, especially\nin fields like AI, auto manufacturing and aerospace. So this is a, you know, net\npositive for tech development. Okay, next I get to\ntalk about CRISPR again. I'm very excited. This is the first ever\ngene-editing treatment. It's built on, it's based\non this CRISPR technology. This is a drug that is\nactually available today, and it was approved in December by the FDA and also like a month earlier\nin the UK, they approved it. It treats sickle cell disease. So sickle cell disease, you\nprobably know, is caused by inheriting two bad copies of the genes that make hemoglobin in our blood. Symptoms of sickle cell disease include bouts of extreme intense pain. Life expectancy for a person with sickle cell is 53 years old. It affects one in 4,000\npeople in the United States. Nearly all of them are African American. There is a new drug that was developed by a company called Vertex that works by editing\nthe DNA of the patient and it turns on the production\nof healthy hemoglobin. It turns on the production. It's complicated, it's very cool. But it turn, after we're\nborn, there's a gene that stops producing hemoglobin. It kind of just lays dormant. This drug will turn those\ngenes back on if you take it. So it enables these folks to begin producing\nhealthy hemoglobin again. Patients who went through trials were pain-free after treatment. And we published an op-ed, which is, I think there's\nan image of the page. We published an op-ed\nby a patient named Jimmy who was in the clinical trial. He wrote us a story talking\nabout his experience in the trial and the treatment. He was one of the first people to get it. He calls it life changing. So it's really exciting. I mean, sickle cell is a nasty disease. It is incredibly costly\nto provide this treatment. It's about 2 to $3 million per treatment. We are obviously hoping that, you know, those costs come down. We are obviously hoping\nthat Vertex can perhaps deploy some of these treatments and these drugs in populations in Africa where it is extremely widespread and there are a lot of young\nkids who suffer from this. But despite all those, you\nknow, sort of less positives around the cost and kind of the ability for that to scale out, it is an incredibly exciting development, incredibly exciting, because\nit's only been 11 years since CRISPR was developed. And I showed you that we\ntalked about CRISPR in 2013. It's only been 11 years\nand now here we are, it's no longer just in the labs, it's actually in treatments. This will be the first of many\ntreatments that are using, for lots of different health conditions that are using CRISPR. Exascale computers. These are very, very, you\ncan tell from the name, these are very, very powerful computers that are coming online. They perform more than an\nexaflops worth of calculations. A what? An exaflop. That's one followed by 18 zeros. That is as powerful as\n100,000 laptops combined. So I thought about that and that's like, it's larger than, you\nknow, the stadium full. I imagine a stadium, you\nknow, a football stadium full of fans, about 70,000. It's more than that, right? All of these laptops doing the same thing. The first one was called Frontier, it was built here in the United States. Europe is getting its\nfirst one later this year. They're calling it Jupiter. There are two more coming in the US, one's called El Capitan and\nthe other's called Aurora. And I love the names that they're\nso confident, these names. We believe there may be a few in China, but it's kind of hard to get reliable information about that. The team at the Oak Ridge\nNational Lab in Tennessee that is behind the Frontier computer, they're saying that they've got one coming that's three to five times\nmore powerful than Frontier. So, you know, it's just\ngoing up and up from there. These machines can perform\nexcellent simulations of the climate, of the universe. I mean really, really\ncomplex calculations. Things like turbulence.\nThere is a big challenge. Does anyone know what the\nchallenge is? Can you guess? Yes, it's energy. They are energy hogs. Frontier's power when\nidling, so it's just idling, it's the same amount of power that we would use to\npower thousands of homes. We're talking about\nthat's when it's idling. It's not even doing calculations. So we're talking about, you know, a need not just to build out\nthe speed of these computers, but to think about their\nenvironmental sustainability. Heat pumps. I'm waiting for the excitement. (laughing) No, not as exciting. Yeah, heat pumps are not that exciting. But this is an older technology. It's been around for decades. I wasn't even quite sure, I live in, you know, greater Boston. I wasn't really sure even\nwhat a heat pump was. So it's a replacement for a furnace and it is an appliance\nthat both heats and cools. It uses electricity. They're much more efficient\nthan gas furnaces. They're not gonna work\nfor me in suburban Boston. They will work in milder climates. Last year though, for the first time, sales of heat pumps in\nthis country, in the US, outpaced gas furnaces. And in Europe last year, heat pump sales grew\nby 40% year over year. And that was driven by\nthe energy crisis coming because of the war in Russia Ukraine war. So a lot of people were\nworried about energy costs and went to purchase heat pumps. So there will be steps\nforward to increase production and very importantly, to make sure that the electrical grids are ready to, as more and more people\nswitch to heat pumps or you know, new purchases, you know, people sort of sunset\ntheir existing furnaces, that the electrical grid can handle that kind of energy demand\nand that transition. So last item on my list are Twitter killers. So this is-\n(audience laughing) I know, right? We're all hoping for them. So. (laughing)\n(audience laughing) So Twitter killers, this is our name for all the new social media\noptions that have popped up as Twitter or X has lost\nits users, its advertisers. So in case you have been living in a cave, Elon Musk purchased Twitter. He renamed it X, fired\nmost of its employees, more or less did away with verification and moderation systems. And that led to quite a lot of people to become disenchanted with it. There has been interest in new platforms, especially ones not\nowned by a single person. Options that use decentralized protocols like Mastodon and Bluesky. Those have gained popularity because of the advantage\nof them not being owned as sort of the counter sort of the revolutionary\nelement to those. They allow for communication across independently\nhosted servers or platforms and they enable more individual control over your connections and\nmoderation and things like that. It is interesting though that thus far, I mean, none of those\ndecentralized options has really exploded. Rather thus far it's been Threads, which is of course a Meta company, of course owned by Mark Zuckerberg. That has been the most popular, Threads has very quickly\ngot its monthly users to about 100 million per monthish. And our editor in chief said that ultimately the real\nTwitter killer is Elon Musk. (audience laughing) So that's it, that is the list of 10. (audience applauding and cheering) I'm not done. There's more, there's more. We are soliciting input from you and from our audience of\nreaders for the selection of our 11th technology. So what you do if you're so inclined is you scan this QR code and you vote. And here are the options. The first one is robotaxis. So those are autonomous cars\nthat come when you call them. Thermal batteries is number two. These are systems that\nstore clean energy as heat. Number three is lab-grown meat. And I talked about meatless\nburgers back with Bill Gates. This would be chicken made\nfrom cultivated cells, which is available in restaurants. Is this going to be the\nnext great breakthrough? And then lastly, SpaceX's Starship. Again, reusable rockets that\nlower the cost of launches are increasingly widely used. So scan this QR code, vote. We'd love to know what you think. We're gonna stop taking\nvotes on April 14th. And then we are going to write up a nice article about whichever one wins and, you know, tell the story\nof why it's so important in our daily newsletter, which\ngoes out to your email box, it's called The Download and\nthat will be on April 15th. So I often, I'm not done, I'm gonna stay for a couple more minutes. We often get asked what\ndidn't make the list and why, what did you not put on the list? What was borderline? And I think this is\nactually pretty interesting 'cause it reveals a lot, not only about what's\ncoming around the corner, but also kind of what\nexplains what is on the list. And so I thought I would share.\nSo there's a couple of the, I'm gonna go through I think four or five. So there is new drugs\nfor Alzheimer's disease. And I don't know how many\nof you all have seen this. This has been in the popular press. But these drugs are meant\nto slow cognitive decline from the buildup of plaque. FDA approval has happened has come through for one drug and there's\nanother one coming. The reason we didn't put it on the list is that there are severe side effects. We're talking brain bleeding and swelling. And it also appears to be very difficult to administer these drugs. So we are excited about the\nprogress that's being made, but we don't think we're\nready to put it on our list. Another one is sustainable aviation fluid. This is, excuse me,\nsustainable aviation fuel. This is using cooking oil, animal fats, and other agricultural waste and using that to power airplanes. There have been successful test flights, it's really very cool, but they're not quite there\nyet in the production. But keep an eye on that because there's every reason to think that they will continue\nto make advancements. So another one is solar geoengineering. And this is like wild. So solar geoengineering\nis releasing particles into the stratosphere that\nreflect the sun's energy and therefore cool the planet. It's like a, think of\nit like a big mirror, like with the sun's beams being, you know, reflected back instead of\ncoming onto the planet. It's very controversial, but\nthere are a few researchers and companies that have\nbeen exploring this and doing pilot tests. There was some small\nscale tests in Mexico. We did a great big expose on these tests and then Mexico banned the tests. We weren't necessarily advocating\nthe banning of the tests, we were reporting about\nwhat was taking place. It's really not clear\nwhere all this is going, but so for that reason, we\ndidn't put it on the list. But it is another thing\nto keep a watch on. Another one is male-male reproduction. So there has been success in creating healthy mouse pups, who knew that a baby\nmouse is called a pup. Healthy mouse pups were\ncreated about a year ago, taking cells from two male mice. Some of those cells were\ntransformed into eggs and the eggs became pups. This advance may allow\nsame sex reproduction of other animals too,\nincluding perhaps humans. There's a long way to go before that's something that\nwe would call a breakthrough. Again, something to keep a watch on. And then the last thing\nthat I wanted to, you know, that was one of the sort of near misses was over the counter Narcan. So Narcan, as you probably are all aware, is a drug that reverses opioid overdose. It's now being sold\nnationwide by retailers like Walgreens, CVS and Walmart. It's only like $40 for two doses. And so it is making this drug\nvery, very widely available without a prescription, not expensive, will undoubtedly save lives. And we're talking about\n80,000 Americans every year that die from opioid overdose. But we didn't put this on the list either. And that was because really the advance was in the distribution method, not the scientific or\ntechnological breakthrough. So that explains why we put\non the list what we did. I hope you found it interesting. Our team loves, loves working on this. It is like the favorite thing. I could probably give\na version of this talk probably every week for the whole year. I hope it inspires you.\nI hope it challenges you. And ultimately, you know,\nthis is why we do what we do. We are, you know, are just\npainfully earnest optimists. We wanna bring innovations to you, the people who are creating the future. We wanna nurture a new idea\nthat could be a breakthrough that will impact all of us. I can't wait to see what ideas, you know, you all come up with. I hope to read about them\nin \"MIT Tech Review\", and I thank you for your attention. (audience applauding) (bright music)"
    }
}