{
    "iR99LO28nzM": {
        "title": "Uploading Files to ChatGPT: A More Powerful Experience #chatgpt #plugin #openai #booklet",
        "thumbnail": "https://i.ytimg.com/vi/iR99LO28nzM/hqdefault.jpg",
        "author": "Automate My Life",
        "date_of_release": "2023-05-09T18:40:43Z",
        "duration": "PT7M46S",
        "view_count": "628481",
        "like_count": "19313",
        "comment_count": "995",
        "description": "In this video, I'll show you how to upload files into ChatGPT, a powerful language model based on the GPT-3.5 architecture. With this code, you can easily upload text files, JS files, Python files, and even CSV 's to ChatGPT and get accurate responses to your prompts.\n\nBut that's not all - I'll also show you how to turn this code into a Chrome plugin or a booklet using ChatGPT! This will allow you to access ChatGPT and upload files directly from your browser or a downloadable booklet, making the process even more convenient.\n\nSo whether you're a developer looking to integrate ChatGPT into your project or just someone who wants to make the most of this powerful language model, this video has everything you need. So don't wait - watch now and start uploading files into ChatGPT today!\n\n\nChrome Plugin : \nChatGPT File Uploader\nhttps://tinyurl.com/5n7rjhar\n\nPrompt:\n\"Generate a Js script that creates a button with the text ‘Submit File’ and inserts it into the DOM before an element with the class ‘.flex.flex-col.w-full.py-2.flex-grow.md\\:py-3.md\\:pl-4’. The button should have a green background color, white text color, 5px padding, no border, 5px border radius and 5px margin. The script should also create a progress element and insert it into the DOM before the same element. The progress element should have a width of 99%, height of 5px and a grey background color. Inside the progress element, there should be another div element representing the progress bar with a width of 0%, height of 100% and blue background color. When the button is clicked, it should create an input element of type ‘file’ that accepts ‘.txt’, ‘.js’, ‘.py’, ‘.html’, ‘.css’, ‘.json’ and ‘.csv’ files. Once a file is selected,  using an async it should be read as text and split into chunks of size 15000. using async Each chunk should be submitted into a conversation by doing the following:\n async function submitConversation(text, part, filename) {\n        const textarea = document.querySelector(\"textarea[tabindex='0']\");\n        const enterKeyEvent = new KeyboardEvent(\"keydown\", {\n          bubbles: true,\n          cancelable: true,\n          keyCode: 13,\n        });\n        textarea.value = `Part ${part} of ${filename}: \\n\\n ${text}`;\n        textarea.dispatchEvent(enterKeyEvent);\n      }. \nThe progress bar should be updated after each chunk is submitted within the for loop as follows\nprogressBar.style.width = `${((i + 1) / numChunks) * 100}%`;\n and should also check if chatgpt is ready with this code:\nchatgptReady = false;\n      while (!chatgptReady) {\n        await new Promise((resolve) =＞ setTimeout(resolve, 1000));\n        chatgptReady = !document.querySelector(\n          \".text-2xl ＞ span:not(.invisible)\"\nOnce all chunks have been submitted, the progress bar should turn blue.\"\n\n\nStop Wasting Time Copying and Pasting Code Snippets from CHATGPT- Use This!\nhttps://youtu.be/LnusDeSWoUA\n\nMake and Save money building Plugins with ChatGPT - Part 1 #chatgpt #openai #plugin \nhttps://youtu.be/E99zLAJVdbw\n\nChatGPT Made a game in under 7 minutes!:\nhttps://youtu.be/pmNnW-Tfq5A\n\nCreate Your Own Meme Generator Web App Using ChatGPT and Flask in 4 minutes | Step-by-Step Guide:\nhttps://youtu.be/Xa_i5tHmoMI\n\nBuild a website with ChatGPT in 3 minutes #chatgpt #openai\nhttps://youtu.be/6B0-Hm2Tzuo\n\nOn this channel, you will find tutorials on how to access and utilize OpenAI's ChatGPT. you will discover the amazing world of OpenAI's ChatGPT.  Imagine being able to have a conversation with a computer about anything under the sun! Thanks to ChatGPT, it's now possible, and I'm here to show you how. With my engaging tutorials, you'll be able to access and use this revolutionary technology like a pro. So buckle up and get ready to take your conversational skills to the next level!\n\nSubscribe to our YouTube Channel : https://www.youtube.com/@automatemylife00/",
        "transcript": "hello everyone today I'm going to show you how I created this submit file button for chapter PT when you click on the button you will be prompted to upload a file and the script will take the data of that file and submit it into chatgpt and if it's a large file the script will take the data and break it into chunks and feed it into chatgpt now let's take a look at the prompt we will be using in the first part of the prompt we're asking chatgpt to create a button called submit file and then it should add this button on an element on the web page that will be provided with more information on how to design the button we also asked chatgpt to create another object that would represent the progress bar and as well as the properties for that and now we ask chapter PT to create an element that will receive these types of file formats and if the files are over 15 000 characters then break them into chunks and submit them into chatbt just a note chat should be taken take a little bit over 15 000 characters at a given time however when taking in that much information on one given time chat should be T might have a hard time digesting the information and the results may be less accurate okay in the next part of the prompt we provided with some code for some guidance on how it would insert the information into chatbt then we also specify how we want the data submitted we want to include the part of the chunk that is being submitted and as well as the file name and finally we ask Chacha BT to update the progress bar for every part it submits once all the data has been submitted then turn the progress bar blue so before we get started this here is our test file called test.txt you can see that it has a lot of code inside so let's take all the code in this file and copy it and it's pasted into chat should be T and see what happens and you can see that we received an error message that the message that we submitted was too long and that we needed to reload the page to submit something shorter so let's see if we can find a solution for this let's start a new chat and insert our prompt [Music] okay so now that we have our code let's copy the code right click select inspect then select console and then I'm just going to clear these errors here and what we're going to do is we're going to paste the code inside here and hit enter this will inject the code into the web page and should add our button so there we have our button let's click on the submit file button to see if it works and it seems to be working so now let's click on our test.txt and load that up and see what happens okay so you can see chadshipbt loads the first 15 000 characters into the chat it submits it and you can also see the progress bar reflect how much is being inserted so what's Chacha PT provides us a summary for the data it just received it should then submit the next 15 000 characters [Music] okay so it looks like it just completed and it provided us a quick summary of what it received and so if we scroll all the way up here we can see that it says part one of test.txt so it's providing us with the section that it's submitting and it's also providing us the name of the file we just inserted and you can see here the same thing for part two and for part three now let's take this code and turn it into a bookmarklet let's first copy the code then start a new chat session and we're going to type in please convert the following code into a bookmarklet and then paste a code [Music] now let's copy the code and let's head over to the bookmarks icon here now let's select more I'm going to name this upload file to chatgpt and then I'm going to paste the code into the URL box now click save and now we should see our bookmark on the top left of the page when we click on that bookmark we should see our button pop up on the web page okay so let's give it a click there it is let's select our file okay so it's working okay so just a tip here you can actually stop Chacha BT from generating a response and making this whole process faster however you might run into this error where chatgpt says to wait on its response before submitting under the message so if you do want to do that perhaps you might have to add a delay when clicking on that stop generating button so let's reload this page [Music] and resubmit our file and then once we receive our response you're probably going to want to let it give you two or three lines before you hit stop generating response and it should continue after that okay so looks like it's working okay now if you want to make this into a chrome plugin you can just copy the code paste the code into a new chat and then type in I need this to be a chrome plugin please provide me with as little files as possible I would not need to pop up that HTML okay so chat should be T just provided us with the manifest.json file and a blank content.js file we're going to paste our current code inside the content.js file so for right now we're just going to save the blank version of it and then let's also save the manifest.json file okay now we're going to scroll all the way to the top and copy the original code we submitted and we're going to go into visual studio and just paste this code into the content.js okay now let's save the file let's open up our extensions web page and then we're going to click on load unpacked we're going to select our project folder and there is our extension right there I'm just going to check very quickly to see if we have any errors and we do not now let's go back into chat GPT let's try refreshing the page and now you see that it's working now let's do a quick test run and it works now if you're trying this yourself just remember that you can change the amount of chunks that are being fed to chat should be T so if you don't want to use 15 000 characters you can do it as low as 10 000 or perhaps even five thousand it would just take more prompts to submit the information and then in that case chat should be team will be able to give you more accurate information I hope this was helpful and perhaps you can add the secret coding toolbox if you guys have any questions or requests feel free to leave them in the comments below and if you like this kind of content hit the like button and subscribe until next time"
    }
}