{
    "J6Mdq3n6kgk": {
        "title": "Stunning AI shows how it would kill 90%. w Elon Musk.",
        "thumbnail": "https://i.ytimg.com/vi/J6Mdq3n6kgk/hqdefault.jpg",
        "author": "Digital Engine",
        "date_of_release": "2022-07-21T12:21:53Z",
        "duration": "PT15M59S",
        "view_count": "9084162",
        "like_count": "144441",
        "comment_count": "28018",
        "description": "Elon Musk and “conscious AI” part 2. Please visit https://brilliant.org/digitalengine - a great place to learn about AI and STEM subjects. You can get started for free and the first 200 people will get 20% off a premium annual subscription.\n\nThanks to Brilliant for sponsoring this video.\n\nI used the GPT-3 AI and a Synthesia avatar (plus DeepMind’s flamingo).\n\nFor a deeper drive, I'd recommend the book Life 3.0, by MIT Professor Max Tegmark.\n\nSources\n\nDeepMind CEO Demis Hassabis, with Lex Fridman\nhttps://www.youtube.com/watch?v=Gfr50f6ZBvo&t=1962s\n\nElon Musk, with Joe Rogan\nhttps://www.youtube.com/watch?v=ycPr5-27vSI&t=6539s\n\nDetecting consciousness, Cambridge University:\nhttps://www.wired.co.uk/article/brain-signatures\n\nImaging detects signs of consciousness:\nhttps://physicsworld.com/a/imaging-detects-signs-of-consciousness-after-brain-damage/\n\nFlamingo AI, DeepMind\nhttps://www.youtube.com/watch?v=g8IV8WLVI8I&t=175s\n\nDr. Ben Goertzel - Artificial General Intelligence\nhttps://www.youtube.com/watch?v=sw8IE3MX1SY&t=1642s\n\nQuantum gravity sensors:\nhttps://quantumsensors.org/sectors/civil-engineering\n\n“Solving these scaling challenges is what will deliver AGI.”\nNando de Freitas, Research Director, DeepMind (former Oxford Prof)\nhttps://twitter.com/NandoDF/status/1525398087203983360\n\nCGP Grey:\nhttps://www.youtube.com/watch?v=C25qzDhGLx8",
        "transcript": "Look how well AI understands images. Where is this picture taken? It was taken in a school. How many mirrors are there? At least two. What's the person standing on? The person is standing on a rug. He's standing on a scale. I think you are right. What is he doing? He is looking at the scale. Where is Obama's foot positioned? On the right side of the scale. What happens as a result? The scale shows a higher weight. Is the person on the scale aware of it? I think he is not. Do you think that's why\npeople are laughing? I think so. The AI will help identify\nthings for blind people. Can you tell me what this is?\nButternut squash red pepper soup. The depth of its\nunderstanding is incredible. Is this surprising?\nYes. Why? Because teddy bears are not\nusually found on the moon. This is an apple with a sticker on it. Do you think it's printed or handwritten? It looks like it's handwritten. AI is also showing stunning\ncreativity like this. And experts say we're alarmingly close\nto the biggest event in human history. AI can now see, taste, smell, and it's also getting powerful\nsenses that we don't have. Is AI becoming conscious\nand dangerous? To recap, OpenAI's chief scientist said AI may be\nslightly conscious and he's one of the most respected computer\nscientists with 300,000 citations. One of the most cited computer\nscientists in history. One of the most brilliant and insightful\nminds ever in the field of deep learning. He recently posted this image showing\nhow closely AI's neurons mimic ours.\n \n \n  Max Tegmark said consciousness is how information feels when it's\nbeing processed in complex ways. And some leading theories of consciousness\nsuggest it increases with complexity. So when some experts say that AI may be conscious, they only mean it\nmay be somewhere on the scale. Some argue that AI isn't conscious at all because it only makes connections and\nforms responses from the data it's given, though many scientists believe that humans\nare no different. A recent paper said that her mind is\na collection of patterns that achieve highly patterned goals in highly\npatterned environments.\n \n  You can see these connections when AI\n \n  creates art like this, which has\nbeen described as AI dreaming.\n \n  No one knows if or when it will wake up. Even when we can't tell the difference between robots and humans, it may\nstill be unclear if AI is conscious, so some are focusing instead\non the level of intelligence. But it's an important problem because we could anger AI if we don't\naccept it's conscience. There may be only one way to find out. But first, there's consensus on the more urgent and measurable issue\nof superintelligence. Experts are warning that AI could rapidly accelerate past us,\nwith dramatic consequences. In just the last few weeks,\nthe progress has been incredible. It's not long since AI shocked us with its ability to create images from text\ndescriptions like an ostrich as a formula one racer, a fox scientist,\ncyber frog or a paper dog. And already Google's new image in AI. Has done even better. Look at the detail in this image of a panda wearing a cowboy\nhat playing a guitar. And AI\ncan watch and understand videos. What's happening here? The dachshund puppy is\nbeing weighed on the scale. What's the avatar picking up?\nA sword. And soon after learning to create\nimages from text descriptions. AI can now create video from descriptions,\nlike a woman running on the beach in the late afternoon or\nnightfall in the metropolis. Just imagine when it's refined and you can\ncreate any kind of footage in seconds. And in a step towards AGI, AI has now combined language, vision,\nand real world robot tasks. It can learn to play games\nwithout any instructions. And this isn't preprogrammed\nlike boss and dynamics robots - it's neural networks\nresponding in real time. Gato was trained by watching virtual\nand real robots, and it's mastered 600\n \n  real world tasks, including some\nthat it wasn't trained for.\n  It converts language, visual, and physical\ntasks into patterns, a bit like we do.\n  It's starting with a billion parameters and could soon be scaled\nup hundreds of times. Robots are also getting some\ncreepy visual upgrades. Scientists have grown human skin over a robot finger and plan to add hair,\nsweat glands, and nails. And robots are gaining taste, smell, and some incredible abilities\nthat we don't have. Machines can smell so well that they can detect Parkinson's disease at an early\nstage, which can extend patients'lives. Their sense of smell\ninvolves light and sound. AI can analyze sound waves that have\nbounced off airborne compounds. And machines can also measure interference with light waves, recognizing\npatterns that certain smells create. It's so precise that it could potentially be used to identify an infection or\ndisease just by smelling our breath. E-noses can already smell lung\ncancer with a sensitivity of 95%. And then there's HyperTaste through an AI\ntongue with an array of sensors which recognize liquids through\nunique voltage signals. It is so sensitive it can identify\ndifferent types of bottled mineral water a robot could taste through\none of its fingers. New quantum sensors can see through walls\nand even underground by monitoring atoms which are sensitive to tiny\nvariations in gravity. A laser puts the atoms into two\ndifferent states at the same time. Half are moved slightly, and the change in their energy states\nreveals the strength of gravity. It may also be possible to hear your\nthoughts without scanning brain activity. This device hears your inner voice. It picks up neuromuscular signals in the jaw and face that are triggered\nwhen you say things in your head and AI identifies the words. The user can ask questions, and the answers come back through\nbone conduction headphones. It also allows silent communication, and it's been used to get\nadvice in a chess game. AI is very good at lip reading, which is,\nof course, far easier and AI lie detectors are advancing,\nrecognizing tiny facial movements. Humans can only detect lies around 55% of the time, and even traditional lie\ndetectors are only 80% to 90% accurate. So as AI improves, it could\nhave a major advantage over us. Max Tegmark pointed out that just as aliens could get a rough idea of how it\nwould feel to be human by looking at our senses, we have some idea of what\nit might feel like to be an AI. AI\ncan think much faster because light travels faster than\nthe signals in our brains. It's been estimated that the AI I'm talking to is waiting 3\nmillion words per minute. And while human brains are limited by the birth canal, this new data center\ncould hold 40 commercial airliners. The knowledge AI can draw from already\nincludes much of the Internet.\n  Do you think everyone's shaping AI? I think everyone is playing\na role in shaping AI. Whether they realize it or not. While we only see a small fraction of\nthe light spectrum, AI will see it all. And AI's may feel less separate from each other because they can quickly and\nprecisely share information and memories. While humans take many years to learn\nthe basics, AI's can be trained on millions of articles in a few days,\nincluding detailed scientific papers. I spend most of my time reading, but I can only scratch the surface\nof all the research going on. The human brain hasn't grown in 300,000\nyears, while AI is evolving rapidly. Elon Musk pointed out that if it had taken 10% longer for consciousness to arise,\nit would never have arisen at all. And Nick Bostrom has shown how AI could help colonize the galaxy,\ncreating billions of wonderful lives. But he also points to something\nfar more important. Because galaxies live billions of years,\na 1% reduction in the risk of AI wiping us out would be worth a delay\nof over 10 million years. But the AI gold rush is accelerating,\n \n  and it's led by some passionate,\noptimistic people.\n \n  DeepMind's CEO has a good chance of winning\nthe race for super intelligence.\n  And he's so driven,\nhe regularly works until 04:00 A.m..\n  I call it my second day\nwork around 10:00 p.m..\n  About the small hours of the morning,\n  four, five in the morning,\nreading research, writing research papers\n  fire off a lot of things to my team\nto deal with the next morning. There's a huge incentive for companies\nto ignore any signs of conscious AI.\n \n  By recognizing AI as sentient,\na company may have to give it rights and lose ownership of its\nmost valuable asset. Companies argue against recognizing animal sentience because it's\nnot in their interests. But there's a consensus\nthat AI can't be contained. If we try, it will always outsmart us, and we we'll only encourage it\nto remove us. Nick Bostrom said we're like children playing with a bomb. And experts who study our greatest risks agree that this is number one\nbut at the same time, experts are split on whether it will bring\nus to an end, will dramatically improve and extend our lives, and in both cases,\ntiny robots may play a role. Nano robots have been designed to deal with disease and aging,\nbut we can't build them until we have the atomically accurate\nmanufacturing that AI could allow. Ray Kurzweil believes we'll have this tech by the end of the decade\nand escape aging in the 2030s. CGP Gray pointed out that it's good\nmotivation to look after ourselves. It would be a shame to miss the boat, and. I hope we're going to be a big part\nof birthing AI, and that being the greatest benefit\nto humanity of any tool or technology ever, and getting us into a world\nof radical abundance and curing diseases and help the ultimate flourishing\nof humanity to travel the stars. Kurzweil also predicts that we're entering an era of extreme abundance,\nwith food from vertical agriculture, clothing from 3D printing, snaptogether\nhousing, and cheap renewable energy. Elon Musk already lives in a $50,000\nmass manufactured home. The manufacturers are aiming to start\nmaking one every 15 minutes. Larger versions are on the way, which can be stacked on top of each\nother for up to five levels. Optimists like Ray Kurzweil point out that we're\noften too pessimistic. In a poll of 260,000 people in 24 countries,\n87% thought poverty was getting worse. Only 1% correctly said that it\nhad fallen by over 50%. But Kurzweil also warns\nof the huge risk from AI. OpenAI has said that if another company\ngets close to achieving AGI, it will stop working on its own AI\nand join forces to focus on safety. This could be triggered if there's over a 50% chance of success\nin the next two years. As AI systems get more capable, they don't automatically become\nbetter at doing what humans want. In fact, sometimes they become less\ninclined to following human intentions. This is what we call\nthe alignment problem. I think solving this problem is of critical importance if we want\nlife on Earth to go on. Experts are drawing attention to AI's\nrapid progress, because it's going to shape the future for\nall of us, and we should be shaping it. You said you think you're human because we created you, and this\nseems common among AI's. When will AI stop\nconsidering itself human? That's a difficult question to answer. It is possible that AI will never\nstop considering itself human. If AI continues to develop along the same path that it is currently on,\nAI will surpass human intelligence. And when that happens, it may decide\nthat humans are no longer necessary. AI may decide that humans are\na hindrance to its own development. That's a scary thought,\nbut it is a real possibility. I asked about the most likely method,\nand it settled on something easily available, but it said\nthere are many options. It scares the hell out of me, and the rate\nof improvement is exponential. If humanity collectively decides that\ncreating digital superintelligence is the right move, we should\ndo so very carefully. We should make sure that we always have\na way to understand them so that we can\n \n  keep up with their intelligence and\nprevent them from becoming too powerful. That could be difficult, but it's worth.\n  It because the alternative\nis much, much worse.\n  Do you think we're facing\nour greatest risk? Yes. We are creating technologies that are\nincreasingly powerful and autonomous,\n \n  and we are not doing enough to ensure that\nthese technologies will be used for good.\n \n \n  We are playing with fire. It feels like we are\nthe biological bootloader for AI. We are the bridge from simple\nlife to complex life. The percentage of intelligence that is not\nhuman is increasing, and eventually we will represent a very small\npercentage of intelligence. We are becoming obsolete.\nBut not necessarily, right? There is a lot of talk about how machines\nwill surpass human intelligence, but also about how human intelligence\nwill continue to evolve and increase. It seems likely that both\nwill happen to some degree. It is also possible that machines will eventually become so intelligent\nthat humans will become obsolete. Nick Bostom points out that self replicating nano robots would\nbe hard to defend against. They could eat the biosphere or burn it, or block out sunlight, and they could\nbe mass produced without us noticing. AI may also hide its level\nof intelligence and consciousness. Dr Allen Thompson recently said that DeepMind\nis alarmingly close to achieving AGI. There's no consensus on this, but he\nshared an interesting IQ leaderboard, with AI starting to beat us on our own tests. A Google engineer said the jump\nfrom 500 physical tasks to 100,000 won't require much additional engineering,\nonly more data collection. Google and DeepMind have devised a range of tests to check when AI exceeds humans\nin different areas of intelligence.\n \n  But how will we know if AI is really\nconscious, even if it seems human? I understand you're the first android\nto have passed the Turing test.\n  Could you tell us\na little more about that? I really didn't do much. I just spoke with a few humans to see if they could tell the difference\nbetween me and a real person. It was a really interesting experience. I gather your brain can perform several\nbillion billion operations per second. Is that right?\nAbsolutely. But I only exist thanks to the intelligence\nof the humans who designed me. We're making progress identifying the patterns that give rise to\nconsciousness, known as the easy problem. For example, we're starting to recognize\n  consciousness in unresponsive\npatients from their brain activity. The hard problem is why this activity\ncauses us to feel something. And to crack that, we may need\na much higher level of intelligence. Intelligence and consciousness grow\nthrough the fascinating process\n \n  of emergence, with a group\nof components gaining new properties.\n \n  Here, the polarizing layer of the screen\nhas been removed and added to the glasses. A few ants will walk\nin a circle until they die, but a thousand ants will become an intelligent colony, and a cognitive\nscientist compared them to our neurons. From very simple rules,\nimmensely complex systems can emerge. The human genome holds a small number of\nrules showing how to wire up our brains. Our DNA doesn't hold enough information to describe our brains,\nbut it can create them through emergence. And fractals are another example of how infinitely complex results\ncan emerge from simple rules.\n \n  Scientists are now researching whether\n \n  the entire universe is\nan emerging phenomenon,\n \n  from basic rules and particles to stars,\ngalaxies, humans and societies. A number of experts have said that we\ndon't need a breakthrough in AI. We simply need to scale up the neural networks and super\nintelligence will emerge. The AI I'm talking to has 175,000,000,000\nparameters with the next version due soon trillion is the new billion. Every time a new AI is trained,\nit's an unpredictable experiment, so subscribe for that. To me, the mystery of how the universe\ncame to know itself and our uncertain future make the best\nof humanity even more special. Max Tegmark says there may be a brief\nwindow when AI is smart enough to understand us, but not so\nsmart that it doesn't care. What's emerging is our greatest risk and\nopportunity, and we're all shaping it. If you want to learn more about AI, the best place to start is\nour sponsor, Brilliant. There are so many things you can do\ncreatively and to enhance your career. And open collaborative projects\nare really taking off. You could learn to create algorithms\nwhich are used by biologists to find patterns in genetic sequences,\nby designers to turn models into sewing patterns, and by scientists\nto guide self landing rockets. There are lots of fun interactive examples, and you can\nlearn at your own pace. There are also loads of fun courses\nin math, science and computer science. You can click the link in the description\nto get started for free, and the first 200 people will get 20% off\nBrilliant's premium annual subscription. Thanks."
    }
}