{
    "KmFG_QNSZzA": {
        "title": "Ch 13: Where does the Schrödinger equation come from? | Maths of Quantum Mechanics",
        "thumbnail": "https://i.ytimg.com/vi/KmFG_QNSZzA/hqdefault.jpg",
        "author": "Quantum Sense",
        "date_of_release": "2023-02-03T13:00:13Z",
        "duration": "PT14M58S",
        "view_count": "47527",
        "like_count": "2054",
        "comment_count": "170",
        "description": "Hello!\n\nThis is the thirteenth chapter in my series \"Maths of Quantum Mechanics.\" In this episode, we'll finally understand where the Schrödinger equation comes from. We'll first derive that time evolution must be unitary, then use that to get to the form of the equation. We'll then use the fact that energy is the generator of time evolution to take it all the way home (after fixing the units).\n\nIf you have any questions or comments, shoot me an email at:\nquantumsensechannel@gmail.com\nThanks!\n\nAnimations: \nAll animations created by me within Python, using Manim. To learn more about Manim and to support the community, visit here:\nLink: https://www.manim.community/\n\nMusic:\n--------------------------------------------------------------\n♪ Mind Palace by Rosentwig\nLink : https://rosentwig.bandcamp.com/album/imagination-mind-palace\n--------------------------------------------------------------",
        "transcript": "Hi everyone. Last episode, we learned what generators are\nand how they show up in classical physics. Importantly, we found that energy generates\nchanges in the time of our classical state. This episode, I want to connect this to quantum\nmechanics to finally derive and demystify the Schrodinger equation. So with that, let’s go ahead and get started. First and foremost, what do we mean by time\nevolution in quantum mechanics? Well remember that we are trying to model\na quantum particle, which we mathematically represent as a quantum state ket in a vector\nspace. As this particle advances in time and interacts\nwith fields or other particles, we expect that the quantum state will also accordingly\nchange in time. Our goal is to find exactly how this quantum\nstate changes and evolves throughout time. To evolve and transform our quantum state\nin time, it seems clear that we need an operator, which we will call the time evolution operator,\ndenoted here with a big U. This operator takes in a time t, and when\nacted upon an initial quantum state, will evolve that state forward by t amount of time. So U(2s) would evolve our quantum state forward\nby two seconds. Before trying to figure out what this time\nevolution operator actually is, it’s a good idea to use our physical intuition to determine\nsome of its properties, so let’s do that. First, what should U of zero be? Well this operator time evolves our quantum\nstate by zero seconds…which means we do nothing to it, we leave it exactly as it was. Therefore, since U of zero didn’t change\nanything, we expect U of zero to be the identity operator. Next, we want to use the intuition that we\nexpect that time evolution is reversible. In other words, if we time evolve a particle\nforward by two seconds, it should be possible to time evolve it backwards by two seconds\nand get our initial state back. Mathematically, this means that we expect\nthat time evolution is invertible, and U-inverse exists. This might seem obvious to state, but in a\nfew moments you’ll see why this is an important point. For our last piece of physical intuition,\nit should be reasonable to expect that when we evolve our quantum state in time, the total\nprobability should be conserved. In other words, even after we evolve the state\nby time t, we better expect that the total probability, calculated as the inner product\nwith itself, always stays equal to its initial value of 1. Looking at this equation, notice that it’s\nthe same property satisfied by unitary operators (and if you need a reminder of what those\nare, review episode 11). Well, since we’re deriving a very important\nequation, let’s be somewhat rigorous and justify that this property indeed implies\nunitarity. For simplicity, we’ll denote U of t as simply\nU. So, we want to prove that this equation implies\nthat U is unitary. To start, let’s pull out the right side\nU operator, and use the hermitian conjugate of the left U operator to also move it to\nthe middle, giving us the following. Now let’s move everything to the left hand\nside, and insert an identity operator in between the lone inner product. We can then use the linear property of operators\nto combine everything into a single inner product. So, here we have an operator (Udagger U minus\nI) that when sandwiched in an inner product, returns zero, no matter what state we use. To get some more information about this sandwiched\noperator, let’s try taking its hermitian conjugate. First we distribute the dagger. The hermitian conjugate of the identity is\nitself – and for the left term, we remember the hermitian product rule which says we flip\nthe product then distribute the dagger, which just gives us U dagger U again. But notice, this is exactly what we started\nwith, therefore this entire operator is hermitian! Since this operator is hermitian, we know\nthat it must have an orthonormal eigenbasis. For simplicity’s sake moving forward, let’s\nlabel this operator as A, and elements of its eigenbasis as a_i. Now let’s go back to our equation; and let’s\ngo ahead and relabel the sandwiched operator with A. Remember that this must be true for\nany state, so now that we know A has an eigenbasis, let’s go ahead and use one of its eigenvectors. A acting on its eigenvector will just give\nus the eigenvalue. We can then pull out the eigenvalue, and the\nremaining inner product of the orthonormal eigenvector equals one. Therefore, we find that the eigenvalue equals\nzero. This must hold for all eigenvectors, therefore\nall of the eigenvalues of A must be zero. Let’s now act A on an arbitrary vector. We can expand this vector in A’s orthonormal\neigenbasis, and move A into the sum. Acting A on an eigenvector will return the\neigenvalue, which equals zero; therefore, we get zero for every term in this linear\ncombination. Thus A sends psi to zero. This must be true for any vector, therefore,\nwe find that this operator must actually be the zero operator. We can then plug back in our definition for\nA, and therefore we can conclude that Udagger U is equal to the identity. Now, since we showed that time evolution reversal\nimplies that U inverse exists, we can apply U inverse to both sides. Hence, we have that U dagger equals U inverse,\nand therefore we have just shown that the time evolution operator is unitary! Before moving forward, I want to reiterate\nthat proving unitarity relied on only two main physical intuitions: One, time evolution\nis reversible; and two, probability is conserved through time. Remember this, because you’ll see these\ntwo intuitions will allow us to derive 90% of the schrodinger equation. With that, we’re finally ready to start\ndigging into exactly how this time evolution operator works. To do so, we will employ a technique that\nshould be in every physicists’ toolkit. Finding the action of this operator over arbitrary\ntime t sounds like a really tough problem. A much easier problem is to instead find the\naction of the operator over an infinitesimally small time dt. Since dt is really small, we can consider\nthe taylor expansion of this operator to first order. The first term is U of zero, the next term\nis the derivative at 0 times dt, and for the mathematicians, we’ll keep track of terms\norder dt^2 and higher. Remember that U of zero is the identity, so\nwe have the following. Now, let’s study how this acts on an initial\nstate. Let’s apply both sides to an initial quantum\nstate, psi. On the left hand side, we’ll simply get\na quantum state that is time evolved forward by time dt. Now if we subtract both sides by psi, then\non the left we now have the difference in our quantum state after time dt. Let’s now divide both sides by dt. Now, if we then take the limit as dt goes\nto zero, do you notice something on the left hand side? We have the limit of the change in our state\ndivided by the change in time as it goes to zero – that’s the definition of a derivative! And for the mathematicians, all higher order\nterms are still of order dt, so they vanish as we take dt to zero. So, we are left with the time derivative of\nour quantum state being equal to the derivative of the time evolution operator acting on psi. And check that out, by looking at tiny time\nscales, we have derived a differential equation for the time evolution of our quantum state! So, where do we go from here? Well, notice that we still haven’t used\nthe information that U is unitary. To input that information, let’s analyze\nthe unitary property on the taylor expansions. First, let’s start with this equation, which\nis true because Udagger is the inverse. We can now plug in the taylor expansions we\nderived earlier; where we’ve distributed the dagger in the first expansion. Let’s now multiply these two out. We first get the identity operator, then U\ndot dagger dt, then Udot dt, then other terms of order dt^2 and higher. We can cancel both the identities, and then\ndivide both sides by dt. We can then go ahead and send dt to zero. Since the higher order terms are still of\norder dt, they vanish as dt goes to zero. So, if we move a term to the other side, we\nget the following. The hermitian conjugate of Udot is equal to\nthe negative of Udot. This means that the derivative of the time\nevolution operator is antihermitian. Now this seems like a neat fact, but how does\nthis help us? Well, let’s multiply Udot by i. Let’s now take the hermitian conjugate of\nthe operator i Udot. Using the product rule of hermitian conjugates,\nwe get the following. We just showed that Udot is antihermitian,\nand the hermitian conjugate of i is just the complex conjugate, giving us -i. The two negatives cancel, and we are left\nwith i udot, which is exactly what we started with! So, this operator is actually hermitian! Therefore, this equals some hermitian operator,\nwhich we’ll call H. Dividing both sides by i, we get that Udot is equal to some hermitian\noperator divided by i. Now, let’s move back to the differential\nequation we derived. Let’s now plug in our expression for Udot,\nmultiply the i over, and check out what we’ve got. We have derived that i times the time derivative\nof our quantum state is equal to some hermitian operator acting on our state. Those of you familiar with the schrodinger\nequation should be very excited right now. What we have just derived is the general form\nof the schrodinger equation. Hopefully by this point, you’ve realized\nthat 90% of this equation comes from unitary time evolution, which we derived from just\ntwo principles: time evolution is reversible, and probability is conserved through time. We’ve really only used these two physical\nprinciples to get to this point. Well, that being said, let’s go ahead and\nfinish it up to form the complete schrodinger equation. Remember that hermitian operators are closely\ntied to physical observables, so this seems to point us towards some physical observable\nthat is related to time evolution. We showed last episode that if we want to\nchange just the time in our classical lagrangian, this is generated by changes in energy – ie\nenergy is the generator of time evolution. So if we want some observable that changes\nthe time in our quantum state, we now use our intuition from classical physics to assert\nthat this hermitian operator on the right hand side is the energy operator, also called\nthe Hamiltonian operator. Now, this argument for the hamiltonian seems\nto bother some people, and I know it bothered me at first. It’s like, so far we’ve had a fairly mathematical\nderivation, and suddenly we’re making this classical physics assertion for the hamiltonian? But I want you to understand that it’s somewhat\nimpossible to pull the schrodinger equation out of thin air. I mean think about it, in order for this equation\nto describe the world around us, we have to input some information about how our universe\nacts – math on its own does not understand our universe. The information we therefore input is the\nfact that energy is the generator of time evolution. Now, there’s one last thing we have to do. This is physics, so we need to be careful\nwith units. On the left, the time derivative gives us\nunits of inverse seconds, and on the right the hamiltonian gives us units of energy,\nor Joules. These clearly don’t match – therefore,\nwe need to introduce a constant to match the units. If we add a constant to the left hand side,\nthen it needs to have units of energy times seconds, or joule seconds, in order to cancel\nout the inverse seconds. So we add a constant with those units, that\nwe call the reduced planck constant, and we have to determine its value through experiment. And there it is. One of the most important equations in physics,\nthe Schrodinger equation. Now that we’ve shown where it comes from,\nlet’s go ahead and recap how we got each term, that way we understand what every piece\nmeans. D over dt is the change in time of the quantum\nstate. Plancks constant shows up because we need\nthe units of both sides to match. Now, if you trace back through the derivation,\nyou’ll see that this i shows up because time evolution is unitary, which we derived\nmainly from probability conservation. Therefore, this i conserves probability. Many people wonder why quantum mechanics needs\nimaginary numbers – well there you go, it’s to conserve probability. Lastly, the hamiltonian shows up because classical\nphysics tells us that energy generates time evolution. And there it is, now we know what each piece\nof the schrodinger equation is and where it comes from. You should be incredibly proud of yourself\nfor making it this far in the series. We’ve worked really hard to get here, and\nI commend you for sticking through it. Your reward is that you now have an understanding\nof one of the greatest equations discovered by mankind. This was a pretty math heavy video, so I’m\ngoing to end it here. Now there are still open questions. For example, how do we go from the equation\nwe derived to the one most people first see in their introductory quantum classes? On this note, next episode, we’ll derive\nthe form of the momentum operator, and we’ll see how the position basis schrodinger equation\ncomes about. So stay tuned as we continue our quantum journey. Thank you so much for watching! As always, leave a comment if you have any\nquestions, and I hope to see you in the rest of the series!"
    }
}