{
    "Lxmm2ve3h_0": {
        "title": "GOP's Jordan says he's still running for House gavel",
        "thumbnail": "https://i.ytimg.com/vi/Lxmm2ve3h_0/hqdefault.jpg",
        "author": "WCNC",
        "date_of_release": "2023-10-19T23:09:02Z",
        "duration": "PT1M47S",
        "view_count": "58041",
        "like_count": "305",
        "comment_count": "301",
        "description": "Refusing to drop out, Republican Rep. Jim Jordan told GOP colleagues Thursday he was still running to be House speaker but would back a longshot plan to give someone else the gavel for the next several months as he works to shore up support to win the post himself.\r\n\r\nJordan delivered the message at a fiery closed-door meeting at the Capitol as the Republican majority considered an extraordinary plan to give the interim Speaker Pro-tempore Rep. Patrick McHenry more powers until January to reopen the House and conduct crucial business, according to Republicans familiar with the private meeting who insisted on anonymity to discuss it.\r\n\r\nREAD MORE: https://www.wcnc.com/article/news/nation-world/house-speaker-race-impasse/507-6cd1bf55-0023-4185-a8e2-d2592c6e2706",
        "transcript": "After a day of confusion and discussion, Jim Jordan says he is not giving up in the race for house speaker, the Ohio congressman failed to win the speakership in two rounds of voting. Now the house has been without a speaker for more than two weeks. And meanwhile, a plan to empower North Carolina Republican, Patrick mchenry is also seemingly falling apart and B C's Alice Barr is on Capitol Hill with the details shift in strategy to kick the House of Representatives back into action after more than two weeks without a speaker hitting another wall. Today, the current nominee, judiciary committee chairman Jim Jordan choosing not to push for a third house vote for now. I'm still running for speaker and I plan to go to the floor and get the votes and win this race. But I want to talk with a few of my colleagues, Chairman Jordan appeared to back a plan to temporarily empower the interim speaker Patrick mchenry, enabling the House to pass critical legislation while Republicans worked to get on the same page. But after a lengthy closed door huddle with GOP members, Jordan said there was too much opposition we made the pitch to members on the resolution as a way to lower the temperature and get back to work. We decided that wasn't where we're going to go. Moderates in both parties had expressed support so that we can start moving our appropriations bills aid to Israel deal with the crisis in Ukraine and our border. This is imperative. It's a national security issue, international security issue. Now, at this point, a deeply divided house striving for a solution to get back to the work of the American people in Washington, Alice, Barr NBC News."
    }
}