{
    "lYpwN_IRok0": {
        "title": "SpaceX Starship Mechazilla Catch",
        "thumbnail": "https://i.ytimg.com/vi/lYpwN_IRok0/hqdefault.jpg",
        "author": "Hazegrayart",
        "date_of_release": "2023-03-03T16:00:33Z",
        "duration": "PT52S",
        "view_count": "9354146",
        "like_count": "316557",
        "comment_count": "9237",
        "description": "SpaceX Starship, a remarkable creation from the visionary private space exploration company founded by Elon Musk, is an extraordinary feat of engineering that embodies the limitless potential of human ingenuity. The Starship represents a pioneering concept in space travel, providing an advanced, fully reusable transportation system designed to propel both crew and cargo beyond the frontiers of Earth's orbit and enable unparalleled point-to-point travel on our planet.\n\nThis awe-inspiring spacecraft comprises two distinct but interdependent components: the powerful Super Heavy booster and the sleek, futuristic Starship spacecraft. The Super Heavy booster serves as the initial thrust mechanism that catapults the Starship spacecraft into orbit, while the Starship spacecraft itself is responsible for carrying both crew and cargo to their intended extraterrestrial destinations.\n\nFashioned out of the ultra-durable stainless steel, the Starship spacecraft is a masterful creation of technological sophistication that can carry up to 100 people and accommodate a staggering payload capacity of up to 150 metric tons. The spacecraft boasts a bevy of cutting-edge features, including robust engines and state-of-the-art avionics systems that guarantee the utmost safety and precision in the spacecraft's landings on various extraterrestrial surfaces.\n\nSpaceX's relentless commitment to innovation and progress is evident in their extensive testing of the Starship prototype at their launch facility in South Texas. The company envisions a future where the Starship spacecraft serves as a vital tool for humanity's exploration of the Moon and Mars, as well as facilitating commercial point-to-point travel on our planet. With the Starship, SpaceX hopes to expand the horizons of space travel, making it more accessible and affordable for everyone and ushering in a new era of human achievement and exploration.\n\nFull Video https://youtu.be/t0Ob6DaMM2k\n\n#shorts #starship #spacex",
        "transcript": "Error: \nCould not retrieve a transcript for the video https://www.youtube.com/watch?v=lYpwN_IRok0! This is most likely caused by:\n\nSubtitles are disabled for this video\n\nIf you are sure that the described cause is not responsible for this error and that a transcript should be retrievable, please create an issue at https://github.com/jdepoix/youtube-transcript-api/issues. Please add which version of youtube_transcript_api you are using and provide the information needed to replicate the error. Also make sure that there are no open issues which already describe your problem!"
    }
}