{
    "mioN9D84PBs": {
        "title": "How Does Gaydar Work? | Gay Science | Rob Anderson",
        "thumbnail": "https://i.ytimg.com/vi/mioN9D84PBs/hqdefault.jpg",
        "author": "Rob Anderson",
        "date_of_release": "2021-09-03T18:43:54Z",
        "duration": "PT1M",
        "view_count": "1562505",
        "like_count": "152792",
        "comment_count": "2013",
        "description": "Gay Science is a series that asks the question “Why do the gays?” I take queer stereotypes and explain them scientifically with true 100% real science. In this episode of #GayScience we look at how Gaydar works.\n\nMore FartThrob on the internet:\nTikTok: Heartthrobert https://www.tiktok.com/@heartthrobert\nInstagram: Heartthrobanderson https://www.instagram.com/heartthrobanderson/\nTwitter: smartthrob https://twitter.com/smartthrob\n\nSign up for my newsletter and discover new music, clothes, art, and more. The Heartthrob Collective: http://eepurl.com/hFstpX",
        "transcript": "this is gay science in today's episode how does gaydar work gaydar is a superior genetic trait specific to gay people that allows them to identify each other discreetly it evolved out of a necessity to survive the bizarre world that hetero sapiens have created with things like religion cryptocurrency and eating fondue at the mall sharing a similar science to earthquakes gay people send and receive small vibrations through the ground that only they can feel at the same frequency as mariah's whistle tone this is how the monsters could locate reba mcintyre in the movie tremors there are many ways to use gaydar like gay whiplash after a first pass at eye contact a second faster double take is initiated and reverberates into the ground these signals are so strong that two men could be wearing oversized polo shirts and margaritaville boat shoes at a tom clancy book signing in memphis tennessee and still know the others gay another method is lesbian apparel pheromones there are some clothes like a beanie that look different to gay women when another gay woman wears it the gaydar trait is only accurate in person in an experiment at the crematica institute gay and straight men scored the same when asked to identify homosexuals from photos alone however gay participants did spot the other gay participants and later all hooked up"
    }
}