{
    "O6g-7rUgrdg": {
        "title": "Quantum Mechanics and the Schrödinger Equation",
        "thumbnail": "https://i.ytimg.com/vi/O6g-7rUgrdg/hqdefault.jpg",
        "author": "Professor Dave Explains",
        "date_of_release": "2017-05-02T19:22:56Z",
        "duration": "PT6M28S",
        "view_count": "1190454",
        "like_count": "26512",
        "comment_count": "906",
        "description": "Okay, it's time to dig into quantum mechanics! Don't worry, we won't get into the math just yet, for now we just want to understand what the math represents, and come away with a new and improved view of the electron as both a circular standing wave and a cloud of probability density. Spooky! Let's introduce the Schrödinger equation!\n\nWatch the whole Modern Physics playlist: http://bit.ly/ProfDavePhysics2\n\nClassical Physics Tutorials: http://bit.ly/ProfDavePhysics1\nMathematics Tutorials: http://bit.ly/ProfDaveMaths\nGeneral Chemistry Tutorials: http://bit.ly/ProfDaveGenChem\nOrganic Chemistry Tutorials: http://bit.ly/ProfDaveOrgChem\nBiochemistry Tutorials: http://bit.ly/ProfDaveBiochem\nBiology Tutorials: http://bit.ly/ProfDaveBio\n\nEMAIL► ProfessorDaveExplains@gmail.com\nPATREON► http://patreon.com/ProfessorDaveExplains\n\nCheck out \"Is This Wi-Fi Organic?\", my book on disarming pseudoscience!\nAmazon: https://amzn.to/2HtNpVH\nBookshop: https://bit.ly/39cKADM\n\rBarnes and Noble: https://bit.ly/3pUjmrn \nBook Depository: http://bit.ly/3aOVDlT",
        "transcript": "Professor Dave again, let's take a look at the Schrodinger equation. Through the work of Planck and Einstein we were forced to accept that energy is quantized, and that light exhibits wave particle duality. Then, de Broglie extended this duality to include matter as well, meaning that all matter has a wavelength, from a tiny electron, to your whole body, to a massive star. However, an object's wavelength is inversely proportional to its mass, so objects bigger than a molecule have a wavelength that is so tiny that it is completely negligible. But an electron is incredibly small, so small that its wavelength is indeed relevant, being around the size of an atom, so we must view electrons as both particles and waves from now on. Therefore, we must discuss the wave nature of the electron. So what kind of wave might this be? We can regard an electron in an atom as a standing wave, just like the kind we learned about in classical physics, except that rather than something like a plucked guitar string, an electron is a circular standing wave surrounding the nucleus. If we understand this, it becomes immediately apparent why quantization of energy applies to the electron, because any circular standing wave must have an integer number of wavelengths in order to exist. Given that an increasing number of wavelengths means more energy carried by the wave, we can see the Bohr model for the hydrogen atom begin to emerge as we imagine a standing wave with one wavelength, and then two, and then three and so forth. This is the reason that an electron in an atom can only inhabit a discrete set of energy levels, the circular standing wave that represents the electron can only have an integer number of wavelengths. When an electron is struck by a photon of a particular energy, this energy is absorbed, promoting the electron to a higher energy state and increasing the number of wavelengths contained within the standing wave. This is why the electron goes to inhabit a higher energy level, and this is what is fundamentally occurring during electron excitation. Furthermore, it is the constructive interference of these standing waves that explains how orbital overlap results in covalent bonding, so we can enjoy a little more clarity in our understanding of chemistry thanks to modern physics. Once it was realized that electrons exhibit wave behavior, the physics community set out to find a mathematical model that could describe this behavior. Erwin Schrodinger achieved this goal in 1925 when he developed his Schrodinger equation, which incorporated the de Broglie relation. This is a differential equation which utilizes concepts in mathematics that are beyond the scope of this series, but we can certainly discuss the conceptual implications of the equation. Essentially, just as F = ma applies to Newtonian systems, the Schrodinger equation applies to quantum systems, by describing the system's three-dimensional wave function represented by the Greek letter, psi. In this equation, this term is called the Hamiltonian operator, which is a set of mathematical operations that describes all the interactions that are affecting the state of the system, which can be interpreted as the total energy of a particle. But while the Schrodinger equation can calculate the wave function of a system, it does not specifically reveal what the wave function is. Max Born proposed that we interpret the wave function as a probability amplitude, where the square of the magnitude of the wave function describes the probability of an electron existing in a particular location. Looking back at the double slit experiment, we understand the diffraction pattern as illustrating this wave of probability. The pattern is not the electron itself, it is the probability that an electron will arrive at each location on the screen. We can't predict where one electron will go, only the probability that it will arrive at a particular location. If many electrons arrive at the screen, it becomes apparent how their distribution obeys the wave function. So the Schrodinger equation does compute the wave function deterministically, but what the wave function tells us is probabilistic in nature. This idea that nature is probabilistic on the most fundamental level was a lot for the scientific community to handle at the time, and still is for some. So just the way sound waves are mechanical waves, and light waves are oscillations in an electromagnetic field, an electron can be considered a cloud of probability density. There are many such interpretations of quantum mechanics which involve different ways of viewing the relationship between the wave function, experimental results, and the nature of reality, and there is still no firm consensus as to which view is correct, be it the Copenhagen interpretation, many-worlds interpretation, or a number of others. But before you choose a camp, let's keep moving through the development of quantum mechanics, which means we will need to consult Werner Heisenberg. Thanks for watching, guys. Subscribe to my channel for more tutorials, support me on patreon so I can keep making content, and as always feel free to email me:"
    }
}