{
    "pGOyw_M1mNE": {
        "title": "ChatGPT in Python for Beginners - Build A Chatbot",
        "thumbnail": "https://i.ytimg.com/vi/pGOyw_M1mNE/hqdefault.jpg",
        "author": "The AI Advantage",
        "date_of_release": "2023-03-07T19:49:35Z",
        "duration": "PT14M25S",
        "view_count": "400465",
        "like_count": "12131",
        "comment_count": "839",
        "description": "Want to add voice input and run this on your phone? Part 2: https://youtu.be/e9pCg_QSezU\nTo make the bot speak? Part 3: https://youtu.be/RopQwkZND8g\n\nIn this video, I'll teach you how to create your very own ChatGPT chatbot from scratch, even if you're a beginner. I'll demonstrate three different versions of the chatbot, starting with the simplest one. All you need to follow along are Visual Studio Code, Python, and an OpenAI account with a secret key. Then, I'll show you how to build a ChatGPT-powered chatbot that can remember previous conversations and even how to test it out. In the final part of the video, I'll introduce a new tool that allows you to set up your chatbot in a browser and share it with others.  If you would like to see more videos like this, leave me a comment below! \n\n\n\nLinks:\nVS Code IDE: https://code.visualstudio.com/Download\nAPI Keys: https://platform.openai.com/account/api-keys\nFolder With Code: https://drive.google.com/drive/folders/1NAUg2wUFWywJezpEh8OrCfOEoRWYwC0e?usp=sharing\nGithub With Code: https://github.com/Turbogany/chatgpt-api-youtube\n\n---------------------------------------------------------------------------------\n\nChapters:\n0:00 Step By Step\n0:38 Basics\n07:01 Next Level\n10:11 Customize \n\n#chatgptapi #chatgpt #ai \n\n---------------------------------------------------------------------------------\n\n🔑 Get My Free ChatGPT Templates: https://myaiadvantage.com/newsletter\n🎓 Join the AI Advantage Course + Community: https://myaiadvantage.com/community\n🤯 Unlock ChatGPT's true potential: https://shop.myaiadvantage.com/products/business-blueprint\n🐦 Twitter: https://twitter.com/TheAIAdvantage\n📸 Instagram: https://www.instagram.com/ai.advantage/\n🛒 AI Advantage Shop: https://shop.myaiadvantage.com/\n\n---------------------------------------------------------------------------------\n \nMy Video Equipment:\n📷 Camera: https://amzn.to/3AZVjyk\n🔍 Lens: https://amzn.to/3nzBdYt\n🎤 Mic: https://amzn.to/41px8Eh\n🔊 Audio Mixer: https://amzn.to/42aQBtt\n💡 Light: https://amzn.to/420Xcqd",
        "transcript": "Today, we'll be building a custom ChatGPT\nchatbot that is extremely easy to make. And not just that, we'll actually make three\nversions. One extremely simple one accessible even to\npeople that have never touched code before. A second one which allows you to customize\nit and then go back and forth and talk to it. And then finally, I'll show you how to make\na custom ChatGPT-powered chatbot that you can send to your friend because we're gonna\nhost this on the web. And all of this is gonna be as beginner-friendly\nas possible. So if you've never touched code before but\nreally wanted to try this out, this is the video for you. Alright, let's start by making the simplest\nChat GPT powered application you can build. And to start out, you'll need three things. First of all, you need an IDE which is an\napp that allows you to code. We'll be using Visual Studio Code here because\nit's free, one of the most popular ones, and it's what I use. It's just a simple download and installation\non both Windows and Mac, with many tutorials out there on how to do it. Once you install it, it's gonna look something\nlike this, and you can head on over to extensions. And this is the second thing you need. You're going to need to install Python on\nyour machine. So we're going to look for Python, and then\nhere we're just gonna click install. That is going to install the newest version\nof Python on your machine, and we're almost ready to do this. And the last thing you'll need to prepare\nis the secret key from OpenAI. You can simply get that by creating an OpenAI\naccount, which I showed you how to do in this two-minute video. It's the same account you used to log into\nChatGPT, and by going to this URL, we can simply click plus. And for the sake of the video, we'll be creating\nthis API key. Super briefly an API is just a simple way\nfor two applications to interact. Essentially, it's going to allow us to plug\nthe Chat GPT language model into our app with this key. So let's copy it and head on over to VS Code. Okay, actually, there's one more step, and\nthat is that you'll need to download the folder that I provide for you to follow along for\nthis video. You can find a link to get this in the description\nbelow. And for anybody who's a little more familiar\nwith all this, you can go to my brand new GitHub account that we'll be using for this\nchannel and get it from there. But for beginners, the easiest way is just\nto download this folder. And then all you're gonna do is drag and drop\nthis folder onto the icon of VS Code. Okay, and right away, it should open up \"01_chat_GPT_simple,\"\nand this is going to be our first application. And as the name implies, it's going to be\nextremely simple. First things first, inside of the parentheses\nright here, you will want to post your API key. Nice! And let me just note here, there's a lot of\ndifferent ways of doing some of the things I'll be showing you in this video. But as this is a beginner tutorial, the focus\nhere is on simplicity. And that's it. This is the whole application. So let me explain, but essentially, this is\ngoing to allow you to go in and prompt ChatGPT to write an essay about penguins. One of our favorite prompts on this channel\nbecause those little guys are really good at adapting to change, as are most of us being\nearly adopters of AI technology. Alright, so let's talk about this in non-coder terms, okay? There are three parts to this, as you can\nsee. The first one is really simple to understand. Alright, OpenAI, the company behind ChatGPT,\ncreated a so-called package that allows us to really easily implement all this, okay? As you can see, if I remove these empty lines,\nit's four lines of code. Couldn't get any simpler. And that's because we imported the OpenAI\npackage. This is what that looks like in Python: \"import\nOpenAI\". A package is a bunch of complicated tricks\nthat do a lot, compressed into two words, \"import OpenAI\". And with this package, we teach Python how\nto link to our OpenAI account by using the API key, as discussed before. So, that's the second part. By saying \"OpenAI.api_key =\", and then, if\nyou put something into parentheses in Python, you tell the program this is a string. That's programming lingo for a word with all\nkinds of different signs in it. If it was just whole numbers, we could call\nthis integer, but again, this is not going to be a programming tutorial. Just follow what we're doing here. And now that we've activated all the things\nthat OpenAI can do for us here, and we've linked our OpenAI account to this little script\nwe're dealing with here, next up, we're going to actually ask ChatGPT something. And if you're a beginner, you don't really\nhave to understand what's going on here. Just know, we're calling the GPT-3.5 Turbo,\nwhich is the brand new ChatGPT model that is 10 times cheaper, that was released last\nweek. And we're sending a message as a user that\nsays, \"Write an essay about penguins\". And again, you don't need to know these things\nby heart, neither do you need to understand them to get started. But if you want to, OpenAI provides a so-called\ndocumentation, which is essentially an encyclopedia that explains all these things. Because, trust me, if I tell you're not a\nsingle person has been born with the ability to implement OpenAI APIs. And even the most advanced coders that have\nnever dealt with this before. We will go into here and read up on how it's\ndone. And I would recommend you do the same. This is exactly where you get a better understanding\nof what's going on. Again, link below. But now, let's complete this app, and let's\ntry and run this. But before I do that, we need to address one\nmore thing in here, which is this print command. And if you start learning coding, the first\nthing they will always teach you is a print command. Every language has this, and it's essentially\njust a way to display some text in the terminal, which we'll be entering this very second. I could do two things: I could press the play\nbutton here, run Python file, or I could go up to terminal, new terminal, and the terminal\nopens up for us. And before we run this, there's one last step\nto completing your first app in ChatGPT, and that is actually installing this package. And the way you do this is by saying 'pip\ninstall open AI', because obviously not every machine comes with OpenAI plugins pre-installed. You have to do it first, and that's usually\nthe case with all the things that we import up here. Luckily, you only have to do this once, and\nevery time you run a new app that uses the OpenAI package, it will be able to install\nthe app. So because I already have this, it says 'requirement\nalready satisfied', and I can move forward. Alternatively, if you run into problems, simply\nput, you can also do 'pip free install open AI'. And I have that one tool. And now, for real, we're actually set up. Everything is ready to go. I'll just delete everything in the terminal\nby pressing Command+K just to make this look nicer. And now we can do this and ask ChatGPT to\nwrite an essay about penguins by pressing play. As per usual with ChatGPT, it takes a few\nseconds. And there you go, we did it! Penguins are considered as one of the most\nfascinating creatures on the planet, yada yada yada, it worked! So, what happened here is we connected the\nscript to our OpenAI account. Then we asked the GPT 3.5 Turbo model to give\nus a reply to the prompt, 'Write an essay about penguins'. And by including this line that prints the\nresponse from the GPT 3.5 Turbo model, it was actually shown in the terminal. Now, what you could do next is change the\nprompt to, let's say, 'Give me free ideas for apps I could build with OpenAI APIs'. And again, if I press play, this is almost\nidentical to using ChatGPT in the browser. Number one, personalized health assistant. Number two, personal finance assistant. Number three, personalized education platform. With some explanations. And now, you could keep using this just like\nChatGPT. But at this point, you might be asking yourself,\n\"Hey Igor, what's the point of this? Why use Python inside of VS code and bother\nwith the API key and change it in here instead of the browser?\" And that's a fair question, but there's two\nthings you must consider. First of all, this is 10 times cheaper than\nusing the playground and way cheaper than paying 20 bucks a month for ChatGPT. If you only use this a few times a week. Simple answers are gonna cost you a fraction\nof a cent here. And also, now you understand how to go further\nwith this, and that's all what number two is about, alright? The second app we'll be looking at here is\nbuilt by Greg Baugues (I hope I'm pronouncing that correctly, Baugues, I think it's French). Either way, he wrote this extremely user-friendly\nblog post that shows you how to build that ChatGPT powered chatbot, where you can actually\ngo back and forth and it remembers your answer, as opposed to what we just built, which is\none prompt in, one answer out, in just 16 lines of code (actually 14 if you remove the\ntwo spaces). This goes a little deeper and explaining all\nthis is a little beyond the scope of this tutorial. But if you read through this blog post and\nyou carefully consult the documentation from OpenAI here, I'm confident that you'll be\nable to figure all this out if you have some Python basics. And again, all we need to do here is copy\nover our API key. Now, all we have to do is press play, and\nit's gonna ask us a question, because that's what this is set up to do. \"What type of chatbot would you like to create?\" And we get to type in the terminal here. So we're just gonna say \"A sassy and tired\npersonal assistant\" and hit enter. It replies with \"Your new assistant is ready.\" Alright, now we can prompt this custom sassy\nand tired personal assistant ChatGPT to do anything that ChatGPT could do. Let's just say, \"How can I start learning\nPython today?\" and enter. And instead of giving us a classic helpful\nand neutral step-by-step tutorial, we'll get: \"Well, darling, it's great to hear that you're\ninterested in learning Python! Here are a few ways to get started.\" For all the Python intermediate people, a\nquick explanation on what's going on here would look something like this:\nWe import the OpenAI package and then link our account and get access by inserting our\ncustom API key. We create a list that is called \"messages\",\nand this is what the API wants to receive - you always need to send it a list as specified\nin the documentation. Then, we're going to set up a system message\nvariable that takes our input, and then we're going to take the user's answer to this and\nappend it to the \"messages\" variable in exactly the format that OpenAI is asking for. A simple print statement tells the user that\nthe new assistant is ready, and to round everything out, we're going to run one while loop that\nruns until we tell it to quit (). All the magic here happens inside the while loop. We take a new input for the user's message,\nobviously, and again we append that to the \"messages\" list. Then, we start talking to the Chat GPT 3.5\nTurbo API, and as mentioned before, we feed it the \"messages\" variable with the list that\nhas been expanded with both the first inputs that happened previously and the new input\nthat happened just now. Then, we create a brand new variable that\nsaves the response that we just got back from the OpenAI API. This part is just copy-pasted from the documentation\n- it's essentially just the answer to the prompt that Chat GPT is giving you. Finally, we append the reply that we just\ngot from ChatGPT to the list, so once the conversation continues, it remembers what\nwe just talked about. In the very last step, we just print the reply,\nso the user knows what ChatGPT just replied. And now, it looks back, and we get to enter\nanother input. This way, the conversation keeps going, and\nit always remembers the history because the list that we feed to the Chat GPT API gets\nlonger and longer with every single time we type a prompt into the terminal. Alright, so I hope that made sense! If not, you can always go into ChatGPT and\nask about some of the things that I talked about one by one. Right, and Chat GPT will explain. So for example, you could say \"How to ask\nfor an input in Python\" It would show and explain the exact line that we used in here. Alright, so that's it. But now let's move on to App Number Three,\nwhich is the one I'm most excited about. So, as promised, with this, you're gonna be\nable to set up your own ChatGPT-powered chatbot inside of a browser and even share it with\na friend, all in this super simple script. So, first things first, there's a new package\nhere. Okay, up until now, we used OpenAI, but here\nwe're using Gradio. So, what you want to do is either pip install\nGradio because I already have it, it says requirement already satisfied, or you pip\nfree install Gradio. Enter. With command K, I clear all this and let's\nget right into it. First of all, again, I'll need my API key. So, I'll just go ahead and copy-paste that\ninto this part where it says API key, as we did before. Alright, and here we have the first messages\nvariable, and this is where you customize your chatbot, okay? So here it says, \"You are a psychologist,\"\nso let's just go with this to begin with. And that means this is going to be a custom\nChatGPT language model that is a psychologist. Next up, we're going to be defining a function\nand explaining what a function is to a beginner goes beyond the scope of this tutorial. But again, you can always just go into ChatGPT\nand ask, \"What is a function in Python?\" as with any other part of this code, and it\nwill help you out. And inside of the function, we're again going\nto be consulting the ChatGPT API, and it's going to use the user inputs that this function\nis based upon to generate a prompt reply, which it will feed back into Gradio. And down here, we have the simplest Gradio\nimplementation. Now all of the things I just said don't have\nto make sense to you. Just copy-paste the script, install the OpenAI\nand Gradio package. So, let's just hit play here and see what\nhappens. As I warned you, this is extremely simple. All you have to do is copy this link HTTP\nand then this IP address. And now what we get to do is open up a web\nbrowser and paste this. Voila! That is your custom web-based ChatGPT language\nmodel that we just made it happen in seconds, alright? And as we set this thing up to be a psychologist,\nwe get to ask it, let's just say, \"How do I deal with tiredness?\" and press submit. Here's some tips to help with tiredness: get\nenough sleep, practice good sleep hygiene, exercise regularly, etc. And the cool thing about this is, if I go\nahead and say, \"Now write me a tweet about your qualifications and my problems,\" you'll\nimmediately see that it remembers our entire conversation. As a qualified psychologist, I can help you\ntackle issues related to mental health and well-being, including dealing with tiredness,\netc. Isn't that just great? So, I think this is really exciting because\nthis is extremely convenient, and you could immediately show this off to anyone you know. And the way you do that is by going into the\nbrackets in between \"launch\" and saying \"share=True\" with a capital \"T\". Another thing you could customize here is\n\"title=Your Title\". So, if we change the text inside the parenthesis\nto \"Digital Psychologist\", we can save this and press play again. Aha, there's a little issue. The thing with this is, every time I want\nto update it, we would need to include another part of the code which makes it a little more\ncomplicated. The easiest way is just quitting the app every\ntime we update something and opening it back up. And now, if I press play, it provides me with\nthe local URL as before, but also with one that ends with .gradio.live. And if I copy this one and I head on over\nto my phone, right, which I will disconnect from my local network. And I'll just paste this, you'll see you will\nget the brand new Digital Psychologist app right on our phone. Incredible, right? And now, it's infinitely customizable because\nif you go up here and change \"Your app psychologist\" to, let's say, \"You are a financial expert\nthat specializes in real estate investment and negotiation\", and I'll change the title\nto \"Real Estate Pro\", we just built a ChatGPT web app in no time. Okay, but what if you run into problems somewhere\nalong the way? Well, as I said, you can always consult ChatGPT. Just be aware it has not yet been updated\nto the new ChatGPT 3.5 Turbo API, alright? So every time you consult it on how to implement\nthe API, it's going to be talking to you about the old DaVinci GPT API, which is still great,\nand some people argue that it's better for certain use cases, but it's 10 times more\nexpensive. So, at the end of the day, your most reliable\nsource of truth is always going to be the OpenAI documentation. So, we did it, and now I really want to hear\nfrom you guys. Do you want more coding tutorials like this? If so, leave a comment below, and I'll start\nmaking more guides and live streams like this one. Alright, so if you enjoyed this, check out\nthis video, which will take you even further along on the journey of doing even more with\nChatGPT."
    }
}