{
    "PVBoWhUObKw": {
        "title": "Peripheral Neuropathy Treatment [Leg & Foot Nerve Pain HOME REMEDIES]",
        "thumbnail": "https://i.ytimg.com/vi/PVBoWhUObKw/hqdefault.jpg",
        "author": "Michigan Foot Doctors",
        "date_of_release": "2021-02-06T16:12:48Z",
        "duration": "PT16M24S",
        "view_count": "5018844",
        "like_count": "90806",
        "comment_count": "2927",
        "description": "🦶Do you have Peripheral Neuropathy Foot Pain or Peripheral Neuropathy Leg Pain? Get the BEST Peripheral Neuropathy Pain Relief!🦶\n\nWe go over the best Peripheral Neuropathy Treatment & Peripheral Neuropathy Home Remedies for your foot nerve pain, your leg nerve pain, and your ankle nerve pain. So start getting neuropathy treatment & neuropathy relief in your feet!\n\nBest Recommended Supplement Products in Video:\nhttps://www.michiganfootdoctors.com/supplements-for-neuropathy/\n\n\n\n👉-- Shoes --👈\nBest Shoes for Neuropathy:\nhttps://www.michiganfootdoctors.com/podiatrist-recommended-shoes/\n\nOur Recommended Products: https://www.michiganfootdoctors.com/recommended-products/\n\n👉-- LINKS --👈\n(With some links, we use affiliate links and may earn a commission. Check with your doctor prior to using any product!)\n\nPeripheral Neuropathy Treatment - Orthotics:\nBest Overall Orthotic: https://geni.us/PowerStepOrthotics (Amazon)\nBest Heavy Duty Orthotic: https://geni.us/HeavyDutyOrthotics (Amazon)\nBest Women’s Orthotic: https://geni.us/BestWomensOrthotic  (Amazon)\nBest Affordable 3/4 Orthotic: https://geni.us/ShortLengthOrthotics (Amazon)\nBest sub $25 Soft Orthotic:  https://geni.us/BudgetSoftOrthotic (Amazon)\nBest sub $25 Budget Orthotic: https://geni.us/BudgetOrthotic (Amazon)\n\nPeripheral Neuropathy Massage & Peripheral Neuropathy Pain Relief: \nBest Compression Sleeves: https://geni.us/PlantarFasciitisSock (Amazon)\nBest Affordable Cold Therapy Wrap: https://geni.us/FootIceSock (Amazon)\nFull Length Compression Socks: https://geni.us/CompressionSock (Amazon)\nBest Foot Massage Roller: https://geni.us/FasciitisMassage (Amazon)\nBest Budget Compression Ankle Brace: https://geni.us/AnkleCompression  (Amazon)\nBest Muscle Massage Stick: https://geni.us/MuscleStick (Amazon)\n\nPeripheral Neuropathy Exercises & Stretches:\nBest Ankle Stretch Incline Board: https://geni.us/z7bq (Amazon)\nBest Budget Stretching Device: https://geni.us/BudgetFasciitisStretch (Amazon)\nGood Ankle & Calf Stretching Device: https://geni.us/AnkleStretchingBoard (Amazon)\nBest Hamstring & Knee Stretch Device: https://geni.us/BestHamstringStretch (Amazon)\nGood Soft Stretch Splint: https://geni.us/SoftStretchSplint (Amazon)\n\nPlantar Fasciitis Stretching & Exercises:\nBest Ankle Stretch Incline Board: https://geni.us/z7bq (Amazon)\nBest Budget Stretching Device: https://geni.us/BudgetFasciitisStretch (Amazon)\nGood Ankle & Calf Stretching Device: https://geni.us/AnkleStretchingBoard (Amazon)\nGood Soft Stretch Splint: https://geni.us/SoftStretchSplint (Amazon)\nGood Hard Stretch Splint https://geni.us/HardNightSplint (Amazon)\nBest Muscle Foam Roller: https://geni.us/BestFoamRoller (Amazon)\n\n\n📢Disclaimer:📢 This video and description contain affiliate links, which means that if you click on one of the product links, we may receive a commission.  We will specifically indicate if we have received any sponsorship.\n\nThis is opinion only:\nFor the viewer or reader: Do not consider this video as a substitute for professional medical advice, diagnosis or treatment.  We strongly urge you to contact your own physician with any questions you may have regarding your medical condition.  If you are having an emergency, call 911 immediately or see your physician.  Do not allow this information to let you disregard your professionals medical advice or delay seeking based on information from this content.  Do not rely on information provided by this general education video.\n\nHealthcare practitioners: The content here is for education purposes only.  The authors have done their best to provide the most up to date evidence-based information, but this content should definitely not be considered any type of medical standard. It does not reflect individual practices in other geographic areas.\n\nThis is strictly for medical education purposes only, it is not intended for diagnosis or treatment. The information in these videos is the opinion of the author only and is not an official opinion of any organizations that the authors may be a part of. The authors or speakers are not associated with any of the above products.\n\nChapters:\n0:00 Peripheral Neuropathy Treatment\n0:43 Peripheral Neuropathy Causes\n2:00 Peripheral Neuropathy Scams\n2:45 Peripheral Neuropathy Symptoms\n3:00 Foot Nerve Pain & Leg Nerve Pain\n3:30 Peripheral Neuropathy Night Pain\n3:45 Peripheral Neuropathy Muscle Pain\n4:40 Peripheral Neuropathy Massage\n5:40 Peripheral Neuropathy Stretches\n6:20 Peripheral Neuropathy Home Remedies\n8:00 Peripheral Neuropathy Orthotics\n8:39 Peripheral Neuropathy Cure\n9:53 Peripheral Neuropathy Creams & Peripheral Neuropathy Oils\n10:20 Peripheral Neuropathy Lidocaine Cream\n10:32 Peripheral Neuropathy Medication Treatment Effective\n11:05 Peripheral Neuropathy Shoes\n12:30 Peripheral Neuropathy Diagnosis & Peripheral Neuropathy Podiatrist Treatment\n13:33 Peripheral Neuropathy Home Treatment\n14:00 Peripheral Neuropathy Home Exercises\n14:44 Peripheral Neuropathy Rehabilitation & Products",
        "transcript": "(percussive music) - Peripheral neuropathy relief\nin the foot and the ankle. This is one of the most\ncommon problems that we see. And there's a lot of\nmisconceptions up there. There's 600 articles written\nevery year that I can find when you type in peripheral neuropathy. There's a lot of misconceptions. What's real, what's a\nfraud, what can help, and how do you get real,\nmeaningful results? We're gonna focus on that in this video and we're starting right now. (breezy music) Guys, thank you so much\nfor watching this video. We appreciate your likes, your\nsubscribes, your comments. We really love hearing\nif this stuff helps. It really makes a big difference for us. So thank you. There are hundreds of different\ncauses of nerve damage. This is most commonly called\nperipheral neuropathy. The most common causes are\npotentially diabetes, aging, thyroid disorders,\ndrinking alcohol, smoking, aging, chemotherapy, taking\nmedications for too long, putting too much pressure on your feet, wearing the wrong types of shoes, being too active on your feet. I could keep going on and on. But if you Google and look up peripheral neuropathy\npain or nerve damage, what this usually affects is the smaller, fine-touch sensation nerves. And what happens generally is as you're walking during the day you don't notice how sore you're getting. And when you lay there at night, your legs swell and get sore. And your nerves throb. Obviously since there's\nso many different causes, this can present in different ways, but a lot of simple, easy treatments can make a big difference. Now, there's two different concepts. So one is treating it\nand another is curing it. A lot of times, as we get older, trying to cure nerve\npain may be impossible for a lot of people. This is trying to reverse aging. So for example, if you\nhave wrinkles on your skin, you're not going to look like a baby again by buying a cream. I wanna make that very clear to you. There's a lot of scam\nartists out there online selling pills and creams, promising stuff. But with the little asterisk at the bottom they say it doesn't actually work. And studies show that a lot of this stuff will not reverse and cure it. A lot of these things are treatments that make you feel better. Because at the end of the day, we can't reverse the aging process. And when our skin, when our nerves age, there will be some deterioration. But you can make it\nbetter than it was before even if you don't cure it all the way. At the same time, and there's poor agreement,\neven among doctors, even among scientists, nobody even agrees on what exactly defines these types of diseases. Most of the time, here's\nhow I see symptoms present, numbness, burning,\ntingling, radiation pain. These are nerve pain. Sharp, shooting, zapping pain. So you can see all these little nerves, they zap up your ankle or\nthey come up your ankle, up the sides. You can see on top of the foot right there how many nerves I have there. What usually happens is, in\nmost people, in your toes, your toes are the farthest\npart from your brain. So the farther you get, the more highway there is\nfrom your brain to your toes. So the more percentage\nchance there is of damage. For example, you're less likely to have\nnerve pain around your face or your neck. But in your fingertips and your toes, you're more likely to because\nthose nerves are longer and they get thinner as they go, and they're less protected and\nmore likely to get damaged. Here's two good rules. If it's at nighttime or you're getting sore\nwhile you're resting, like sitting on the couch, that's more likely to have some\nnerve pain component to it. If the pain is worse when\nyou get up in the morning, that's more likely to\nbe biomechanical pain. And nerve disease, if\nyou're just sitting there, can cause nerve pain. But, for example, if I\npunched you in the shoulder, that's technically nerve damage because I punched you in\nthe nerves in your shoulder, and it's gonna ache while\nyou're sitting on the couch. Keep that concept in mind. Biomechanical pain, like\nsomeone punching you, can create nerve-like symptoms because that hurts your nerves. And most of the time I\nsee people have been hurt and that's what causes their nerve pain. They're always sore. Their hips, their backs,\ntheir hamstrings, their knees, and their feet are always sore. So they always have nerve pain. So it's not true nerve pain,\nit's biomechanical nerve pain. Nerve pain itself, like in nerve diseases, if you're not sore ever anywhere and you're just having\nsharp, shooting, zapping pain in like only one nerve. If it's in both feet equally, that's more likely to be a nerve pain. If it's one foot worse than the other, that's more likely to be biomechanical. Massage and icing can really help. So let's start with that. Massaging is best performed\nwith either a cold can or non-cold devices. Sometimes with peripheral neuropathy, cold stuff can irritate your nerves. If it's true peripheral\nneuropathy, the cold may be bad. But if it's musculoskeletal,\nicing a bottle, and I'd be careful using a can, a plastic bottle might be better so it doesn't explode in your fridge. But just roll it for like 10 to 15 minutes on the bottom of your arch. There is some fancy ice\nball devices out there. You can use 'em on the\nbottom of your foot, but the problem is they\ndon't really stick around. So thumbs down on that one. Realistically, use a ice bottle. But if it's in your legs,\nin your calf muscles, that can work great. These rubber balls, they're like a dollar. They really come with other stuff. You can get these for dirt cheap prices. It doesn't have to be anything expensive. But sitting there or even\nstanding on this thing, it can really work out your arch if it's your plantar fascia. And there's harder ones,\nthere's softer ones, I'm using a harder one right here, that can really stretch out and get rid of a lot of that swelling right there. Once you massage, I always\nrecommend massaging first. Look at that. It gives me much more flexibility right after I massage my hamstrings and my calf muscles already. But then you stretch. So realistically, if you\ncan't reach your toes, start with a towel. Just bend up that hamstring,\nbend up that calf muscle, get that pulled up, get it in good shape, get that foot feeling really good. And that does a great job. So you can do your right foot and then you can do your left foot. But getting that fluid out of there, getting that stiffness out of there, especially before you go to bed or when you wake up in the morning, this will really pay dividends in terms of getting that\nswelling and eventual nerve pain down the rest of the day. One thing I like is Biofreeze right here. Biofreeze right here is\na topical applicator. So for example, you can take\nit and rub it onto your toes. This kind of short circuits your nerves. So when you put this on\nthe nerves, it feels hot, like icy hot. And then the nerve pressure goes down. This is good for nighttime use. Put this on your sore areas. Biofreeze is kind of like capsaicin. It can almost burn your nerve pain away. So it makes it very sensitive. And then the pain gradually goes away. So that can feel a little bit better. Nerve injections. Sometimes if it's one nerve, this could be scar tissue or an injured or constricted nerve, I will take an injection. I'll inject that nerve and\nsee if the pain goes away. Sometimes this is a way\nyour podiatrist can tell if you actually have nerve pain or not, and where it's really coming from. So what I like to do is if it's a nerve injury to just one site, I can block the nerve and see\nif that nerve pain goes away. That's how you can tell\nif it's muscle or nerve. So work with your podiatrist\nto figure that out. Walk it off. If you're in bed at night\nand your legs swell up, sometimes getting up and moving around can lower your swelling. This is where having your\nfeet elevated can help. This is where compression\nstockings can help. The less swelling you have on your legs, the less likely your nerves\nare to be stretched and throb. So same kind of thing. If I punched you in the arm, your arm would swell and that\nwould stretch your nerves. Keep that in mind. Technically, walking can\nflush some of that fluid out of there. Is that nerve pain or is\nit musculoskeletal pain? It's both. Take care of your feet. So as an example, check this out. Inside the orthotic look\nat how stable the foot is. But watch this. Look at how much it stretches out. With the orthotic, look\nat how stable this is. None of the nerves are being stretched. The foot can move. But watch this. When I stand like this, look\nat how the foot flattens out. That stretches all the\nnerves through the arch, through the inside of the ankle. So watch this. Stable, nice and stable. Stretches out. That leads to a lot of\nnerve pain at night. Think of the nerve kinda like a cord. If I pull the cord and twist it, that's gonna ache later. And nerve can get bruised just\nlike muscle can get bruised. Skip alcohol drinking. A lot of the times alcohol\ndrinking can cause nerve pain later at night. If you have a lot of nerve pain, stop drinking alcohol for a little while and see if you get better. Control your health issues. If you have diabetes, thyroid disorder, go see your primary care doctor. This always goes without saying. But the single biggest cure is getting your blood sugar down, getting your weight down and\nyour nerve pain gets better. I see this all the time. Get your sugars down,\nget your weight down. Is it easy? It's not an easy fix, but it's a real fix that keeps it away. And realistically, you know,\nget as healthy as possible. This will really lengthen your lifespan and raise your quality of life. I know it's almost like\na cop-out to say that, but come on, you know it's true. And maybe this is the wake-up call. We'll help you lose some\nweight and get in better shape. Stop smoking. A lot of the times lack of blood flow will cause aching nerves. So if you're smoking, this goes for any type\nof smoking or vaping, stopping that stuff can\nmake a big difference. Get enough sleep. Sometimes seven to nine\nhours is what's required. Studies really show getting enough sleep can make your nerves\nfunction a little bit better, there's better chemical\nbalance in your nerve endings, and there's less nerve pain. Creams and oils. So this really means a lot. Simply having an oil or\nmoisturizing your skin can make a big difference. I really like thick creams for the foot, lavender oil, different oils. There's actually studies showing this stuff can lessen nerve pain. Like aloe vera, that kind of stuff. This can help. Try different oils and see if that helps. Especially moisturizing cream. So like Aquaphor or Gold Bond, basic stuff like this really helps. Topical lidocaine. If you're in a ton of pain, sometimes putting some numbing\ncream can help obviously. But this is a more expensive and more medically driven answer. Anti-inflammatories: do these help? They do help, but it's\nnot a long-term solution. That's really a challenge\nas these can be dangerous and really hurt your\nkidneys and liver long-term. Lyrica and gabapentin. These are nerve depressing medications. This is something you should\ntalk about with your doctor, but this is kind of the\nend-stage treatment. If you really do have nerve pain and none of these things are helping, sometimes being on these\nmedications can help. And for a lot of our older patients that are simply too far gone\nto fix their health conditions, this is the answer. But don't make this your\nfirst-line treatment. Talk with your doctor\nregarding this treatment. On the note of orthotics,\ncheck this out right here. I have a slipper right here\nwith an orthotic in it. So this has a built-in arch. And what happens is, when\nyou put these in here, it keeps the arch from flattening out. Whereas without the arch\nlook at how it flattens out. So same kind of thing. Check this out. A sandal with an arch\nsupport built into it. So you can see how much\nof an arch is built there. So same kind of thing. If you don't have anything, even wearing a pair of Crocs\nright here will help you. The more support you have\nduring the day, even in home, the less your nerves get\nstretched out during the day. My number one tip is wear good\nsupportive slippers at home. Good supportive sandals if\nyou're outside in warm areas. Good supportive shoes with an orthotic. So as an example, check out the shoe. I can't bend it in the middle,\nit's stiff in the back. I have soft mesh in the front so your toes aren't getting squished, and an orthotic. So the orthotic right\nhere prevents your foot from flattening out. So you can see right here,\nit stops the flattening out, and your foot can instantly\nstart doing better. This stops those nerves from\ngetting stretched out all day, and you do better when\nyou're in bed at night, I'm telling you, this stuff\nworks for almost everybody. Even people with extensive nerve damage. Stretching and exercise. Always getting in better\nshape will get you better. This is because your\nmuscles work less hard, there's less stiffness and less swelling. Always get checked out by your podiatrist. So nerve damage is very confusing, but you can get tests to see\nif you have a nerve blockage. You can get your skin biopsied to see if your nerve endings are dying. You could see a neurologist, but after seeing your podiatrist\nif it's your foot problem, and they can really help you with prescription\nmedications or diagnosis. I would say about 90% of the time when people think they have\nnerve damage or a nerve issue, it's not a nerve issue. I'm gonna be very clear with that. It's usually not a nerve issue, unless you're significantly diagnosed. And even sometimes people\ndiagnosed with the nerve issue, maybe there's a deeper cause\nthat can be investigated. So x-rays, MRIs, biopsies, nerve conduction velocity testing. Your podiatrist can work\non all that with you and get the right diagnosis. Be sure, because it's\ntoo easy to just say, \"Hey, I'm aching, I have nerve damage.\" I find, and this is my unscientific claim, like 90% of the time it's not\nwhen patients tell me it is. There's usually a more clear cause that's easily correctable. The key is warm up when you wake up. Do some ankle circles. So move your feet,\nstretch out those nerves. As you stretch out those tissues, you get that fluid out of there. So when you wake up in\nthe middle of the night, moving your feet around, walking, doing a little bit of stretching, this is my morning routine\nand nighttime routine that I would do if I had\nsome neuropathy pain. Just stretch out your calf,\nstretch out those muscles. As you mobilize that\nfluid inside your muscles, it gets flowing. It circles out of those compartments, and there's less stretching, like for example, on your plantar fascia. As you massage it, there's less soreness, less fluid, less swelling. Massage that out when you get up. Get that fluid out of there. I love using towels because it\ngives you that extra stretch without leaning into your toes. It makes it a little bit softer. Because especially people have soreness throughout their toes. And there's nerves, just like\ncarpal tunnel in your wrist, there's nerves that come down your ankle. This is called tarsal tunnel. What you also wanna do is\nsciatic nerve through your hip, through your thigh,\nthrough your groin area. You wanna stretch that out. Get your glutes, get your\nhamstrings stretched out. I love the stretch board because this is how you can\nmake measurable progress. Start on the basic setting,\nwhich is like 15 degrees. Move up to 20 degrees right there. And then after like a couple of weeks, you can work your way up\nto now 25, 30 degrees, and then like 35 degrees right there. And then eventually it goes up to like 45 degrees right here. And work your way up. Get that flexibility going. Get gradually more and more flexible. And gradually your muscles\nwill get less sore, less achy, and you'll develop less of\nthat soreness and swelling throughout your muscles. So there's these little half-moon devices. Realistically, if you do it barefoot, you're gonna be in some pain and it's gonna make your nerve pain worse. As I mentioned, get good shoes. Get good inserts that\nmakes your foot cushioned and it stretches out your\nhamstring, your calf muscle. When you get up in the middle\nof the night with nerve pain, you can stretch that out and\nget that blood flow mobilized. This thing's like 10 to 15 bucks. Realistically, I don't recommend it because you can do that\nentire big ankle slant board. That thing's a little\nbit better personally. So see this thing? The ankle slant board, that\nworks pretty good right there. And then work your way\nup to the higher levels. It gives you an even better stretch. I do that while I brush my teeth getting ready for bed at night. And that's it. Just get yourself a\nroutine where you focus on gettin' your muscles strengthened, gettin' your calf\nmuscles, your hamstrings. Usin' these different devices can help. Or you don't even need to pay. Guys, thank you so much\nfor watching our video on peroneal tendonitis. Give us a like, tell us\nhow you injured yours. It really helps in the YouTube algorithm. We need your help."
    }
}