{
    "QeUMFo8sODk": {
        "title": "What is The Schrödinger Equation, Exactly?",
        "thumbnail": "https://i.ytimg.com/vi/QeUMFo8sODk/hqdefault.jpg",
        "author": "Up and Atom",
        "date_of_release": "2018-07-06T13:00:01Z",
        "duration": "PT9M28S",
        "view_count": "1514675",
        "like_count": "50775",
        "comment_count": "3359",
        "description": "Sign up to brilliant.org to receive a 20% discount with this link! https://brilliant.org/upandatom/\n\n*My Quantum Physics Essay*\nhttps://drive.google.com/file/d/1w2gICWIBEOKBEHx_LvYDVQPp6o2ODAR-/view?usp=sharing\n\nHi! I'm Jade. Subscribe to Up and Atom for new physics, math and computer science videos every two weeks! \n\n*SUBSCRIBE TO UP AND ATOM* https://www.youtube.com/c/upandatom\n\nVisit the Up and Atom Store\nhttps://store.nebula.app/collections/up-and-atom\n\n*Follow me: @upndatom\n\nTWITTER: https://twitter.com/upndatom?lang=en\nINSTAGRAM: https://www.instagram.com/upndatom/\n\nCheck out this PlayList for more quantum physics!\nhttps://www.youtube.com/playlist?list=PL1lNrW4e0G8WmWpW846oE_m92nw3rlOpz\n\nA big thank you to my AMAZING PATRONS! \nAlan McNea, Daniel Tan-Holmes, Simon Mackenzie, Yoseph, Andrew Pann, Dave, Anne Tan, Todd Loreman, David, Susan Jones, Marc Watkins, Stephen Veitch, Renato Pereira, Simon Dargaville, Dean Madden, Noah McCann, Robert Frieske, Magesh. \n\nIf you'd like to consider supporting Up and Atom, head over to my Patreon page :) \nhttps://www.patreon.com/upandatom\n\nFor a one time donation, head over to my PayPal :)  \nhttps://www.paypal.me/upandatomshows\n\nOther videos you might like:\nWhat is a Singularity, Exactly? https://youtu.be/NLQNBfI97Ck\nY CN U R34D DIS? https://youtu.be/_PG-jJKB_do\n\n*Music*\nhttps://www.epidemicsound.com/",
        "transcript": "Hi guys! I'm Jade, lovely to meet you. So\nthe Schrodinger equation is one of those things that pops up a lot in like\nquantum science articles and journals and stuff but the journalist doesn't\nusually go into what it means, which is fair because it's a fairly complex topic.\nSo today I just wanted to share with you guys like what it actually means so next\ntime you read it in an article you can get a better gist of what it's about. So\nthe short version is the Schrodinger equation tells us everything we can\npossibly know about a quantum system. It's basically the F=ma of the\nquantum world. If you throw a ball and solve F=ma\nyou can predict its position and momentum for any moment in time. Once you\nhave these two you can derive basically everything else you could possibly know\nabout it, velocity, energy etc. But when we get down to particle land Newton's\nequations don't work anymore. If we put a particle in a box and we\nwant to know where it is F=ma just doesn't cut it. The Heisenberg\nuncertainty principle says that we can't know both the exact position and\nmomentum of quantum objects, but, we can know other things, like the energy levels\nand the wave function, which we'll explore in this video. But that information is\nall inside the Schrodinger equation and with some hardcore mathematics we can\ntease it out. Now the long version! So before I get started I should say that\nthis is the time independent version meaning that it doesn't involve time. And\nif at any point throughout the video you get lost, don't worry, even Schrodinger\ndidn't know exactly what his equation meant. So let's say we have a quantum\nsystem: an electron in a box. We want to know everything we can about this\nelectron so we can make predictions, where it might be,\nwhat energy level it might be at. These answers are all buried within the\nSchrodinger equation. So first let's start with this guy, the pitchfork thing.\nThis is the Greek letter psi and it stands for what's called the wave\nfunction. It tells you where the electron is likely to be. But not where it will be.\nSee quantum objects are sneaky in that you can't predict exactly where they'll\nbe until you measure them. You can only predict where they'll probably be. Say\nthere's this kid you know. You've grown up with them your whole life. They're locked\nin their room with their homework, a Playstation, and a bed. If you had to\nguess where they were you'd say there's about an 80% probability they're on the\nPlayStation, 19% probability they're in bed and a 1% probability they're\ndoing their homework. When you open the door you'll know for sure. But you were\nable to make these predictions because you know this guy. What if you had to\nguess where this electron is? You don't know this electron. Well that's what the\nwave function tells us. It gives us the probabilities of where it's likely to be.\nBut a big difference is that while the guy is only in one place at a time the\nelectron is in a superposition of all possible places at the same time. You may\nhave heard the famous thought experiment Schrodinger's cat who's in a\nsuperposition of being dead and alive until the box is opened and it's forced\nto choose a state. It's the same deal here. The act of not knowing where the\nelectron is allows it's probability distribution to be spread out over a\nlarge space kind of like a wave. Different kinds of waves can represent\ndifferent probabilities of where it's likely to be, hence the name wave\nfunction. It's a function that describes the wave shape of probability\ndistribution of the electron. Oh yeah and when you open the door and\nmeasure where it is this wave probability cloud function collapses and\nthe electron becomes a particle again. No wonder Schrodinger was confused. So\nthat's what the pitchfork means, the wave function tells us where our\nelectron is likely to be. Now let's take a look at this E. It represents the\nenergies the electron is allowed to have. Now before I go into what that means I\njust want to point out that the way this equation is arranged these values are\nthe ones we're trying to solve for, so it's telling us that hey if you do all\nthis stuff you can find out the energy levels of the wave functions of the\nelectron! And if we know these two things we can derive everything else we can\npossibly know about the particle, just like the position and momentum of the ball.\nBut let's backtrack a sec, what do I mean when I say energy levels the electron is\nallowed to have? Like it's a grown electron it can have whatever energy\nlevels it wants right? Well, no. In the regular world we see around is, \nenergy can go up and down in a smooth continuous way, but this isn't the\ncase in the quantum world and the reason comes from the wave-like nature of the\nprobability distributions. Because our particle is inside the box it has a zero\nprobability of being found in or outside the wall, so this means the wave function\nalways needs to be zero there otherwise there's some probability that the\nelectron could be outside the box which we know it's not. That means that the\nelectron can only have certain frequencies associated with it. This\nfrequency is allowed as the wave function is zero at both edges, and this\nfrequency is not, this frequency is allowed and this one is not. So Einstein\ndiscovered that energy is actually proportional to frequency by this\nrelation E=hf where E is the energy, f is the frequency and this h\nhere is Planck's constant. Don't worry too much about that h for now, all you\nneed to know is that it's a constant which means its value doesn't change. So\nif only certain frequencies are allowed inside the box and this is a constant\nthen it follows that only certain energy levels are allowed inside the box too. This\nproperty of discrete or quantized values is where quantum mechanics gets its name.\nThings that can take on continuous values in the regular world like energy\nlevels can only take on certain quantized values at the quantum scale.\nNow let's look at the other side of the equation. We know what we're solving for:\nthe energy levels and the wave functions. But how is all of this going to help us\nget there? Well overall energy is made up of kinetic energy and potential energy.\nIf a skateboarder is on a skate ramp they'll be traveling at some speed and\nhave some kinetic energy, but when they stop at the top they still have energy,\nit's just transformed into a different kind: potential energy. The entire energy\nof the system is just the kinetic energy plus the potential energy and while it\ncan move back and forth between those two states its total value is always\nconserved. Sometimes potential energy is written as a V, so this term is the\npotential energy of the wave function. So if this is the potential energy that\nmust mean that this term here is the kinetic energy I know it doesn't really\nlook like any kind of kinetic energy equation we've seen before right, so\nhere's the derivation if you don't believe me. So if we can solve for the\npotential and kinetic energy of our quantum system\nthis will tell us the energy levels allowed, and that's everything there is\nto know about our little electron! So what would some typical Schrodinger\nsolutions look like? Well to this particular problem\nall the solutions to the wave functions take these two forms and the energy\nequation that popped out was this. Great Jade so what the hell does that mean?\nWell the first thing to note is that every term in this expression is either\na constant or a whole number: h-bar is a constant, 2 is obviously a constant, m the\nmass of the electron is a constant, pi is a constant, and L the length of the box\nis a constant, and n stands for the different states of the electron and\nthey're all whole numbers, 1, 2, 3, etc. So then the energy E can only have certain\nvalues. It's quantized. But what about the wave function? Where is the electron? Well\nlet's look at this guy when the electron is in its first energy state, when n is\nequal to 1. We get this. That's one of the wave functions of the electron and if we\nsquare it we get the probability distribution,\naka where the electron is likely to be. We can see that there's a high\nprobability that it'll be found in the middle here but a zero probability\nit'll be found right at the edges. Here are some more wave functions and\nprobability densities for other energy states. See how the wave function is\nalways always 0 right at the edges. This took me an entire semester of a physics\ndegree to understand and what really helped me was working through a lot of\nproblems and taking the time to build a strong intuition. Brilliant.org has an\nentire course dedicated to quantum mechanics which starts with the\nexperiments which first discovered quantum behavior and leads up to the\nderivation of the Schrodinger equation. It has examples you can work through at\nyour own pace. I actually just went through it to refresh my memory and\nlearned some things I didn't know and definitely understood some things better.\nThey also have heaps of other courses mainly on physics, math and computer\nscience and they're always adding more. The first 200 people to click the link\nbelow and sign up will get a 20% discount. Just go to brilliant.org/UpandAtom. The link is on screen and in the description. And if you're wondering\nwhy I didn't include the math behind the solutions to the Schrodinger equation\nit's because it would have taken me about an hour just to write out\nprobably another five weeks to explain, but for those of you who are especially\ncurious I've posted my final exam essay on quantum physics in the description. It\nincludes the derivation of the Schrodinger equation as well as the\nsolutions and some other interesting stuff like random questions to my\nprofessor. So guys please be honest, do you understand the Schrodinger equation\na bit better now? I hope you do but if you don't please feel free to give me\nany feedback on how I can make my explanations better for future videos.\nQuantum physics is so cool and I really don't want anybody to miss out. So yeah\nthat's all from me. Bye! -"
    }
}