{
    "TAkdsOurp5U": {
        "title": "IKEA Hack: ESPHome & IKEA sensor allow awesome new automations in Home Assistant!",
        "thumbnail": "https://i.ytimg.com/vi/TAkdsOurp5U/hqdefault.jpg",
        "author": "The Smart Home Maker",
        "date_of_release": "2024-01-17T16:00:16Z",
        "duration": "PT8M56S",
        "view_count": "15479",
        "like_count": "349",
        "comment_count": "34",
        "description": "Welcome to my latest DIY Smart Home tutorial! In this video, I'll guide you through the seamless integration of the IKEA Vindriktning air quality sensor with Home Assistant using ESPHome. Learn how to unlock the full potential of your Vindriktning device by not only monitoring particulate matter in your room but also reading the light sensor to gauge ambient lighting conditions. And that's not all – I'll show you how to add a CO2 sensor to the Vindriktning housing, allowing you to keep tabs on the indoor air quality. And once we have all the data in Home Assistant, we will also create some nice automations making use of the data!\n\n🔧 What You'll Learn:\n- Step-by-step setup of IKEA Vindriktning with Home Assistant via ESPHome.\n- Reading and displaying air quality measurements.\n- Utilizing the built-in light sensor for smart lighting control.\n- Enhancing your sensor by adding a CO2 module for comprehensive air quality insights.\n- Use the data for some nice automations!\n\n🛠️ Tools and Components:\n- IKEA Vindriktning Air Quality Sensor\n- Wemos D1 Mini ESP8266\n- Additional CCS811 CO2 Sensor\n- Home Assistant\n- ESPHome\n- Soldering equipment \n- Some cables\n- 10K resistor\n\n🧑‍🏫 Written documentation \nA written documentation incl. the possibility to download the YAML code is available on my blog https://the-smart-home-maker.com/tutorials/esphome-ikea-sensor-allow-awesome-new-automations-in-home-assistant/\n\n🙏 Thanks\nThis video is inspired by tutorials of @3ATIVE  and @KPeyanski. Thank you!\n\n#SmartHome #DIY #homeassistant",
        "transcript": "hey there DIY enthusiasts welcome back to the smart home maker today we've got something truly magical for you an Ikea vring air quality sensor integration with home assistant and espo if you follow my channel you might have noticed this little device behind me in some of my last videos this is an Ikea Vint tricking air quality sensor it can sense the particulate meta concentration in the room air is by default not smart connected and only uses the LED lights to indicate whether the particulate meta concentration is okay or not this sensor costs below 15 bucks we will use ESP home to integrate this sensor with home assistant but hold on we're not just using the particulate meta measurements from from the Ikea sensor we are turning this sensor into a smart Powerhouse that can also play with lighting and monitor CO2 levels for example the main goal is to ensure perfect fresh air in our house so let's jump right into it I've got my Ikea Vint rcking sensor here and we are going to make it dance to our smart home te besides the Ikea vening we need a D1 mini a CCS 811 CO2 sensor a 10K resistor some wires and soldering equipment as well as a home assistant installation with ESP home now let's dive into the wiring first we connect the vring PCB with the D1 mini we connect 5 Vols power and ground as well as the u connection for the particulate meta measurements and the fan minus to know whether the fan is on or not then we connect the light sensor on the back of the PCB with the analog input of the D1 mini and we add a 10K resistor to reduce the voltage the last step is to connect the CCS 811 breake outboard make sure to connect the Wake pin with ground otherwise it won't work now we have to prepare the D1 mini for ESP home first but I don't want to explain this because there are already numerous tutorials out there that teach you how to do this then we have to write our yaml code for the ESP home file first we Define the uart which will be on pin D2 and we have to set a board rate of 9,600 then we Define the i2c bus Which will be on D5 and D6 then we Define the binary sensor for the information whether the fan is running or not on pin number D4 then we Define our particulate mattera sensor we Define our CCS 811 CO2 sensor there's one thing about the Baseline that I'll tell you later on WE Define our light sensor on the analog input a z and to ensure that the CO2 sensor works properly we need to give it some some temperature and humidity sensor and here I'm going to import some from home assistant okay now we're ready to get our hands dirty and start with a soldering for opening the device we need to get a screwdriver and unscrew the four screws on the back of the device after having opened the device and disconnected the wires going to the sensor and to the fan we now have our PCB here if you take a closer look at the top part of the PB you can find the five pads that we are now interested in as shown in the wiring scheme we will now sold a one wire each to the 5 volts ground and rest PAD as well as to the fan minus pad on the bottom part of the PCB after that your PCB should now look like this we will now unscrew the screws that hold the PCB to the front part of the housing in order to access the back part of the PCB the back part of the PCB contains a light sensor which is normally used in order to dim the lights of the Ikea V tricking device but we will make use of this sensor to get the light intensity of the room into home assistant in order to use this for further automations we will carefully solder a wire to the left pad of the light sensor connected to a 10K resistor and from there connect it to the D1 minu now we add our CCS 811 CO2 and tvoc sensor to the setup we need to connect the VCC pin to the 3.3 volts power supply of the D1 mini we need to connect ground we need to connect SDA and SC to D5 5 and D6 respectively and also very important we need to make sure that the Wake pin will be pulled to ground now that we have connected everything I want to make sure that everything works before we put it back into the housing for that I just connect the PCB to the USB port and also connect the particulate metal sensor to the PCB we should now already see some values in home assistant looks very good so we can now put everything back into the housing I would propose to glue all the components with hot glue into the housing but please leave enough space for airflow our device is ready now but there's one thing left and that's the calibration of the CO2 sensor without calibration it will not work properly to calibrate it you have to put it into a room which is full of clean fresh air or you just have to put it outside of the window for about 20 to 25 minutes after the 20 to 25 minutes have passed you can just open the ESP home locks of your device and you can read out the Baseline in the locks which you then have to add in the Baseline attribute of the ESP home yaml code but now let's see our device in action here you can see how I test the light intensity sensor it works well the light intensity will be measured in volts from 0 to 1 volt one volt being the highest light intensity of course you could also convert this to Lux or just use high medium low values but for me the voltage is enough because I only want to use it for automations speaking of automations let's dive into some example automations that I want to show you the first automation that I want to show you will make use of our new light intensity sensor we will create a new Automation in home assistant the trigger will be a numeric State we will then search for our Ikea Vint tricking light intensity sensor and then for um an example we will just say if the light intensity value is below 0.5 Volts for let's say 5 seconds then we want to turn on a certain light automatically so we will just choose one of the lights for this I will choose the light in my office and then we click save now let's see our Automation in action if I turn off the light in the office it will take about 5 seconds until the background light in the office will be automatically turned on isn't that great but wait I have a second automation for you in this automation we also have a numeric State as a trigger as the entity we in this time we choose our Ikea Ving air quality sensor CO2 equivalent and we say for example if that value is above 1,000 but this just an exemplary value then I want to send a push notification so how to send a push notification choose notifications and then select all devices in this case for me I want to send a notification with the message the air quality in the office is really bad please open the window to let in some fresh air okay so let's save this and then try it out and we can see that in case there will be some bad air we will receive a notification okay so that's it I hope you really L this video if you do so then please subscribe to my channel and also watch my other videos thank you see you next time"
    }
}