{
    "TkzsSVBuMKE": {
        "title": "There is nothing that makes HOA board members fear more than to \"eggspose\" their deeds!",
        "thumbnail": "https://i.ytimg.com/vi/TkzsSVBuMKE/hqdefault.jpg",
        "author": "Whistle Blower",
        "date_of_release": "2017-08-17T22:05:56Z",
        "duration": "PT5M57S",
        "view_count": "276032",
        "like_count": "6017",
        "comment_count": "0",
        "description": "#hoaabuse\n\nMassive Media Dump public court records NAMING the HOA liars!\nhttp://hoaspeakout.blogspot.com/2017/10/your.rights.html \n\nhttp://www.bluestar-ranch.com/chickens---hoa.html \n\nHere are the ACTUAL board members that are hiding from the public due to their actions.\n\nhttps://www.pineycreekpoa.com/board\n\nMust view the \"Rip Off Report\" I filed\n\nhttps://www.ripoffreport.com/reports/piney-creek-property-owners-association/bellville-texas-77418/piney-creek-property-owners-association-judy-manning-bill-manning-barbara-byrd-jimmie-b-1404340\n\n Share this on social media. There is nothing that makes HOA board members fear more than for their deeds to be made public. So make this story viral on Social Media.\n\nThis video is my own personal story about homeowner abuse.  As this legal abuse was happening to me I was embarrassed and ashamed. During this time I was afraid to speak out and tell my story. But somehow my chicken business survived and now I am taking this case to the court of public opinion. This video will become viral. Please share this video with your social media.\n\nkeywords: Bellville Texas, piney creek homeowners association, piney creek subdivision, bellville real estate, bullying, harassment, homeowners rights, Austin country courthouse, homeowners rights, hoa abuse, https://www.pineycreekpoa.com/board\n\nEveryone that loves chickens and hates bullies PLEASE shop at my new online chicken store for wonderful farm and gift items. Help me to rebuild my life again. \n\n\"The Cheep Chicken Store\" Even your chickens speak our name! \nhttps://cheepchickenstore.com/",
        "transcript": ""
    }
}