{
    "UGBobTInIBc": {
        "title": "05 - IoT Network Setup - UDM-Pro Complete Setup 2021",
        "thumbnail": "https://i.ytimg.com/vi/UGBobTInIBc/hqdefault.jpg",
        "author": "Crosstalk Solutions",
        "date_of_release": "2021-07-20T16:15:00Z",
        "duration": "PT28M",
        "view_count": "273797",
        "like_count": "6984",
        "comment_count": "546",
        "description": "The UniFi Dream Machine Pro (UDM-Pro) is an excellent home user router/firewall/switch/surveillance system device.  The UDM-Pro runs the UniFi OS and includes UniFi Network, UniFi Protect, UniFi Access, and UniFi Talk bundled in as applications.  \n\nIn this series, we will dig deep into how to set up the UDM-Pro and related applications mostly focusing on Network and Protect.  \n\nPart 05 is a pretty big one!  In this video, we set up a secure IoT VLAN for our smart devices.  This will help keep them separate from your main network and sensitive files.  We will cover the setup of the network plus all associated firewall rules.\n\nUDM-Pro Complete Setup playlist:  https://youtube.com/playlist?list=PL1fn6oC5ndU82-3W4LLynLmEB6z7BAgpE\n\nUDM-Pro (affiliate):  https://store.ui.com/collections/unifi-network-unifi-os-consoles/products/udm-pro?a_aid=crosstalksolutions\n\nTimeline:\n\n00:00 Intro\n02:44 Creating the IoT network\n04:24 Creating the IoT wireless network\n07:12 Testing the network\n12:05 IoT network firewall rules\n\n---------------------\nBuy me a beer!  https://ko-fi.com/crosstalk\nOr donate some Crypto!  https://crosstalksolutions.com/contact/\n\nFollow me on Twitter:  @crosstalksol\n\nCrosstalk Solutions - RECOMMENDED PRODUCTS:  https://crosstalksolutions.com/recommendations/\n\nCrosstalk Discord:  https://discord.gg/crosstalksolutions\n\nAmazon Wish List:  http://a.co/7dRXc67\n\nCrosstalk Solutions offers best practice phone systems and network/wireless infrastructure design/deployment.  Visit https://CrosstalkSolutions.com for details.\n\nConnect with Chris:\nTwitter:  @CrosstalkSol\nLinkedIn:  https://goo.gl/j2Ucgg\nYouTube:  https://goo.gl/g4G58M",
        "transcript": "(upbeat music) - Welcome to Crosstalk Solutions. My name is Chris, and this is UDM-Pro\nComplete Setup video five where we're gonna be setting up an IoT network with firewall rules. IoT network stands for Internet of Things. It's stuff like this smart wi-fi plug, or your smart refrigerator,\nor that Meural frame that I have in the background\nof my videos, right? So any of this sort of\nsmart connected devices. Now, the reason that you\nwant smart connected devices isolated onto their own network is because of the threat of\nthese devices being compromised. A lot of these devices phone home to like Amazon AWS services or phone home to the parent\ncompany that makes the device, and it allows you to have\naccess to these devices from the outside world. So think of like an ecobee\nthermostat, for instance. I have an ecobee thermostat. I can affect changes to my thermostat from anywhere in the world because it is reaching out\nto a connected service. And having these IoT devices\nin their own segregated network really helps you not only control which devices are actually\nreaching out to the internet but you are separating those devices from your more secure main LAN network where your photos and My Documents and all of the stuff on\nyour regular computers are. So since we are talking about IoT and we're gonna be digging\ninto UniFi firewall rules, it is a perfect excuse\nto pour myself a beer, not to mention that it is late on a Friday afternoon right now, and I gotta say that all of\nthe IoT devices in my house, literally every IoT device in my house, is on my IoT network. So I have Home Assistant on that network. All of my TVs and Rokus, everything, anything that's just one of\nthose Internet of Things devices goes on the IoT network, period. One thing you might wanna do is also have a separate network\nfor surveillance cameras. So you can have an IoT network as well as a surveillance camera network. It's gonna be the same exact concept for both of those types of,\nyou know, separate subnets. In this video, though, we're\njust gonna do the IoT network. All right, so cheers\nto everyone out there. Before we hop into this video, though, like and subscribe to Crosstalk Solutions if you haven't already. It's absolutely free, and it\nreally helps out the channel. Also, follow me on Twitter @CrosstalkSol. And if you'd like to buy me another beer, there's a link down\nbelow to do that as well. Okay, let's get started. Here I am at the dashboard of UniFi. I should say the new\ndashboard of UniFi Network. Now, since we wanna create our IoT network as a corporate network\nand not a guest network, and we're gonna be adding\nsome firewall rules for that network, we can't do that in the new interface. We have to switch to\nthe classic interface, so let's do that first. We're gonna click\nSETTINGS, System Settings, and then we're gonna turn\noff the New User Interface, and this is going to bring us back to the original or\nclassic UniFi interface. So we need to start by\ncreating our IoT network. So we're gonna click SETTINGS, and then we're gonna click Networks, and we wanna click CREATE NEW NETWORK. It's gonna be a corporate network, so make sure you choose that. We're gonna call it Crosstalk\nIoT for Internet of Things. We're gonna give it VLAN ID 20, and we're gonna give it a\nsubnet of 192.168.20.1/24. Click UPDATE DHCP RANGE, and it pulls this subnet information down into your DHCP range down below. But we're gonna change\nit to two through 254 so that we take advantage of\nthe complete available set of the IP addresses in this network. For the DHCP Name Server,\nwe're gonna say Manual, and we're gonna give it a\ncouple of public IP addresses: 1.1.1.1 and 9.9.9.9. Now, both of those services are a little bit content-filtered, but if you have something like OpenDNS, you might wanna use that there instead. Okay, so that's it for our network setup. We're gonna click SAVE, and now we have a new\nCrosstalk IoT network that exists on VLAN 20. Next, let's create a wireless network because most of these IoT\ndevices operate wirelessly. So we're gonna click Wireless Networks, and we're gonna click\nCREATE NEW WIRELESS NETWORK. We'll call this wireless\nnetwork Crosstalk IoT as well. We're gonna click WPA Personal\nfor the security type, and we're going to give it a security key. You can choose to\nsupport WPA3 connections, but most of these devices are not Wi-Fi 6, so they're not gonna be\nable to do any sort of WPA3. So for me, I'm just gonna leave that off. Now, when we wanna choose the network, we're gonna choose Crosstalk IoT because that's going to put any devices that connect to this wi-fi onto the Crosstalk IoT\nVLAN that we just created. VLAN, of course, stands for\nVirtual Local Area Network, and it just essentially\nmeans that we've got our LAN and then we've got additional,\nseparated LAN networks called VLANs or Virtual LANS sort of stacked on top of the main LAN. Any switch port that\nwe plug something into can be any one of those, as we'll show later in this video, or it can be all three of those, but a device is only gonna\nbe able to see your VLANs if it can understand VLAN tagging. And, again, that's all a\nlittle bit complicated. I've done a number of videos on VLANs, but we're also gonna dig\na little bit into VLANs later on in this series. Right, opening up ADVANCED OPTIONS, you might wanna consider only enabling the 2.4 gigahertz\nband for your IoT devices. Most IoT devices are only 2.4 gigahertz, and the ones that are,\nyou know, mixed mode, 2.4 and five gigahertz, they\ncan do 2.4 gigahertz anyways. 2.4 gigahertz is going to have a little bit more of extended\nrange for your devices, and you also wouldn't be cluttering up your five-gigahertz\nspectrum for other devices such as your phones\nand tablets and laptops that can use sort of the higher bandwidth of the five-gigahertz spectrum. Now, scrolling down here to User Group, if you remember the last video, we set up a bandwidth throttled user group called Crosstalk Guest. I'm not going to be\nthrottling this IoT network, but you can if you want to. So for me, these IoT devices use very\nlittle bandwidth anyways. Usually, they're just sort of\npinging out to the internet. And other devices that are\nconnected to the network like my Home Assistant Raspberry PI here, I would want that to have full speed because sometimes it has to\ndownload updates and stuff, and I don't wanna slow down\nthat process by throttling it. Okay, so we're gonna leave\neverything else default, and then we're gonna click\nSAVE down at the bottom. So now we can see that we have the Crosstalk IoT wireless network. We also have the Crosstalk\nIoT wired network. Now, this computer that's right behind me, we're going to now put this computer wired into the IoT network. So it is plugged into Port\n7 on the 24-port switch that I have in the cabinet. So let's go to our DEVICES. We're gonna click on our USW-Pro-24. We're gonna choose Port 7, and we're gonna edit this port. Now, again, this has to do with VLANs. What I'm doing here is I'm going to change the\nSwitch Port Profile from All, when it's in All, it means our main LAN is\nthe main LAN of this port, but we also have access\nto the other two networks, VLAN 10, the Guest Network, and VLAN 20, the IoT network, if the device that's plugged\ninto that port is tagged to read those other networks like a Voice over IP phone\nmight be or something like that. But since this computer that\nI have back here as a test does not understand VLAN tagging, we're going to manually set\nPort 7 into this IoT network, meaning that anything\nplugged into that port natively will receive an IP address on the IoT network or 192.168.20.x. All right, go ahead and apply that change, and the device is provisioning. As soon as this has finished provisioning, we're gonna take a quick look\nat this computer back here. Right, so the switch is\nfinished provisioning, and you can see that I was\npinging out to the internet, and now I'm getting request timed out. Let me go ahead and start\nrecording this screen. And if we come over to our command prompt, let's get out of that ping, we're gonna say ipconfig /release, which is going to release\nthe current DHCP lease, and then we're gonna say ipconfig /renew, and now we can see that I received an IP address of 192.168.20.222, meaning that now we\nare in the IoT network. So if I ping back out to the internet, we can see that I'm receiving\nreplies from 1.1.1.1. If I ping an FQDN, such as slashdot.org, we can see that I'm\nalso receiving replies, which means that DNS is working\nand the internet is working. However, remember this is our IoT network, so what else might be working that we don't actually want to be working? Well, if I ping 192.168.1.1, I'm getting a reply from\nthe main LAN interface of our UDM-Pro as well. My computer here is 192.168.1.144, and I'm also receiving replies from my main computer here as well, which we don't want, right? We don't want my IoT devices or devices that are in the IoT network to be able to see computers\nthat aren't in the IoT network. So let's go ahead and\nstart a persistent ping from this back computer\nover to my main computer. And now we can keep an eye on this as we do our firewall rules, which we're gonna do next just after this word from our sponsor. This video is brought to you by our Crosstalk Solutions turnkey Hosted or On-Premises PBX services. If you're looking for a technology partner to help painlessly transition\nyou to a brand new PBX, then look no further\nthan Crosstalk Solutions. We offer full turnkey PBX installations where we work with you on\nthe design of the system, perform a complete setup and test of the PBX in all equipment, and then ship everything to you ready for plug-and-play installation. Once you receive the equipment, we'll guide you through the\ntransition to the new system, provide user guides and training\nmaterial for your users, provide administrative training\nfor your administrators, and we also include 30 days\nof post-deployment support with no ongoing monthly maintenance fees. We will also ensure to set up your PBX with best practice Kari's Law and Ray Baum Act compliant\ne911 emergency dialing, as well as guide you through the phone number porting process if you're switching\nphone service carriers. We have truly designed\nour turnkey PBX process to be as painless as possible because we know that switching PBX systems can be a daunting task,\nbut it doesn't have to be when you choose Crosstalk Solutions for your Voice over IP needs. So check out CrosstalkSolutions.com for more information on\nour turnkey PBX packages. And when you're ready to get started, just fill out the contact\nform on our website, or email Info@CrosstalkSolutions.com for a custom quote\nwithin one business day. All right, now back to the video. All right, thank you so much for that, and now into the firewall\nrules for our IoT network. So to get to our firewall rules, we wanna click on Routing & Firewall, and then click on the\nFIREWALL tab right here. So let's talk about all of\nthese various tabs here. We have WAN IN, WAN OUT, WAN LOCAL, and then the same things\nfor LAN as well as GUEST. So, essentially, these are the directions that traffic can be\nflowing within our network. So let's take a look\nat the three LAN tabs. LAN IN means here's my UDM-Pro, this is all traffic that is\ncoming into the LAN interfaces from my LAN networks, right? LAN OUT means any traffic\ncoming from the UDM-Pro or anywhere else into the LAN networks. And then LAN LOCAL means\nanything that originates from my local area networks and then is destined for the\ninterface of the UDM-Pro itself on whatever LAN we\nhappen to be coming from. So that would be my IoT\nnetwork of 192.168.20.1 or my main LAN network of 192.168.1.1. If we click on LAN IN, we can see that that has our\ntwo networks already in here: 192.168.20, 192.168.1. If we click on GUEST IN, we can see that has my\nGuest network subnet of 192.168.10.0, right? So we're mainly gonna be\nfocusing on the LAN tabs here. And the first thing that we\nwanna do is to create a rule that allows for any Established\nor Related connections to proceed through unhindered,\nif you will, right? So if anything's already\nan Established connection, Established means traffic is flowing on a connection that's\nalready been established, and Related means it's a new packet but from a connection\nthat's already established. So we're gonna say CREATE NEW RULE, and we'll say Allow\nEstablished and Related. We're going to accept all traffic. And then down here under\nADVANCED, for States, wanna check the boxes for\nboth Established and Related. And then for source and destination, we're gonna say Any, Any, right? We don't care. Just any Established\nor Related connections, let's allow those through the firewall. And we'll click SAVE. Now, these rules are processed in order. So as we're adding rules, they're gonna go each\none underneath the next. So when you're adding\nrules to the firewall, you kinda wanna think through like, \"Okay, well, which\nrule do I wanna catch before I move on to the\nnext rules?\", right? And you can always reorder\neverything once you're done if something's not working\nthe way that you want it to. The next rule that we're gonna create is for our LAN network, 192.168.1.1. That network is going to have full access to see all of the other networks, right? So we don't care if\nwe're in our secure LAN. The secure LAN can see\nstuff in the IoT network, such as if you wanted to get access to your Home Assistant Raspberry Pi. It can also see devices in\nthe Guest network, right? So let's go ahead and\ncreate a rule for that. But before we do that,\nwe wanna create a group that encompasses all of the\nRFC 1918 private address spaces 'cause we're gonna say our LAN can see all of\nthe other networks, right? Any private address space. Now, we could individually\nadd our networks, but by using a group instead, we're basically saying\nit's a catch-all, right? It's a catch-all for any\nrules that we create. You'll see what I'm talking\nabout in just a second. Let's click on Groups, CREATE NEW GROUP, and we're gonna call this Local Networks, and then we'll also call it RFC1918. This is gonna be an Address group, and we're gonna give it 192.168.0.0/16. That basically means any\nprivate IP address range, 192.168 anything dot anything, and we're also gonna add two more. So the other RFC 1918\nprivate address spaces that are not routable on the internet, they're reserved for private subnets, are 172.16.0.0/12 as well as 10.0.0.0/8, and we're gonna save that group. Basically, we just\ncreated a group that says any private network, right? It allows us to use that\ngroup in our firewall rules. So now let's go back to our Rules. We're gonna click on LAN IN, and we want a rule that says\nour main LAN, 192.168.1.x, can see anything in those any\nprivate address space, right? So we're gonna say CREATE NEW\nRULE, Allow LAN to anywhere, and we're gonna click Accept, scroll down, and then our source is gonna be Network, and we wanna select our main LAN, and the destination is\nAddress or Port Group and then that group that we just created. So we're saying if the source is the LAN and the destination is any\nprivate IP address space, accept that connection, save that rule. And now let's create another rule where we're going to block\neverything else, right? Any other inter-VLAN communication from any private address space to any other private address space, we are blocking. Right now, remember these\nrules are executed in order. So for our LAN, any traffic\noriginating from the LAN is never gonna hit this third rule 'cause it's gonna be caught up in the Allow LAN to anywhere rule. Let's create our new rule. We're gonna say Block inter-VLAN traffic, and we're gonna say Drop connections. This time, we are not\naccepting connections. We are blocking connections. Scroll all the way down where the source is Any RFC1918\nnetwork, private network, and the destination is\nalso that same group. So any private network trying to get to any\nother private network, we are blocking, and remember the LAN\nrule is above this one. So if we're coming from the\nLAN, we're already authorized. You'll never actually hit this rule if you're coming from the LAN. Let's go ahead and save that. And then, typically, firewall rules are applied almost immediately. You might be saying, \"Well, Chris, your\nfirewall rule's applied, but I've got this persistent\nping running back here from this computer in my IoT network that's pinging my main\ncomputer in the LAN network. Well, you just created this\nfirewall rule that blocks that. Why is that still allowed to ping?\" Because the first rule that we created was to allow Established and\nRelated connections, right? And this is already an\nEstablished connection. If we come over here to Settings, we can see that the timeout value, the state timeout value for ICMP, which is the protocol that ping uses, is 30 seconds. So, basically, if we stop this ping and then we wait 30 seconds,\nwe're gonna try it again. Right, so let's wait that 30 seconds, and I'll be right back. Okay, so I think I've\nwaited a good 30 seconds. Let's go ahead and try it now. We're gonna run that same ping command. And now it's not working, okay? So now we have successfully\nblocked all inter-VLAN traffic being that this computer's\nin 192.168.20 trying to get over to my other computer\nhere in 192.168.1 which is in my main LAN. But there are still some\nproblems here, right? So the device is in my main LAN, but we still do have access\nto a couple other things. Let's take a look. So I can ping 192.168.20.1, okay? So the UDM interface of my IoT network. I can also still ping 192.168.1.1, okay? So I can still ping the UDM-Pro\ninterface for my LAN network because that's not a LAN IN\nrule, that is a LAN LOCAL rule, and now we need to create some rules to prevent this from happening because right now if\nI'm in my IoT network, I could open up Chrome\nand go to 192.168.1.1 and bring up the interface\nof UniFi OS, right? Which I don't wanna be able\nto do that for my IoT network. I don't want devices in the IoT network to have any access to this\nUniFi interface whatsoever. Right, so let's do some, let's do some blocking there. The first thing that we're gonna block is my IoT network and my\nGuest network's access to other networks' gateways. And to do that, I need to\ncreate some more groups. So back on my main computer here, we're gonna click on Groups, and we're gonna create a new group, this is gonna be an Address group, and we're gonna call this\nBlock, oops, wrong keyboard, Block IoT to GW, Gateway, right? And the addresses that we're\ngonna block are 192.168.1.1 and then 192.168.10.1, the address of my Guest network, and we're gonna hit SAVE. Then we're gonna add one more that says Block Guests to GW, Gateway, again, and we're gonna block 192.168.1.1, and we're gonna add and block\n192.168.20.1, my IoT network. So what I'm doing here\nis for my Guest network, I'm blocking the main\nLAN and the IoT network. And for the IoT network, I'm gonna be blocking the main\nLAN and the Guest network, and we're gonna save that. And now let's go back to our Rules, and this time we're\ngonna click on LAN LOCAL, and we're gonna add a new rule, and in this rule, we're gonna\nsay Block IoT to Gateways. We're going to drop connections, and we're gonna drop any traffic where the source is the IoT network and the destination is the\nrule that we just created, and we're gonna save that. Now let's add another one for our Guests, Block Guests to Gateway. We're gonna drop all connections where the network is our Guest network and the destination is\nGuests to Gateway, right? So save that. And now we have successfully\nblocked the IoT network from seeing any other, any\nother network interfaces. So let's test that out. So I've refreshed the page that I originally brought up the UniFi OS, and we can see that it's\njust spinning and spinning. It is not actually coming\nback with that page. And if I try to ping 192.168.1.1, now I get no reply whatsoever because I am blocking that network. But still, we're not done yet, right? Because even though I\ncan now no longer get to the UDM interfaces of my other networks from the IoT network, I can still get to the UDM\ninterface of the IoT network. Let's take a look at that. So if I say ping 192.168.20.1, it's still replying. And if I open up UniFi, 192.168.20.1, I can still get to the GUI\ninterface of the UDM-Pro. You might say, \"Well, Chris, why didn't you just block 192.168.20.1 from the IoT network?\" Well, if you did that, you'd\nno longer have internet access. So what we need to do\ninstead for our third rule is only block the access ports required for the interface of the UDM-Pro, which is going to be HTTP,\nHTTPS, and SSH, right? So port 80, port 443, and port 22. Right, so back on my computer, the way that we're gonna do this is we're gonna create two more groups. We're gonna click on Groups,\nwe're gonna create a new group, and in this group we're\ngonna call this All gateways, which is basically all\ninterfaces of my UDM-Pro, and we're gonna say 192.168.1.1. We're gonna say 192.168.10.1\nfor the Guest network and 192.168.20.1, and we're\ngonna save that group. Now, those are the gateways. We also need to add another\ngroup, so CREATE NEW GROUP. This time, it's gonna be a Port group. So we're gonna call this\nUDM-Pro access ports. And the ports that we're\ngonna add are 80 for HTTP, 443 for HTTPS, and 22 for SSH, and let's go ahead and save that. And now we need to add another rule. So we're gonna go back to\nRules IPv4, click on LAN LOCAL, create a new rule, and we're gonna say Block\nIoT from UDM-Pro access. We're gonna turn that on, we're gonna drop everything\nwhere the network is IoT and the destination is our Gateway IP address\ngroup that we just created and the ports that we restricted, so we're gonna save that. And now if we go back to\nthe back computer here, I should still be able to ping\nthe interface 192.168.20.1. Yup, I can still ping it. And if we wanted to, we could block ICMP. But I like using ICMP\nfor testing stuff, right? So I usually leave ICMP enabled. But if I bring Chrome back up and try to browse HTTPS to\nthe interface 192.168.20.1 that was working just a second ago, now we can see that it's timing out. From the IoT network, I do not have access\nto HTTP, HTTPS, or SSH on 192.168.20.1 or any of the other gateway\nIP addresses, 1.1 or 10.1. Right, so there you have it\nfor the IoT network setup and the related firewall rules. Now, you can dig in a lot deeper\nand get much more granular with these firewall rules. For instance, another rule\nthat you might wanna add is the ability for devices in the IoT network or the Guest network to see DNS servers such as a Pi-hole on your main LAN, right? You might wanna allow DNS through or maybe disallow all other DNS servers besides those Pi-holes. Now, that's gonna be beyond\nthe scope of this video series. But there's so, so much that you can do with these firewall rules. But it can also be pretty complicated and confusing at times. So if you have questions\nabout any of these, put those down in the comments below, and I will definitely look those over and answer whatever I can. If you liked this video, make\nsure you give me a thumbs-up and subscribe to Crosstalk Solutions for more videos just like this one. All right, we will see you\nguys in the next video. (upbeat music)"
    }
}