{
    "UjaAxUO6-Uw": {
        "title": "Schrödinger's cat: A thought experiment in quantum mechanics - Chad Orzel",
        "thumbnail": "https://i.ytimg.com/vi/UjaAxUO6-Uw/hqdefault.jpg",
        "author": "TED-Ed",
        "date_of_release": "2014-10-14T15:02:48Z",
        "duration": "PT4M38S",
        "view_count": "8290290",
        "like_count": "201182",
        "comment_count": "9091",
        "description": "View full lesson: http://ed.ted.com/lessons/schrodinger-s-cat-a-thought-experiment-in-quantum-mechanics-chad-orzel\n\nAustrian physicist Erwin Schrödinger, one of the founders of quantum mechanics, posed this famous question: If you put a cat in a sealed box with a device that has a 50% chance of killing the cat in the next hour, what will be the state of the cat when that time is up? Chad Orzel investigates this thought experiment. \n\nLesson by Chad Orzel, animation by Agota Vegso.",
        "transcript": "Austrian physicist Erwin Schrödinger is\none of the founders of quantum mechanics, but he's most famous for something he\nnever actually did: a thought experiment involving a cat. He imagined taking a cat and\nplacing it in a sealed box with a device that had a 50% chance\nof killing the cat in the next hour. At the end of that hour, he asked,\n\"What is the state of the cat?\" Common sense suggests that the cat\nis either alive or dead, but Schrödinger pointed out that according\nto quantum physics, at the instant before the box is opened,\nthe cat is equal parts alive and dead, at the same time. It's only when the box is opened\nthat we see a single definite state. Until then, the cat is \na blur of probability, half one thing and half the other. This seems absurd, \nwhich was Schrödinger's point. He found quantum physics so \nphilosophically disturbing, that he abandoned the theory\nhe had helped make and turned to writing about biology. As absurd as it may seem, though,\nSchrödinger's cat is very real. In fact, it's essential. If it weren't possible for quantum objects\nto be in two states at once, the computer you're using to watch this\ncouldn't exist. The quantum phenomenon of \nsuperposition is a consequence of the dual\nparticle and wave nature of everything. In order for an object to have\na wavelength, it must extend over some region of space, which means it occupies many positions\nat the same time. The wavelength of an object limited\nto a small region of space can't be perfectly defined, though. So it exists in many different wavelengths\nat the same time. We don't see these wave properties\nfor everyday objects because the wavelength decreases\nas the momentum increases. And a cat is relatively big and heavy. If we took a single atom and blew\nit up to the size of the Solar System, the wavelength of a cat \nrunning from a physicist would be as small as an atom \nwithin that Solar System. That's far too small to detect, so we'll\nnever see wave behavior from a cat. A tiny particle, like an electron, though, can show dramatic evidence\nof its dual nature. If we shoot electrons one at a time at a\nset of two narrow slits cut in a barrier, each electron on the far side is detected\nat a single place at a specific instant, like a particle. But if you repeat this \nexperiment many times, keeping track of all the \nindividual detections, you'll see them trace out a pattern that's\ncharacteristic of wave behavior: a set of stripes - regions with many\nelectrons separated by regions\nwhere there are none at all. Block one of the slits \nand the stripes go away. This shows that the pattern is a result of\neach electron going through both slits at the same time. A single electron isn't choosing \nto go left or right but left and right simultaneously. This superposition of states also leads\nto modern technology. An electron near the nucleus of an atom\nexists in a spread out, wave-like orbit. Bring two atoms close together, and the electrons don't need to \nchoose just one atom but are shared between them. This is how some chemical bonds form. An electron in a molecule isn't on\njust atom A or atom B, but A+ B. As you add more atoms,\nthe electrons spread out more, shared between vast numbers of atoms\nat the same time. The electrons in a solid aren't \nbound to a particular atom but shared among all of them,\nextending over a large range of space. This gigantic superposition of states determines the ways electrons move\nthrough the material, whether it's a conductor or an insulator\nor a semiconductor. Understanding how electrons are shared\namong atoms allows us to precisely control the\nproperties of semiconductor materials, like silicon. Combining different semiconductors\nin the right way allows us to make transistors \non a tiny scale, millions on a single computer chip. Those chips and their spread out electrons power the computer you're using to\nwatch this video. An old joke says that the Internet \nexists to allow the sharing of cat videos. At a very deep level, though,\nthe Internet owes its existance to an Austrian physicist\nand his imaginary cat."
    }
}