{
    "VLmLHbRPIbQ": {
        "title": "Every Episode of Gay Science | Collection 1 | Rob Anderson",
        "thumbnail": "https://i.ytimg.com/vi/VLmLHbRPIbQ/hqdefault.jpg",
        "author": "Rob Anderson",
        "date_of_release": "2021-11-27T00:19:20Z",
        "duration": "PT10M19S",
        "view_count": "192264",
        "like_count": "10326",
        "comment_count": "254",
        "description": "Gay Science is a series that asks the question “Why do the gays?” I take queer stereotypes and explain them scientifically with true 100% real science. This is a collection of every episode from the first collection (2020) of Gay Science and Gay Anthropology. In this video we'll answer:\n\nWhy do gay men like iced coffee?\nAre vers bottoms going extinct?\nWhy do gay men color their hair in a crisis?\nWhy can't gay men sit in a chair properly?\nWhy can't gay men remember each other's names?\nWhy are gay boys always the female teacher's favorites?\nDisney Gays, explained\nPlant Gays, explained\nHorror Genre Gays, explained\nGame Night Lesbians, explained\nWhy are gay co-workers either best friends or mortal enemies?\n\nBuy Gay Science merch here! \nhttps://martthrob.com/collections/gay-science\n\nMore FartThrob on the internet:\nTikTok: Heartthrobert https://www.tiktok.com/@heartthrobert\nInstagram: Heartthrobanderson https://www.instagram.com/heartthrobanderson/\nTwitter: smartthrob https://twitter.com/smartthrob\n\nSign up for my newsletter and discover new music, clothes, art, and more. The Heartthrob Collective: http://eepurl.com/hFstpX",
        "transcript": "Error: \nCould not retrieve a transcript for the video https://www.youtube.com/watch?v=VLmLHbRPIbQ! This is most likely caused by:\n\nSubtitles are disabled for this video\n\nIf you are sure that the described cause is not responsible for this error and that a transcript should be retrievable, please create an issue at https://github.com/jdepoix/youtube-transcript-api/issues. Please add which version of youtube_transcript_api you are using and provide the information needed to replicate the error. Also make sure that there are no open issues which already describe your problem!"
    }
}