{
    "xBIowQ0WaR8": {
        "title": "build your own cloud",
        "thumbnail": "https://i.ytimg.com/vi/xBIowQ0WaR8/hqdefault.jpg",
        "author": "NetworkChuck",
        "date_of_release": "2023-06-19T19:39:52Z",
        "duration": "PT47M13S",
        "view_count": "1803862",
        "like_count": "48135",
        "comment_count": "1854",
        "description": "Now you can deploy and run your own hyper-secure file sharing platform, by downloading FileCloud’s Community Edition. Visit https://ntck.co/filecloud and download FileCloud Community Edition as a self-hosted solution, on your Windows or Linux servers or preferred IaaS provider (AWS, Azure). (no code required) \n\n\nIn this video, NetworkChuck will walk you through how to create your own cloud, either at home, on-prem or in the cloud! NetworkChuck demos the setup of FileCloud and Nextcloud, two excellent dropbox, google drive and microsoft one drive replacements. These are great options for both personal and business.\n\n\nLINKS\n---------------------------------------------------\nFileCloud AWS: https://ntck.co/3CyTYz4\nAWS IAM User Policy: https://ntck.co/3PkKPlj\nFileCloud Docker install: https://ntck.co/3pckT0A\nFileCloud Linux Install: https://ntck.co/42OypoM\nNextCloud Install: https://ntck.co/44694HZ\n\n🔥🔥Join the NetworkChuck Academy!: https://ntck.co/NCAcademy \n\n\n\n**Sponsored by Filecloud\n\n\n\n0:00   ⏩  Intro\n1:43   ⏩  What do you need?\n3:57   ⏩  What is FileCloud?\n6:30   ⏩  the SETUP: FileCloud on AWS\n12:44 ⏩  Amazon S3 Setup with FileCloud\n23:30 ⏩  the SETUP: On-Prem FileCloud\n28:43 ⏩  Adding an External Hard Drive to FileCloud\n32:13 ⏩  Setting up a Domain Name and SSL for FileCloud\n38:18 ⏩  Mounting a Remote Share in FileCloud\n41:58 ⏩  the SETUP: NextCloud\n\n\n\n\n\n\n\nSUPPORT NETWORKCHUCK\n---------------------------------------------------\n➡️NetworkChuck membership: https://ntck.co/Premium \n☕☕ COFFEE and MERCH: https://ntck.co/coffee \n\nCheck out my new channel: https://ntck.co/ncclips \n\n🆘🆘NEED HELP?? Join the Discord Server: https://discord.gg/networkchuck \n\nSTUDY WITH ME on Twitch: https://bit.ly/nc_twitch \n\nREADY TO LEARN??\n---------------------------------------------------\n-Learn Python: https://bit.ly/3rzZjzz \n-Get your CCNA: https://bit.ly/nc-ccna \n\nFOLLOW ME EVERYWHERE\n---------------------------------------------------\nInstagram: https://www.instagram.com/networkchuck/ \nTwitter: https://twitter.com/networkchuck \nFacebook: https://www.facebook.com/NetworkChuck/ \nJoin the Discord server: http://bit.ly/nc-discord \n\n\n\n\nAFFILIATES & REFERRALS\n---------------------------------------------------\n(GEAR I USE...STUFF I RECOMMEND)\nMy network gear: https://geni.us/L6wyIUj \nAmazon Affiliate Store: https://www.amazon.com/shop/networkchuck \nBuy a Raspberry Pi: https://geni.us/aBeqAL\nDo you want to know how I draw on the screen?? Go to https://ntck.co/EpicPen and use code NetworkChuck to get 20% off!! \nfast and reliable unifi in the cloud: https://hostifi.com/?via=chuck\n\n\n\n\n#filecloud #filesloution #nextcloud",
        "transcript": "This, and this is all you need to\nreplace Dropbox and Google Drive. You're gonna use this to make\nyour own cloud. In this video, I just might convince you to stop\nusing Google Drive, OneDrive, Dropbox, whatever it is, even if you're a business,\nlet's kick that sucker to the curb. I almost pull a muscle. Most of\nus paid Dropbox, Google Drive, OneDrive to host and keep\nour data in the cloud, giving them control of our data.\nThat feels good, doesn't it? But hey, we do get a little bit of\nconvenience in return, right? We can easily share all these files\nand we have the peace of mind that it's always gonna be there and accessible\nuntil Google decides it shouldn't be. Or they change their prices or\nthey go down or they get hacked. All of these things have happened. So\nthe solution is to create your own, create your own clout, host your own\nstuff. Now, this is actually crazy simple. All you're gonna need\nseriously is a computer. It could be a spare laptop with\na little external hard drive. It could be a virtual machine, a docker\ncontainer. It can be in the clout, which I know sounds weird, but you're\nhosting it yourself. It's different. I'll show you. And you're gonna find\nthat Google Drive, Dropbox, OneDrive, they haven't been giving us all the\nfeatures we deserve. So right now, I'm gonna show you two self hosting\nfeatures that are kind of gonna blow your mind. They have way more features\nthan Dropbox and Google Drive Gross. Don't put that gr, that was so corny\nand dumb. Don't put the last part. So get your coffee ready. We're gonna give you a cloud\nexperience on your own hardware, which that just sounds cool, right?\nYou're building your own cloud in a way, and you're gonna learn a ton along the\nway. So if you're learning it, man, this is for you. And if you're not,\ndo it anyway. Cuz this is for you too. Coffee break. And by the way, this is my default route roast.\nIt's my stinking favorite. It's a single origin coffee from Ethiopia, probably my favorite origin for coffee. It has notes of berry chocolate and\ncaramel and yes, I can taste all of it. You can too. And shout out to File\nCloud for sponsoring this video. So now let's talk about what do\nyou need? Well, first of all, you don't need these guys.\nYou're done. Goodbye. Actually, before we talk about what we\nneed, there were two options. I mentioned now why two?\nWell, let's cover that. But first I just want you to know\nthey're both free, completely free. But they do target different\naudiences. For example, our first one we're talking\nabout is File Cloud. They are the sponsor of this video.\nThey do have a free community edition, but their target audience is\nlarge companies, enterprises, which is something I love by the\nway, because I get to use a tool, the same tool that large companies use. I'll tell you why I love\nthat here in a second. But the second option is next\ncloud. Next cloud is pretty cool, but it's more home lap. You probably won't see an enterprise\ncompany using this and that's fine. Both of these have a\nton of amazing features. I'm not gonna tell you\nwhat you wanna pick. You're gonna have to figure that out.\nI'm just gonna show you what they do. Now let's talk about what you\nneed to deploy either of these. You got a couple options. Just know it's gonna be pretty easy\nWith an asterisk , you'll see, but you're gonna learn a lot. Trust me, many of you'll want host this OnPrem\nor in your house, in your business, whatever it is. And that's kinda\nthe main selling point, right? Like gimme my data. No one can have it. It's not leaving my house unless I\ncan share it securely, but you can't. So for that, you can have a spare\nlaptop collecting dust in your closet. You can install it on your Windows\nmachine you're using right now, or a Windows server if you're a nerd\nlike me. Or it can go on any Linux. Server F Cloud loves Ubuntu 2004 server\nL T s. I said all that backwards. That was weird. It can also be a Docker\ncontainer. So you have a lot of options. Oh, they even have a image\nfor virtual box and ES xxi, whichever option you choose. It's\nreally, really simple to get installed. We'll walk through it. Then the other option I think is more\nfun and you're gonna learn a ton. And that's in the cloud. So I know it\nsounds weird like we're leaving the cloud, but you're gonna put me back in\nthe cloud. What are you doing? You kind of have more control\nthough. You do have more control. We're gonna put the sucker\nin aws, Amazon's cloud, which means we're gonna get to learn a\nfew things about how to do things in the cloud like e C two and s3. I'm gonna\nwalk you through the entire thing, but you're gonna end up hosting your\nown drive in the cloud. Your own cloud, in the cloud. So my advice, if you wanna play around and have fun\nand learn a ton, do pick both options. Play with it. Now keep in mind that on-prem is gonna\nbe completely free as long as you have stuff aws, they do charge for hosting because you're\nnot just using your hardware anymore, you're using someone else's\nhardware and you gotta rent. Okay? That's what you need.\nOh, , I forgot. The most important thing you need\ncoffee you do. That's required in it. Everything in it requires copy. We're\ngonna start with File Cloud. Now, as I mentioned before, one of the main reasons I love File\nCloud is because they're enterprise, they target large companies. But\nwhy do I like that? Well, for me, and I think probably for you too, the reason I build my home lab is so I\ncan kind of pretend to be a company cost playing as a company, right? Because I wanna get hands on the skills\nand experience with stuff companies might use and then pay me for those\nskills, right? That's the goal. My home lab is to learn. So any chance I can get to host\nsomething in my lab that's enterprise, that companies really actually\nmight use, I'm gonna take it. And I love that you\ncan install on Windows. I think it's probably one of the only\nhost your own cloud solutions out there that install on Windows, which is why,\nwhy companies love it, right? But yeah, windows 10 and up Windows Server 2000\nsomething I, I forget what it is. Then you put a thing\nthere for what version? It was the file Clouds was known as\nan EFS or an enterprise file sharing solution. E F S. Their goal is to help you make\nyour own private cloud as a person, as a business. They got you back an emphasis on\nthe enterprise because it's really, really powerful and really, really secure. That's why they're big in government\nfinance and education nowadays. Data is the name of the game.\nKeeping your data safe and secure, making sure you're not sharing it with\nsomeone you shouldn't. I mean, goodness. Can you think about a large company that\nuses Dropbox and trying to control who they share your data\nwith? That's a nightmare. I'm just worried about my two kids in\nthere who are using Dropbox and Google Drive, not to mention my employees.\nGoodness. Now for the community edition, before we install it, lemme tell you a few things I love it\nfor and why you might wanna install it right now. Of course you get remote access to\nyour files from anywhere and it's free. You also have full control of your\nstuff, of your data and it's private. And then this is just incredible , I've been wanting this from Google Drive\nand Dropbox forever and they just don't do it. They have hyper secure file sharing and\nwhat that means cuz that that's just a word, right? What that means is when you\nshare a file password protected limit, the time it's allows it to be downloaded, limit the amount of downloads\nthat can occur. Create a file. Say you can only download it until next\nweek and you can only download it one time. That's killer, right? Most solutions you can download a an\napplication that'll sync your files back and forth, but you can also, and\nI don't think else does this, you can mount the share or you can mount\nyour drive as a network share and it acts just like, it's so cool. If you're\nlike, what are you talking about Chuck? I'll show you in a second. It's amazing.\nNow beyond the community edition, there are some things that they\ndo enterprise that will just, you didn't even know what's\npossible. It's crazy. And we'll talk about that just for a\nmoment so you can see what's out there. So you can learn what companies\ndo to protect their data. I think it's important to know that\nbecause a big thing that File Cloud cares about is data governance. Putting\nretention policies on your data, having smart D L P or\ndata leak prevention. They even have zero trust file\nsharing and antivirus scanning, all kinds of stuff I'll\nshow you. So now the setup, I'm gonna start with AWS because\nhonestly it's the most fun. Like really it's so fun. If\nyou don't care about aws, if you wanna host this on your own, I will have timestamps just jump\nforward to that point in time stamp. That's one step I'm not gonna repeat. So you wanna watch this right now and\nthat's setting up a file cloud account and getting your community edition license, which by the way used to be a paid license\nfor community, used to be $10 a year. Now it's free. So you got\nnothing to complain about. I mean I'm sure you could find something\nand I'll see it in the comments, won't I? I'm talking to you buddy.\nBefore you finish hitting enter, take a sip of coffee, take a breath, I'll take my own advice much\nbetter. So file cloud account, let's set that sucker up right now. We're gonna navigate out to ce dot\nfile cloud.com CE for community edition here. We have a lot of\nthe stuff I already showed you. Feel free to peruse that. But we're gonna\nscroll down and click on download now, which is gonna take us to the whole,\nhey, you need an account thing. So let's get an account.\nBernard Hack. Wow, personal use. I have read everything man. Anyone else feel out they're lying when\nthey click that I didn't read anything but I do agree blindly verification\ncode And we're in from here. It's pretty simple. We're\ngonna click on download now. Download now and then click on download. That's gonna give you a few\noptions of how you can do this. Right now we're gonna laser focus\nin on AWS because it's awesome. Clicking that will take you to the guide,\nwhich we're gonna depend on right now. And I'll walk you through and this will\nbe actually pretty easy now if you've never used AWS before, I am so\nexcited for you. It's so fun. In fact, right now you can sign up\nfor a free tier account, which means you'll get a ton\nof stuff for free in aws. You may even be able to\nset this up for free. So you wanna head out to aws.amazon.com\nand get started for free. I'm not gonna walk you through\nit, I've got other videos on that. But go ahead and set up an account or\nget logged in if you already have one and meet me back here. Now here we are\nin the AWS console. It's kind of fun, don't get overwhelmed, there's a lot\ngoing on. But let's navigate through this. First we're gonna go up here\nto the services tab or button. Click that from here we're gonna click\non the compute little menu icon right there. And finally we'll click on E C two, which is their service to create virtual\nmachines and the cloud. Click on that. Now, mental note real quick.\nUp here at the top right, you'll see what region you're\ncurrently in. I'm in North Virginia, which is US East one. If you're\nsomewhere different, just remember that, write it down, whatever. It'll\ncome in handy here in a bit. Now from here we're gonna\nclick on launch instance. We're gonna create an e C two virtual\nmachine launch instance. Let's name it. And then just below the name, we have the option to search for\nan Amazon machine image, an aami. We're gonna search for file\ncloud right there. Hit enter. Now it's not gonna show you anything\nuntil you click on the AWS marketplace. Amis right here. Once you click on\nthat, boom, file cloud's right there. First one is what we want. Click\non select Now file cloud is free. Amazon isn't all the time and it's gonna\ntell you the server they recommend, the size and how much it will cost\nyou per hour, which is a T2 medium. That's how they uh, refer to the\nsizing of their virtual machines. The amount of virtual CPUs that\ngive you ram hard drive space. We'll walk through that. But\nanyways, let's click on continue. Now with that selected, let's\nwalk through this together. Scroll down just a bit. Here\nwe have our instant type, which they already default\nselected for us to be T2 medium. Now I'm gonna go with that,\nbut you don't have to. In fact, I've installed this on a smaller version,\nespecially if you're on the free tier. You can do the T2 Micro,\nwhich is free tier eligible. You can do that just to try it out. Just have fun so you're not\ncharged anything at all. And if you're wondering Chuck, what's\nthe advantage of going t2? Medium. Uh, it's faster. It can handle more. You're gonna have a better experience\ngoing with a larger computer. That's true in everything from gaming to\ncloud. Next we have our key pair login. AWS is big on using a key pair to\nlogin. So as opposed to a password, they're gonna want you to have a key that\nyou'll use to unlock to get into their server. And we're gonna\ncreate that right now. We're gonna create the lock and\nkey. That's what a key pair is. So we'll create a new key\npair. If you already have one, you don't have to create a\nnew one. I'll name this hack. Well everything else is fine. I'll say\ncreate keep here. And what that will do, you'll notice it downloaded the key, which I'll want to keep and refer\nto in a minute. Just keep it there. Keep it safe. The lock will be on the\nserver. Now that's pretty much it. If we scroll down just a little bit\njust to make sure everything's good, it looks all good to me. You can\nadd more stuff if you want to. You don't need to. I'm done. From here we're gonna click on launch\ninstance and we are off to the races almost. Yep, it's launching it.\nIt's probably booting it right now. If you wanna see what's going on and start\nto access it and see all the details, go ahead and click on this link right\nhere, which is your instance id. Now you don't have to know everything\nabout what I'm talking about to feel comfortable here. It's fine if\nthis is new for you, let it be new, like walking into a new\nhouse. Just explore, have fun, just don't get crazy . I'm gonna click on the link now and we\ncan see right there in the instant state. Mine is still pending. So\nI'm gonna wait just a second. Take a little coffee break for that\nto go to like booted ready to go. So with your virtual machine, booted, we're gonna scroll on over until we\nsee the public I PV four DNS name, that's your server's address.\nThat's how you can access it. We're gonna copy that right now.\nOpen up a new tab and paste it. Now don't you hit enter\nyet. Calm down. . Before we hit enter we're gonna do a\nforward slash and type in admin and hit enter. Oh yeah, looking good actually\nyou know what? Before we do that, take all out extra stuff out just\nafter com. Do forward slash install. I like this feature. This will tell you if everything's\ngolden and good installation checks. Do you got level those check marks,\nthings look good. Extended checks, things look good. So anyways,\nlet's get back to the admin. So take all that out just after com,\ntype in admin and let's get logged in. The default login will be admin and the\npassword will be your instance ID for this machine. So let's go back to AWS\nand we scroll over just a little bit. Our instance ID is right here. I'm\ngonna copy everything the I dash, copy that paste into the\npassword field and get logged in. We are in but hold up,\nwe're hit immediately with\na hey invalid license file. Do we have one yet? No we don't\nhave one. Let's go grab it. Let's get back to our file cloud\nportal that we were in earlier. And notice on step two we had\nthe option to get our license. We definitely want that.\nLet's grab it right now. Click get license and it downloaded\nfor you. That's all you had to do. So now getting back to aws,\nwe're gonna click choose file, choose that license file, open\nit, apply it and that's it. You've got a fully licensed file\ncloud instance, pretty sick. Now you're immediately hit with a barrage\nof notifications on the right and I don't like that. Uh, we'll\nsolve those here in a sec, especially the invalid\nurl. We'll cover that. But let's go ahead and click those away.\nGoodbye, goodbye, goodbye, goodbye, goodbye. No, I'm not gonna show you\neverything cuz there's too much. But I will give you enough to get\nstarted to like not be totally lost. I'll give you some breadcrumbs. Now the\nfirst thing we want to cover is storage. And that's the whole point\nof this entire video, right? Is we wanna store our stuff somewhere\nelse besides Google Drive one Drive in Dropbox. I'm getting tired of\nsaying those company's names. Let's just call them the uh, the triad.\nWe're calling 'em the triad from now on. Okay? Currently with this install I only have\nabout 40 gigabytes or so of data to store, which is not a lot. And the reason for that is because that's\nhow big my hard drive is on the AWS e C two machine I deployed. If I go\nover to storage in my AWS console, I can see my volume right there. Now you\nmight be like, okay well that's easy, just increase the size of that\nvolume and we could do that. But that wouldn't be the smartest thing,\nat least not the most economical thing. Increasing your volume size here cost\nmore money than it would be to do something else. And that\nsomething else is called s3. S3 is Amazon's storage service\nand it's relatively cheap. It's gonna cost you 0.02 cents or dollars. I'm not sure how to refer\nto that per gigabyte, which is about the industry standard. And they're only gonna\ncharge you for what you use. If you only got two gigabytes\nof storage up there, it's gonna cost you double of that. Now comparing that to Google\nor OneDrive or whatever it is, you'll probably get a better deal with\nGoogle and all these other companies. But if your goal is to have more control\nover your data and just have fun with Amazon, this is a pretty\ngood option. Also, if you're a company with large amounts\nof data, like large amounts of data, this will end up saving you\nmore money than Google will. And you also have the option looking at\nAmazon's price sheet of going like crazy cuz they had different storage tiers.\nIf you didn't know about Amazon s3, I was pricing you the standard tier,\nwhich is 0.023 gigabytes per month. You can go for their like\ninfrequent access tier, just stuff you wanna store that's\nmuch cheaper. Their glacier tier, like glacier tier, which\nis like crazy deep archive. Let's do the math on that. If\nI wanted to store 10 terabytes, see how many , how many zeros is\nthat? That seems right, doesn't it? No, it doesn't seem right. 10 terabytes will cost you 10 bucks\na month just to archive your stuff. That's pretty cool. And you\nhave the option of doing that. You don't have that option with\nthese other consumer level things. So I say all that to say this. We're gonna set up right now an S3 storage\nbucket and we're gonna connect that to File cloud, which is fully\nsupported. So here in aws, let's set up our S3 bucket.\nIt's actually not too crazy, but it will involve two things. First we're gonna set up an\nS3 as you probably guessed, and then we'll set up an IAM user\nfor file cloud to access that bucket. An IAM is Amazon's identity\nAccess management sounds scary, it's not. Let's do it real quick. First, our bucket\nfor s3. We're gonna go up to services, the top left here and then we'll scroll\ndown just a bit on the side until we see storage right here. Go\nahead and click on that. And for us right now we\ncare about s3. Click on s3. And this is actually pretty simple.\nFirst we'll just create a bucket, click on create a bucket.\nThe more I say that, the more I like that\nthey called it a bucket. We'll name it something for region,\nlet's keep it in the same region. We created our E C two, which for me\nwas US East one. And then from there, that's pretty much all\nwe need to worry about. We're not gonna open this up to\nthe public. Keep it all default, all protected and safe. And\nfinally down here at the bottom, we'll click on create.\nAh, my pen create bucket. We got our bucket time for the IAM user. From here we'll click on the search bar.\nWe're gonna search for it real quick. Just search for IAM. And there\nit is right there. By the way, you can use the search bar as much as\nyou want for all the things we've been doing so far. So click on iam. Ah,\nit took me outta dark mode. Okay, thanks a lot aws. And here\nwe're gonna focus on one thing, creating a new user account. So on the left here we have\naccount management or access\nmanagement and we have users click on users. And then\nover here on the bottom right, we'll click on add users. I'll\nname this hack, well file cloud, click on next, click on next once more and we'll\nclick on create user at the bottom. We're done. Not yet though.\n. We have one more thing. We have to give that user\naccount permissions to be\nable to interact and use the S3 bucket. So find your user\naccount in our list right here. There's mine right there.\nI'm gonna click on that. And here in the middle we\nhave our permission policies. On the right we have add permissions. Go ahead and click on that and\nclick on create inline policy. Now this will be really simple cause\nall we're gonna do is copy and paste. First we're gonna go back\nto our file cloud portal. And remember previously when we clicked\non download here and we chose AWS and opened up a new document\nhere for us to look at here, they're gonna have some fun stuff for\nus. If you scroll down just a bit, you'll see the table of contents and\nwe'll want to click on the last option, which is post install, expand that. And then there'll be a link right\nin the middle setting up file cloud, manage S3 storage, click on that. Whew, A lot of clicking and we're\nalmost there . Um, we're actually gonna do\nall three of these options, but we're gonna do number two first, which\nsounds very counterintuitive, I know, just stick with me here. Click on change credentials\nor configure cred credentials. And then right here where\nit says under S three key, we have the following\npermissions. Click on that. Here we have some delicious J S O N\nstarting with that opening bracket. We want to copy all of it until the\nclosing bracket or curly brace rather copy that. Go back to your AWS console where\nwe were configuring our policy and we're gonna click on J S O N. So right now we have the\nvisual edit editor selected. We're gonna click on js o n instead. We're gonna control A and then control\nV pasting all our delicious J S O N. Everything looks good there. Click\non review policy at the bottom right, we'll name it real quick. And\nthen click on create policy. And now our user account, which\nmine was hack, well file cloud. He has permissions to\nmess with our S3 buckets. So back in our file cloud\ndashboard, we have one goal here. It has to change from using the storage\nin Amazon, which is just our hard disc, our drive for the virtual machine change\nfrom using that to using Amazon's S3 file storage. Now for this we do have to get a little\nunder the hood and mess with command line, which is kind of fun. So\nlet's just do it real quick. It's not gonna be crazy. But first I'll show you what\nwe're changing here on the left. We scroll down just a little bit, we'll have settings and then\nwe'll click on settings. Go ahead and close that tutorial. And what we wanna click on right now\nis the storage section in our settings right here. Notice here in our storage settings we\ncan change the location of where we store our file cloud settings. But I don't see anything about S3\nand that's cuz we have to enable. And for that we gotta go to the\ncommand line. So let's get back to aws. This won't be scary, I trust me, it won't be scary if we get\nback to our e C two instance, which if you get back\nto your e c two service, you'll be able to get there pretty quick. Let's just go and open the settings here\non the right you'll see the option for actions and then connect cuz we wanna\nconnect to us. So click on connect. And I love this cause right here at the\nvery bottom they have an example of the command you can use to automatically\nconnect to your box with the key you downloaded if you just created that.\nSo I'm gonna copy this command, I'm gonna launch my terminal here and\nI'm gonna change my directory real quick to the downloads folder. That's\nwhere I have my, my key stored. I just downloaded it and that's\nprobably where you have yours too. So I'll do CD downloads and then\nI'll simply paste that command. And all this is doing is connecting\nto our server via SSH using our key. And it's not gonna ask us for a password.\nIt's gonna be pretty sick. Ready? Go accept all fingerprints. Yes sir. And we're in and here we're gonna\nedit one file. So with me right now, type in pseudo then we're gonna use Nano\ncause Nano is the best text editor in Linux period. Just as. And then we're gonna edit this file that\nbe forward slash var slash www slash html slash config slash cloud\nconfig dot php head enter. And we're gonna change one thing here. I'm gonna scroll down pretty much towards\nthe bottom of this file until I see this. Define Tony, do cloud\nstorage implementation. Right now it says local. We don't want\nthat. We want it to say Amazon s3. And that's what we're gonna do.\nGonna move my cursor on over, delete local and say\nAmazon S3. And that's it. We'll hit control X, Y enter to save\nand that should be all we have to do. And then one more thing, we're just gonna\ncopy a file. That's all we have to do. We're gonna type in pseudo once more. We're gonna use the CP command for\ncopy and we'll copy this file var ww html config, Amazon S3 storage config dash sample php. And we're gonna copy that file to same\nlocation. It's just gonna paste that in. But we're gonna remove\nthe sample and the dash. So where it looks just like this\nAmazon S3 storage config do php. We're not gonna change that file,\nwe just need to create a copy of it. Hit enter when we got it. Now\nlooking back at our storage settings, it looks a little bit different. We\nhave S3 options now let's configure it. So our first two options, S3\nKey and S3 C. Let's get that. We're gonna go back to our\nIAM management console. Jump into our user account we created,\nwhich for me was Hack. Well file cloud. And we'll see over here in\nthe menu options right here\nin the middle kind of is security credentials. Go ahead and click\non that. If you scroll down just a bit, you'll see a section called Access\nkeys. We wanna create one of those. So let's so click on create access key. From here we're gonna click on the little\nradio button for third party service. Click on I understand and click\non Next describe it five o'clock. And then we'll click on\ncreate access key. Done. So now this information right\nhere is what we need first. Look at the access key. I'll copy that. Go over to File Cloud and paste that right\nhere where it says S three key paste. Then we'll grab the secret access\nkey. It's a secret. Click on copy, it's copied, we'll paste it here.\nAnd the secret for bucket name, whatever your bucket name was.\nMine was Hack, well bucket. Everything else is optional. We'll click\non save S3 settings, click on. Okay, settings verified, we're good to go. We are now using Amazon S3 as our storage\nfor File cloud, which is pretty sick. So if you did this, that's amazing\n, because that was, yeah, you gotta be honest, it's kind of complex. Right now we're using Amazon as a\ncloud storage provider on the back end. Bio cloud is kind of our\nfront end and it's amazing. So let's test it real quick.\nUm, let's create a new user. Kinda our first thing to do on file\ncloud. Let's go to users on the left here, under users and groups.\nClick on add a user, it's all pretty basic stuff for\nauthentication notice we have default authentication selected by default, but you could change it to\nactive directory or ldap. You can integrate with anything pretty\nmuch. Let's put a little user in. I'll say Chuck, Chuck a\nlittle bit of password here, email address and click on Create. Now\nlet's just grab our URL for file cloud. I'll open up an incognito window, I'll get logged in with my new user\nand here we go. My home personal cloud, just like that. First of all, it's\nalready here. It's already happening. Let me add a file. I'm gonna go to my\nfiles. I'll just drag and drop something. I'll drag and drop a Dropbox. Uh,\npicture . Perfect, it's there. Now what I wanted to show you is let's\ngo to Amazon S3 real quick and let's see if we have any new objects\nin our bucket. Look at that. We have an object one I just uploaded. Now one more thing you may\nwanna do for Amazon S3 settings. So here in file cloud and our\nstorage, if we scroll down just a bit, we'll see a button that says\nwhere is it? Where to go. Oh, right here we have S3\nEncryption and Manage. We can enable Amazon S3 encryption, which will encrypt our data at rest\nand in transit between Amazon S3 and File Cloud. Our file cloud server. I'll leave the default option here\nand I'll click on enable encryption. Keeping in mind that it will encrypt\neverything currently in there. So it's best to do this. Like\nto begin with , click on. Okay and we're good. All existing files and new files\nwill be encrypted using a E S 2 56. Okay, sorry I squeaked\na bit there at the end. I feel pretty accomplished\nright now. That was pretty cool. Now at this point you do have file\nclouds set up in AWS using S3 storage, but there's probably a few\nmore things you'll want to do. Like using your own domain name,\nsetting up a legit SSL certificate. We're gonna cover that\nhere in a moment. In fact, I'll put a timestamp jump to that real\nquick if you wanna just do that right now. But now I wanna get into\nhosting this yourself on prem. Now once you have your file\ncloud CE account setup, which I covered just earlier,\ninstalling on-prem is pretty easy. And I'll show you a few different options. So here we have the option\nto download our server. I'll click on download clicking\non any of these options. We'll show you how to do\nit. I'll you real quick. How to do the docker\ninstallation, the Linux install. And for a really quick way to do this, just download the O V F and\nactually I think docker's faster. But you can download a\nvirtual machine image. They can just load up in virtual box\nalready ready to go. And then Windows. I'm not really gonna show you that\ncause that's kind of self-explanatory. All you gotta do is download an MSI\ninstaller and just go from there. It'll do it for you. So let's knock\nout the easy one first. Docker, click on docker. Really just a few\ncommands you can copy and paste yourself. So here are my Linux server or it\ncould be your Linux computer cloud two, wherever. Let's first make sure we have\nDocker and Docker compose installed. So we'll do a little pseudo a P T update, make sure our repositories are up to date. And then we'll do a pseudo\nA P T I install docker io, docker dash compose\ndash y, just like this. Hit enter little coffee\nbreak. It'll do its thing. If you have no idea what\ndocker is, check it out. I got a video somewhere explaining\nwhat it is. It's amazing. You're gonna have a great time, but you don't have to know what Docker\nis to run this. It's already installed. Cool. Now we're gonna do a couple things. First we're gonna use this w get command\nhere they have fors pulled down their Docker composed file. We'll\njust paste it in there. It pulled on the file if I'll do an\nls, there's our Docker composed file. And then it wants us to pull\nall four file cloud images, which takes a long time, especially\nfor the community version, the file cloud solar image.\nSo we're not gonna pull that. And we also don't need file cloud preview. So all we'll do is copy the command up\nuntil file cloud preview. We'll just do, we'll stop at MongoDB, which is\ntheir database. We'll copy that. Go back to our command\nprompt, clean up a little bit, type in pseudo paste that\ncommand and let the party start. This could take a minute, so just\ntake a little coffee break. Also, keep in mind that Docker, they recommend only for training and\ntesting and it's not optimized for production servers. Now does that mean\nyou can't use it in your home lab? Not at all. You probably just\nuse that all the time. It's fine. But if you're run into issues,\nthat's probably why. Okay, it actually wasn't that long. If you\ndo a pseudo doctor PS it's running, it's going. So let's see if it\nworks. Grab your IP address, navigate on out to the IP\naddress slash admin. Actually no, let's do a forward slash install\nto make sure it's all healthy. This will do some checks to make\nsure it installed correctly. Everything's running. It\ntotally is. That's awesome. Now let's go to forward slash admin.\nWe'll log in with admin and super secure. Password. Password, all\nlowercase. And we are in. So now the last thing we have to\nworry about is the license file, which looking at our file cloud\nportal, just under what we downloaded, we can say get our license, click get\nlicense and it will download for us. Just like that. Notice that to download\nthere. Getting back to our server, we'll just say choose file,\npick that license file, apply it and we're good to go. Now there are a lot of things\nwe gotta do to set this up. We'll continue that here in a moment.\nIf you wanna jump straight there, go ahead now I'm gonna cover\nthe Linux install real quick. So to install directly onto Linux, we'll click on our Linux X\n86 64 Ubuntu Deb package. It'll take us to a place where we can\ninstall it directly from our repository, which is fantastic. Now I do highly recommend you go with\ntheir recommended server os and that's UB 2 20 0 4 lts. Just do that.\nIt'll save you a headache, trust me. So go ahead and click on that. And it's simply a matter of\nadding some repositories, updating your repositories and installing\nit like that. It's that simple. So let's do it real quick. We're gonna copy all these\ncommands right here in step one, adding all the repos and\nwe'll paste that here. It's gonna update our repos done and then\nwe're going to install the Apache and Mongo DB servers. And actually I'm\njust gonna do the first two commands. We'll paste those here and then I'm\ngonna grab the command down here that'll automatically accept the ULA. And\ninstall hands free, paste that command, give it just a little bit\nof time. Quick coffee break. Now throughout the install you may hit\nthings like this and I always say install the package maintainer version. It's\nkind of annoying, just go through it. There's not too many but\njust enough to be annoying. Then right here, I'm just gonna\nsay why enter one more time. I think it was last time.\nNo look more stop it. Okay, think it's done now that should be\nit. Let's just make sure it's working. We'll do an SS dash tool pin and I do\nsee ports open. That's a good sign. I'm gonna grab that IP address and\nnavigate out there to see if it's working. Type in the IP address. We'll\ngo to forward slash install. Make sure everything's good.\nDude, things are looking great. If you get the screen, you did a good\njob and if you see how blue check marks, you also did a great job. So now we can go to forward slash admin\nafter the IP address instead get logged in with the super secret password and\nuse the name of admin then password, all lowercase. That's the stupidest combination\nI've ever heard in my life we're in. But we need a license file. Getting\nback to our file cloud portal, just click on get your license and\nit will download the license for you. Just downloaded mine, I'll choose it,\napply it. We're good to go kind of. We'll ignore all those messages\non the side. And then finally, if you wanna set up your file cloud\njust with the virtual machine image, it's super simple. You download it, yeah, spin it up in virtual box\nor E S X I or whatever. It's just pre-baked and you follow\nthe steps I mentioned previously. Go to the install full uh url, make sure\neverything's good. Then go to admin, load your file. If you're like\nI didn't, I skipped those parts, we'll just go back and watch\nthat last part. You'll get it. Now I didn't mention that all you need\nto replace the triad is a computer and an external hard drive and you'll want do\nthat because right now my server here doesn't have much storage's got\nlike 50 gigs or something like that. What I want to use is an external\nhard drive. But how do we do that? Let's set that up real\nquick. It's not too bad. And this will be specific to Linux. Now I do recommend you start out with a\nblank hard drive completely clean cuz we are gonna format it. So I'm gonna grab\nthis guy, plug him into my computer, my Linux server. So first I'll type in the command LS\nUSB for list USB and I can tell right there there's my Western Digital\nright there. I know he's plugged in. Now I'm gonna type in ls, B\nL K. I can see right here. SDB one is how he's identified on my\nLinux machine and I can tell like he's got 1.8 terabytes right there. Perfect. Now I'm gonna double check and\nmake sure he is not mounted. I'm gonna type in mount\nand I'll just do a, actually let's do a mount\npipe grip for SDB one. Nothing. So he is not mounted.\nWe're good to go there. Now we have to format our hard drive. Keeping in mind this\nwill erase everything. Hope you know that one command super easy. Pseudo M K F S will do a\ndash t. And then EXT four. This is the EXT four file system. It's I think the best You can try\nother options. But for simplicity, let's try this and\nit'll specify our drive, which will be in the dev location\non your Linux file system. And then SDB one for me. Whatever\nyou had when you did L S B L K, put it there. Go ahead and do it.\nReady, set, go. It'll take a minute. So just a little little coffee\nbreak. Formatting is complete. Now we can mount our drive. So real\nquick, I'm gonna make a new directory. I'm gonna say NK dir slash\nmnt slash file cloud. That's my new directory. I'm gonna check the permissions on that\ndirectory real quick by typing in ll and in the directory. And I can see right here that we'll need\nto allow some permissions for our users according to this stuff right here. But\nwe're gonna do this real quick, okay, will be pseudo c h mod. We'll do you for users\nplus RW for read and write. And then that new directory we just\ncreated Mount or N N T file Cloud done. Looks good so far. So\nnow we can mount our drive, our external drive and it's\nreally simple to do that. It'll be pseudo mount\nwill specify our drive, which was Dev sdd one for me. And it'll specify where you want\nto mount it in the file system, which for us we created a folder\nfor that already slash nt slash file cloud, it's mounted. If we type in\nmount, we can check that out real quick. There it is. This video has so much\nstuff. I hope you're having fun. Let's check our file permissions\nreal quick for that folder. Once more we'll do ll slash NT slash\nfile cloud, make sure everything's good. Looks like we need some work actually\nbecause the Apache service will need to be able to read and write to this directory. So let's change the permissions\nreal quick. Once more, we'll do pseudo CH mod for simplicity. Let's do a for everybody plus read\nwrite and then we'll specify our directory MT file cloud. Actually\nlet's set back real quick. Let's go back to the beginning of CH\nmod and we'll do a dash r dash capital R for recursive. Let's add that real quick. Check our permissions once\nmore things look a lot better. So now here in file cloud, let for our\nstorage path, let's change it real quick. We'll do forward slash mentee slash\nfile cloud where I have my external drive mounted. I'll check the\npath. Looks good. Awesome. Click on save. And now we've successfully mounted and\nare using an external hard drive with file cloud. Felt like a lot. Kind\nof was a lot but that's awesome. Now there's two more things I\nwanna show you with File Cloud. Two more things we wanna set\nup to make it a bit better. First I wanna get a domain\nname and SSL set up. And second I wanna show you real quick\nhow we can add a user set up our phone and everything with File Cloud and the\ncoolest feature by far mounting a network share like you're there,\nlike you're anywhere, like you can go anywhere and have this\nnetwork share mounted. It's so cool. Now this first tutorial is specific to\nAWS or if you're just hosting File Cloud externally in some other cloud\nthat's publicly accessible, it has a public IP address. We want to get that sucker a\ndomain name and enable ssl. Now for that I'm going to assume that\nyou already have a domain name and if you don't already have one, I've got other videos that'll show you\nhow to get a domain name pretty cheaply and pretty awesomely. And you're gonna\nwanna set that up with CloudFlare. These are two prerequisites\nI'm not gonna walk you through. So buy a domain name and set that domain\nname up with CloudFlare using it as your name server. Again, I've got videos somewhere around here\nfloating around that'll show you exactly how to do that. Now we'll start with our config\nand CloudFlare here in CloudFlare. We're gonna go to the DNS\nsettings of our domain. Go to records and we're going to add a\nnew record. This will be a sub domain, meaning it's gonna be network chuck.com,\nbut it'll have something before. So file do network chuck.com. I'm\ngonna call it Hack well files. And then we'll point that domain to our\nIP address in Amazon or Leno or wherever you're hosting your uh file cloud\nserver. So I'll go back to aws, grab that public IPV four address right\nhere, copy and paste that right here. I'll keep the proxy status\nenabled and I'll click save. So now hack well files.network\nchuck.com will forward to my file cloud server. But that's just half the story. We now need to set up our file cloud\nserver to believe that's its new name. That's where you can find it. Now I do\nhave a link to File Clouds guy below, but I wanna walk you through\nit real quick. First, we'll create a CSR request for File Cloud. Now if you've never done something like\nthis, get a certificate signed for ssl. It's pretty cool to walk through\nthis and learn it right now. I struggled with this so much in the\nbeginning of my career, I'm like CSR, ssl, what is that? To know this now\nis so powerful. So anyways, here what we're gonna do, we're\ngonna use this command right here, which is open SSL to generate a csr. You do wanna be logged into\nyour Amazon e C two instance, the terminal to run these commands. I'm\ngonna paste that right now. Open ssl, let's go. It's gonna ask you to do\nsome things like where do you live us, the country Code State, Texas\nCity Dallas Company Hack. Well now for common name, this\nis where you wanna put your url. So it'll be hack, well what did I\ncall it again? I don't even remember. Oh Hack Well files. Hack well\nfiles do network chuck.com. That'll be your common\nname. Your CN email address. Am I gonna do a password? Keep going and\nit's done. Now here if you type in ls, you should see a server CSR and\na server key created that csr. We want that sucker. We're gonna\ncap that server file real quick. Type in cat server dot csr, there's\nour certificate request right there. Leave that there, we'll come back in\na minute. Let's go to CloudFlare here. I'm gonna navigate over to the SSL TLS\nsection on the left and go to Origin server here. I'm gonna get my certificate signed by\nCloudFlare and then I'm gonna download that. So I'll say create certificate. I'm gonna say use my private key in csr. Right here is where we'll\npaste our certificate. If we get back to our terminal here,\nwe're gonna grab this, copy it, paste it right here.\nNow here for host names. I'm just gonna be very\nspecific and say File hack, well file z network chuck.com\nand then click create. Now leave that page there. We're gonna step forward into\nthe next steps in our terminal. I know this is kind of involved and\nother solutions are kind of automatic, but it's fun to learn\nthis manually. It is. So first thing we'll do is we'll use the\nA two e n mod command to enable SSL and Apache. So we'll copy that command,\ngo to our Ubuntu, paste it there, done next step. Now\ngetting back to CloudFlare, we're gonna grab this certificate file\nor this text. We're just gonna copy it, get back to our terminal and we're\ngonna make a new file real quick. We're gonna say nano server ct, we'll paste that certificate in\nthere, control X, Y enter to save, good to go. And then we're gonna copy and paste\nthese commands to make a new directory in Apache. We'll paste that first one. We'll copy our certificate to that\nfolder and then we'll copy our server key, our private key to that\nfolder. And then one last thing, we gotta modify our web server config\nand Apache to use this new certificate. So the file location is\nhere. Just gonna grab that. I'm gonna type in nano edit that file. I'm gonna do a pseudo\nbefore that just in case. We're gonna change our virtual\nhost right here from 80 to 4 43. And then just under document\nroute we're gonna add server name and then put in the server\nname that you set up. Mine was hack well files.network chuck.com. And then just under that we're gonna\ncopy the SSL engine on paragraph right here, paste that right there, make sure\neverything's lined up nice and neat. Then we'll hit control X Y enter\nto save and that should be it. All we'll have to do\nnow is restart Apache, which I'll just copy and paste\nthat command and we should be good. So now in theory I should be\nable to go out to hack well files.network chuck.com and that should\ntake me right to my file cloud server SSL and everything. And it\ntotally did. That's awesome. I'm gonna get log into\nthe admins one once more. And there's one thing I wanna\nchange. It says invalid server url. You wanna change that cuz as important\nas you share your files and everything, they'll have a an URL that\npeople can access it with. And if it's like 1, 2, 7 0 0\n1, that's not gonna be great. So let's change that real quick. We're gonna go to settings\nhere and here under server url. We're just gonna change it to\nhttps Hack well files.network chuck.com. It's gonna check it, make\nsure it's all good. Server's valid, save. Now before I show you the\nawesome network share feature, I'm sure you're wondering, Hey\nChuck, I did an on-prem install. How do I handle SSL and\nCloudFlare and all that? I would recommend using CloudFlare\ntunnels. It's called Cloud Flared. And I have a video right here of how to\nset that up for any service within your home. It basically allows you to open up a very\nsecure tunnel into your house through your firewall and access\nall your stuff anywhere. Easily do that here with File Cloud. I'm not gonna walk through it right\nnow cause this video's getting so long, but it's not very, very crazy different\nfrom what we've been doing here. Now let me show you real quick\nthis cool server share thing. So first I'm gonna step a new user.\nUm, this can apply to anybody anywhere, whatever installation method you\nused, I wanna set up a new user. I already had one for Chuck. I'm gonna\nadd a new one. Add. I'll say Bernard. Bernard and I'll create\nthat user. Awesome. Now I'll open up a new incognito tab, log in hack well files.network chuck.com. It's so cool, this works flawlessly.\nGet logged in as Bernard bam, I'm a new user. I got my\nown cloud ready to go. Now I can use File Cloud for my\nweb browser anywhere all the time. And it's amazing. But the\napps are what make it shine. So here on my dashboard I have the\noption to install mobile and desktop apps right here. I'm gonna click on that.\nNow here we have a few options. This first one, file cloud sync is what you would\nsee for most Cloud Drive things. It'll store your files\nboth on your computer and\nremotely and they'll sync back and forth. Pretty cool. But the\ndrive is what's really neat. , let's try that out now. So I'm gonna click drive and I'll\ndownload this for Windows. I'll launch it, install it. You know how installations\nwork. Pretty basic. I'll restart later, no big deal. And I'll\nlaunch my file Cloud drive. It's kind of hard to say File Cloud to\nget started. I'll put in my information. So I'll server's already been set up.\nI'll log in. You can set a download limit, which is cool. And then you choose\nyour mount. So I'll mount it as, let's just say L and bam,\nI'm done. Start using drive. So it gave me a little recent activity\nof how it mounted and it's, it's mounted. So check this out, take a file here,\nput it in my files, it's there. And here are my drive,\nmap drive. There it is. Now what's cool about this is I\ncan actually share it from here. I'll right click that. Click on more\noptions. File cloud, share link. I can just change my share\noptions right here within , my stinking file explorer.\nThat's pretty cool. I can say expires tomorrow. I can\nrestrict it to one download. That's, let's do two downloads and then I'll do\na password and then I'll copy that link. I'll get email notifications and people\nuse it. Let's test that out real quick. There's the password. Download the file. So that feature I don't see anyone else\ndoing. It's pretty cool. So File Cloud, community edition, you're gonna\nhave a great time. It's really fun. Set this up and let me know how\nit went for you. Comment below. And also if you're a business or maybe\nyou're thinking about pitching a new file solution to your company, the enterprise features are what kind\nof set File Cloud apart from everybody else. Like I said, educational\ninstitutions, financial government, all that kind of stuff. They\nuse this to manage their data. It's like here in governance,\nwhich is a very scary word. You can pretty much do anything you\nwant with your data monitor every bit , like you can do legal\nholds, data leak protection. You can classify your content,\nyou can put in retention policies, smart D L P, an entire compliance\ncenter for gdpr, hipaa, I T A R, . It's all kinds of\nstuff. You can do workflows if this, then that on files. I mean look at the\ntriggers I have for these workflows. The file is downloaded, the\ncomment is added. All these things, I mean every little thing you can control. And that's killer for a\nbusiness and an enterprise, not to mention you can integrate it\nwith everything. Active directory, single sign-on. You can implement\nantivirus scanning on all your data. I mean looking at the third\nparty integrations you can\ndo, of course antivirus, Salesforce Seam, reCAPTCHA,\nMcAfee, Microsoft Teams. You can even enable it. Edit\nyour files in Microsoft Office, like if you're in the portal, just\nauto open. Now that was File Cloud. And I'm now realizing that this video is\nso super long  because there was a lot we had to cover. And I think File Cloud is amazing because\nthey focus on one thing and they do it great. And that's just file\nsharing and data security. And they do that for enterprises and\nthey can do it for you in your house. That's pretty cool. So that's\nthe enterprise solution. Now let's move on to more of the home\nlab open source solution and that's next cloud. Now next cloud is\npretty popular already. You've probably already heard of Next\nCloud and setting it up is not too bad. Now my favorite way to install\nNext cloud is through Docker. They make it really easy and you can\nfind Next Cloud in a lot of places. By the way, you can run\non your Sonology and nas. You can integrate it with True nas. So\nit really is a great home lab solution. So let's try the Docker\ninstall real quick. Now, next cloud can only be installed\non Linux-based systems. Again, file Cloud is the only one I know of\nthat can go on Windows. So real quick, in Linux we need Docker. Let's\ninstall it, make sure we have it. We'll do a pseudo a P T update,\nnot update, update. There we go. And then we'll do a pseudo\nAPT install docker.io y. Now we go grab there Docker command,\nwhich you copy and paste this code. It's a simple docker run\ncommand, paste it and run. It's gonna pull all the necessary\nimages doing its thing. And that's it. Go to https, your IP address or\nyour domain name, whatever it is, port 80 80 From here you\ngot a weird password thing. You wanna copy this little\nphrase here. Kebab maturity, paste that password in there for the\nnext cloud A I login. And by the way, the reason you can't do anything else\nhere is because they didn't do a dash D for running it as a Damon for Docker.\nBy default, it's kinda annoying. Now depending on your setup, you may wanna do a reverse proxy and\nrefer to the reverse proxy documentation. I'm not gonna refer to that\nhere again because , my video is already so stinking long. But right now I'm running this on LE\nNode and LE node's already public. And I'm just gonna use the reverse\nDNS address I have for Lin node. I'll submit that as the url. Now next cloud is pretty cool\nbecause they have a ton of features, like almost too many. So they uh,\nintegrate with next cloud office. They call collab. You can do next\ncloud talk. I don't wanna do that. I'm not gonna do the office\nthing either. Turn that off, save changes and then I'll\ndownload and start the containers. It's kind of weird how they do it where\nit's like you install the installer as a Docker container and\nthen  and then it, the Docker container installs the other\nDocker containers. It's really strange, right? So that's what it's doing right\nnow. We'll wait. Okay, it's almost there. The yellow means they're starting. So\nwe're gonna wait for that to finish. Now also, while we're waiting, the other cool part about Next cloud\nis you can install it on pretty much anything including a raspberry\npie. They have Next Cloud Pie, which will work pretty well.\nNow it won't be blazing fast, but it does its thing. And also one thing you'll want to note\nwith Next Cloud as I'm watching the startup is that it's\nvery like online service, meaning it needs to have an internet\nconnection pretty much all the time to work. If you wanna like keep it closed off\non your network without any connection, I don't think it works well\nwith that. I could be wrong, but I was reading some documentation\nand that's what I found. But anyways, it looks like mine is done. Um, there's\nmy admin user name and then password. I'm gonna copy this password real\nquick. I'll click on open my next cloud. Let's get logged in, get a nice little\ngraphic meeting. This is pretty neat. And notice they try to be, they\ntry to be everything right? Um, you can like have a contacts\nand and calendar and and do notes. And you've got tasks like\nI like what they're trying to do, but also I hate it because it's like I\njust wanna manage my files and you're making this really complex. But files\nthey can manage and much like File Cloud, they have apps for everything\nand they do have a drive thing, but they don't do that Mapped\ndrive thing, which I love. Now one of the big differences between\nnext Cloud and File Cloud will be the limitations. Next cloud being an open\nsource solution and much more, you know, targeted toward home users. They\npretty much give you everything, all the features. So unlimited\nusers, you can add a bunch of apps, like lemme see all the apps, you can add\nall the integrations. It's pretty cool. And if you're a tinkerer and you love\nto just add a bunch of things to your stuff and troubleshoot things for\na while, uh, this will be fun. And with File Cloud, you're not\ngonna see all that file Cloud. You actually have a\nlimitation of five users. So if you're gonna be\ndoing more than five, next cloud might be the solution\nfor you. Unless you're a business, then you may want to really,\nreally consider File Cloud. Now Next Cloud does have\nsimilar sharing features. When I wanna share a link I can\ncontrol, like can they edit it, I can hide the download, but\nI can't limit the download. But I can do things like password\nprotect and set expiration dates, even though I'll note Hi buddy. So\npretty much the same as File File, but you can't limit the downloads,\nwhich I don't think anybody else does. So I know this video has probably\nbeen so long. I'm exhausted. I've been recording for hours. But I hope I encourage you to\npossibly kick the triad to the curb. Now I still use Google Drive and I use\nDropbox. I use 'em as backup. For me, I'm comfortable with that decision\ncause I like my data being everywhere. I don't care if they have my\nvideos, I make those public anyway. I just want them backed up in\nas many places as possible. So I use a little bit of everything.\nBut now for personal things, no I don't put everything up there.\nI like control of that. So for you, you may want to be very much in control\nof your personal data if you're a company, even more so cuz you may have a ton of\nregulations where you can't put your stuff up there. So you\nhave to have that control. So solutions like File Cloud specifically\ncan help you with the business side of things. And if you're a person who has that\nbusiness level of security and fantastic file sharing file cloud will be for you. And if you're more of a fan\nof open source, you like a\nproduct that does a lot, next cloud is really fun too.\nSo I'll leave it up to you, whichever one you think, but I just want to make sure you guys\nknow there's an option besides going with the triad. It does require a bit\nof IT knowledge but of tinkering. But we covered that here in this video. And please let me know in\nthe comments what you think, what do you use for file sharing,\nhow do you keep your stuff safe? That's all I got. I'll\nget you guys next time."
    }
}