{
    "Xv_TmtRLHJY": {
        "title": "Becoming an AI-Powered Organization with Microsoft Copilot | KEY02H",
        "thumbnail": "https://i.ytimg.com/vi/Xv_TmtRLHJY/hqdefault.jpg",
        "author": "Microsoft Ignite",
        "date_of_release": "2023-11-17T08:35:50Z",
        "duration": "PT56M23S",
        "view_count": "126398",
        "like_count": "1238",
        "comment_count": 0,
        "description": "Join Rajesh Jha, along with Jared Spataro and other leaders to see how Microsoft Copilot will unlock productivity and transform business process for everyone across functions and industries.\n\nTo learn more, please check out these resources:\n * https://aka.ms/Ignite23CollectionsKEY02\n * https://aka.ms/IgniteTeamsSessions\n\n\n𝗦𝗽𝗲𝗮𝗸𝗲𝗿𝘀:\n * Edgar Wilson\n * Kendra Springer\n * Sumit Chauhan\n * Dawn pearse\n * Meredith Kind\n * A.J. Smith\n * Alina Fu\n * Andrea Eoanou\n * Bryony Wolf\n * Keith Barnett\n * Maria Figueroa\n * Rajesh Jha\n * Jared Spataro\n\n\n𝗦𝗲𝘀𝘀𝗶𝗼𝗻 𝗜𝗻𝗳𝗼𝗿𝗺𝗮𝘁𝗶𝗼𝗻:\nThis video is one of many sessions delivered for the Microsoft Ignite 2023 event. View sessions on-demand and learn more about Microsoft Ignite at https://ignite.microsoft.com \n\nKEY02H | English (US) | Modern Work\n\n\n#MSIgnite",
        "transcript": "[MUSIC] SPEAKER 1:\nPlease welcome Executive Vice President, Experiences and\nDevices, Rajesh Jha. RAJESH JHA:\nThank you. It's fantastic to be here at Ignite\nwith you all. In my over 30 years\nat Microsoft, I've had the privilege to work on building some of the most amazing\nproducts and services. Across all that time, working on Office, working\non our on-premises servers, and leading our move to the\nCloud with Microsoft 365, I've never been more excited or optimistic for\nwhat we can do. Grounded in our mission as\nwe enter a new age of AI, that will fundamentally\ntransform productivity for\nevery individual, every organization,\nindustry on earth. It is incredibly exciting. Now, you heard Satya talk\nabout the Copilot stack, the AI architecture\nof the future. Now, we are focused on\nbringing that AI stack to Microsoft products that\nhundreds of millions of people use every single day. Now, when I started\nin the industry three decades ago, that\nwas a long time ago, graphical user interface\nwas democratizing computing by making it accessible to people\naround the globe. Millions and millions of people started to be\nable to use computing. AI is even more accessible\nand it's even more powerful. Working with you, we can transform the way work\nis done in society, letting people use natural\nlanguage to do their work. The Copilot for Microsoft 365, it's a complete system. Of course, at its heart, there are some of the most\npowerful models outside, delivered out of\nAzure OpenAI with a full safety delivered\nto the Azure Cloud. But more than that, it's about grounding this AI in\nthe user's context. What do they work on?\nWho do they work with? Their meetings,\ntheir conversations, their documents or emails, and bringing all\nof this to bear in the apps that people\nuse every day. Now, Jared is going\nto come up and share and show a lot of Copilot. But before we do that, let's spend a\nlittle time talking about the Microsoft Graph. I also want to share some\nannouncements across our apps, since these are\nfoundational elements. Let's talk more about\nthe Microsoft Graph. This is perhaps the most important database\nfor any organization. This is your data, and it powers a copilot. The graph grounds the AI in the user's context, in their\norganization's context. Now, the spirit of the\nMicrosoft Copilot is really about advancing\nthe human agency, putting the human at the center, and being grounded\nin their context. Our vision is not\nthat of an autopilot. It's really about\nletting people achieve more by having the AI\nwork on their behalf, being grounded in their\ncontext, their permissions. This is the key that\ndifferentiates Copilot in Microsoft 365 from other\ngenerative AI tools. I'm frequently\nasked by customers, how does my team get\nready for Copilot? Now, one part of the\nanswer is simple. Because your organization has\ninvested in Microsoft 365, we have already built\nyour Microsoft Graph. The time to value here with\nCopilot in Microsoft 365, it's in weeks, not\nmonths and years. Now, Satya talked about this. The Microsoft Graph\nis extensible, allowing you to augment\nthe graph that we're building with your data\nfrom other systems, your ERP, your CRM, or any of your other\ncritical business data. A Copilot can be extended\nby developers by building plugins or the recently\nannounced OpenAI GPTs. Now, we are seeing\nleading ISVs and enterprise developers\nextend the Copilot in unique and innovative ways. For example,\nAtlassian's Jira Cloud uses Copilot to provide\nquick updates on tickets, and Ramp allows financial\nservice professionals to get information\nin the flow of work. Mural is using Copilot to streamline visual\ncollaboration, and customers like\nErnst & Young have built Copilot plugins to allow\ntheir executives, in their tax practice, to quickly gather revenue data. It is an exciting time to watch this ecosystem\nthrive and grow. We talked about the\nMicrosoft Graph. Now switching gears, let's talk about the apps that\npeople use every day. Now, I want to spend some time highlighting what I\nthink are some of the key announcements at\nIgnite for the IT pros, and I'll break it\ninto three areas: Windows, Office\nand the core apps, and the Microsoft Teams. First, Windows. Now, we've been working hard to bring Windows to the Cloud\nof Windows 365. I'm proud to say that\nWindows 365 has been adopted by over 60 percent of\nthe Fortune 500 companies. Now, we recently released\nWindows 365 Boot. It's a seamless way to allow people to get\nstraight to work with Windows 365 by booting directly to your Cloud PC on\nWindows 11 devices. Now, we also know that\nin any given month, over 100 million people\nare accessing Windows as a remote desktop\nfrom a variety of devices and operating\nsystems, so 100 million. Now, all those people can use the new Windows app to\nconnect to Windows 365, Azure Virtual Desktop, and a wide range of other services, all through that\none unified app. You click the app and you're taken straight to\nWindows in the Cloud. This Windows app is\nnow available in public preview on any platform. Today, we are also\nannouncing that Windows 365 GPU support is now coming with 16\ncore configurations, makes Windows 365 ideal for high-capacity workloads,\nsuch as graphics design, video rendering,\nand 3D modeling. Now, whether you're using Windows on a Surface\nor an OEM PC, or even on an iPad\nor in the cloud, Copilot is being\nintegrated into Windows. This allows you to give your\nemployees secure access to generative AI capabilities\nwhen they are logged in with Entra ID, without worrying\nabout data leakage. Let's talk Surface. For over 10 years, Surface has delivered\ninnovative form factors, new interaction models. We recently announced\nfour new Surface devices built to bring AI experiences\nfrom Microsoft to life. We've focused on your feedback in delivering more performance, improved security, manageability,\nand repairability. From the new Surface\nLaptop Studio 2, our most powerful, our\nmost versatile laptop, to the new Surface\nGo 4, built for productivity and security\nfor frontline workers, we have the devices to support the need of diverse\ncommercial customers. Very excited about\nSurface Hub 3. It's the premier\ncollaboration device. It now runs Microsoft\nTeams Room experience. It has enhanced manageability, unlocks new ways\nfor collaboration. It can run in the portrait mode. The whiteboard now\nhas Copilot built in. Amazing stuff. Now, let's move to our\ncore apps and services, and let's start with\nSharePoint Premium. SharePoint, as you know, is the leading, most flexible content platform,\npowering experiences across Microsoft 365. Continues to grow\nfaster than ever. Today, we are excited to\nannounce SharePoint Premium, the best way to manage and\nground content for Copilot, so your organizations\ncan transform the entire content processes and knowledge management\non top of SharePoint. I also want to talk\nabout Microsoft Loop. It's an app that was built\nfor a new way of work. It's a revolutionary Canvas, seamless collaboration\nbetween people and AI. With flexible workspaces, you can take components\nand you can stay in sync across the entire\nMicrosoft 365 suite by taking Loop components and putting that into\nTeams or Outlook. Loop is now generally\navailable for Microsoft 365\ncommercial customers. Of course, Satya talked\nabout Copilot Studio, an end-to-end conversational AI platform tool that allows you to extend Microsoft Copilot to meet your organization's\nspecific needs. You can also use Copilot Studio to create and\ncustomized Copilot, not just for Microsoft 365, but you can also build your\nown internal copilots. You'll see a lot more of Loop and Copilot Studio\nlater in the Keynote. But let me first\ntalk about Teams. When it comes to Teams, the usage continues\nto grow, with more than 320 million\nmonthly active users. As Satya mentioned, we have recently introduced\nthe new Teams app. There are tens of millions of people are already using it. We reimagined it\nfrom the ground up to be faster and\nsimpler and smarter. The new apps now available,\nboth for Windows and Mac, and it's up to two times faster, while using 50\npercent less memory. We built in the features that we know are\nimportant to you, such as support for\ncollaboration across tenants and support\nfor multiple accounts. I'm also proud to share\nthat the Teams Premium, which we launched\njust nine months ago, is now serving over\n10,000 paid customers. Now, one of the\nfeatures that customers love is the intelligent\nmeeting recap, which helps you catch up\non the meetings that you missed by providing a\nsummary of the key points, the key action items,\nthe key decisions. It gets even better when\nyou use it with Copilot, because now the\nCopilot can be asked specific questions\nabout the meeting and you can get clear answers. Now, I'm excited to announce\nthat we are integrating this intelligent meeting\nrecap into Copilot, making it available\nto more customers, whether you start\nwith Teams Premium or you start with Copilot. Satya talked about Mesh. Very excited that\nMesh is going to be generally available\nin January 2024; it's available in preview today. With that, Teams\ncommercial customers will be able to easily join an immersive experience in any Teams meeting right\nfrom the ViewSwitcher. Satya talked about how Mesh is also a tool\nthat allows you to create really immersive events in Teams Premium without\ndoing any coding. You can customize 3D spaces with images, videos,\nscreen share. You can save them as a\ntemplate, you can share that. You can also host Q&A\nsessions with attendees. People can raise their hands. It can be seen and\nheard by everyone. Now, switching back to Copilot, and before I hand it to Jared, Copilot for Microsoft\n365 is built on top of Microsoft's\ncurrent commitments to data security and\nprivacy in the enterprise. There is no change to\nthese commitments, anything that the Copilot\ndoes is in compliance with GDPR and EU data boundary\ncommitments we've made. Of course, none of the\nCopilot data is used to train LLMs and Microsoft does not have access to\nany of that data. But beyond that, the\nCopilot in Microsoft 365, it supports sensitivity labels, it understands conditional\naccess policies, it respects information\nbarrier, business rules. It supports eDiscovery; it supports the retention\npolicies that you define. It generates audit\nlogs and much more; it is enterprise-grade. (applause) Now, one feedback we\nheard from you in the preview phase, as we\ndid the Copilot preview, is that customers\nhave scenarios, you have scenarios\nwhere you want to use the Copilot in\nTeams meetings, but you do not want to\nnecessarily be able to record or transcribe meetings due to data retention policies. We heard you. In response\nto that feedback, I'm happy to announce that\nthe Copilot can now be used during a meeting without\nretaining the transcript. (applause) Admins can now give meeting organizers the ability\nto set their preference. Before the meeting starts, allowing you to ask\nthe Copilot questions during the meeting\nand ensuring that no transcripts or\nCopilot interactions are retained after the meeting. Privacy, security, transparency, they aren't just features, they are prerequisites and\nwe take them very seriously. Now I want to hand\nthings over to Jared Spataro to share more\non our Copilot announcements. But before I do, let's see the Copilot in\naction with Dentsu, a global network of marketing and advertising\nagencies. Let's roll the video. [MUSIC] JAMES THOMAS:\nDentsu Creative's mission is all about enabling modern creativity powered\nby data, tech, and AI. One of the biggest\nchallenges today for clients and marketers, is they've got to create\nmore content than ever on an ever-growing\nnumber of channels. Copilot is really\nrevolutionizing our creative workflow. Typically with a client, we would come up with ideas and we'd go away and maybe days, weeks, even months later, we come back with\ncreative visualizations. With Copilot, we can actually do that while we're in the\nroom with the client. Copilot is able to plug it into our own custom applications,\ncalled Digital Interact. We have literally hundreds\nof thousands of assets. We can now search with more natural language,\nall within Teams right in the\nheart of our workflow. EMMA LAND:\nOne of the key activities and time saving things Copilot\ndoes for me is translating initial key\nmessages into a first draft, that is saving at least\n30-60 minutes of my time. Now, we're a 72,000\nperson organization. It's a huge resource savings. It enables our people to get back to what\nthey're brilliant at: driving the storytelling\nwithin brands. Now I've used Copilot, I can't imagine a\nworld without it. It is just a necessary\ntool for me day-to-day, and I depend on it. (applause) JARED SPATARO:\nWell, good morning, everyone. Good morning. Thank you again so much\nfor being here at Ignite. It's great to be back in person. Let's talk Copilot, shall we? As Satya said, Microsoft\nis the Copilot company. There will be one\nCopilot experience that runs across\nall our surfaces. Understanding your context\non the web, on your PC, and when you're at work, to\nbring the right skills to you when you need them,\nacross work and life. Copilot really broke\nthe mold of how we design and build\nproducts here at Microsoft. The customer excitement\nand demand has been unlike anything we have ever\nseen or experienced. On November 1st, we made Copilot\nfor Microsoft 365 generally available to\nenterprise customers. From introduction to\ngeneral availability in just eight months. It is truly unprecedented. (applause) Customers are already\nstarting to bet on Copilot. KPMG is a Copilot company. BP is a Copilot company. Visa is a Copilot company. Pfizer, Honda, Dow, they\nare all Copilot companies. Accenture is all in on Copilot, with the\nlargest commitment to date across Copilot, from Microsoft\n365 and GitHub Copilot. Every customer I talked\nto about Copilot, and I've talked to a lot over the course of the last eight months, has just one question, Jared, is Copilot worth it? After months of\nintensive research, I'm excited to share new work\ntrend index data, out today. We conducted quantitative\nand qualitative research, from surveys to empirical studies, to\nreally get in and understand the impact of\nCopilot among our early users. Here's the headline,\nCopilot makes people more productive\nand more creative. In fact, 77 percent\nof people who use Copilot told us that they just don't want to go\nback to working without it. Here's some more stats for you. Seventy percent said that\nthey were more productive; 68 percent felt it improved\nthe quality of their work. Sixty-four percent spent\nless time processing email; 75 percent spent less time searching for\ninformation in files; 71 percent saved time\non mundane tasks. We didn't just take\ntheir word for it. Based on quantitative\nresearch studies, we found that overall,\nusers of Copilot were nearly 30 percent faster on\na specific wrap of IW tasks, 30 percent faster, and they\ncaught up on missed meetings nearly four times faster than those who\ndidn't have Copilot. We even asked employees if\nthey'd rather have access to Copilot or a free weekly lunch, 77 percent chose Copilot. (applause) Finally, my very\nfavorite finding, the best Copilot users saved more than 10 hours per\nmonth using Copilot. Just think about what\nyou would do with an extra 10 hours each month. Now, all this is after using Copilot for\njust a short time; it's only going to\nget better from here. To be clear, Copilot is\nnot perfect, by any means. Those of you who are using it, see it do amazing things, but it also makes mistakes. It's getting better,\nthough, every day, delighting us with\nflashes of brilliance and inspiration, and if the start is any indication\nof what is to come, it's clear that the Age of Copilots has arrived.\nLet's take a look. [MUSIC] JARED SPATARO:\nAre you ready for that? (applause) We've been innovating\nfaster than ever before to bring Copilot to our\nentire product portfolio. But we have heard your feedback\non a number of things. It can sometimes be hard to make sense of everything that we have announced and released so\nquickly and let's be honest, simplicity in naming, well, they haven't always\nbeen our strong suit. Anyone else remember\nWindows XP 64-bit edition for 64-bit extended systems, just rolls off the tongue. Let me take a moment to walk\nthrough the product lineup. It all starts with\nMicrosoft Copilot, your everyday AI companion\nacross work and life. As Satya mentioned, Bing Chat\nhas simply become Copilot. Now, Copilot has\nfoundational capabilities like the ability to answer\nquestions, to create content, to reason over data, and it has web grounding so it always has access to the\nlatest information. Now here, there's one other notable thing that I\nwant to highlight, just as you've heard before, but I just want to make\nsure you understand how it happens, when you\nsign into Copilot, Microsoft Copilot, with your Entra ID, commercial\ndata protection is automatically activated. That means that you can\nuse Copilot at work, knowing that your\nbusiness data is always protected. With commercial\ndata protection, chat data isn't saved, Microsoft has no eyes on access, and your data is never used to train the models, and\neverything you see here is free for commercial\nand consumer customers. Now, let's take a look at\nCopilot from Microsoft 365. It includes those same foundational capabilities\nand web grounding. It has the same commercial\ndata protection promises. But Copilot for Microsoft\n365 takes it a step further. Like Rajesh said, Copilot for\nM365 is enterprise-grade. It inherits your\nexisting M365 security, privacy, identity, and\ncompliance policies. Your data is logically\nisolated and protected within your M365 tenant, and you\nare always in control. Copilot doesn't change any of our data residency or\ndata-handling promises. Copilot acts on behalf of an\nindividual user, so it can't access information that you\ndon't have permission to see. But what makes Copilot\nfor M365 so different, as you've heard already,\nis that Microsoft Graph, it has access to your\nentire universe of data at work and of course, it's integrated\ninto the M365 apps that millions of\npeople use every day. It's this combination, this\namazing combination of the Graph, on one\nhand, and the apps, on another that makes M365 Copilot such a powerful AI\nassistant at work. Now that we've gone through\nthe product lineup, let's just take a look\nat what that looks like in the product experience. To fire up Copilot, you just simply go to\nCopilot.Microsoft.com. Here, as you've heard, you\ncan shop, code, analyze, create, plan trips, and more. When you sign in with your Entra ID, commercial\ndata protection is on, automatically activated. Remember, that means\nchat data isn't saved. Microsoft has no eyes on access. Your data isn't used\nto train the models. Now, on to Copilot\nfrom Microsoft 365. To do that, you just switch\nthe toggle from web to work. Now, let me tell you,\nthis Copilot experience has completely changed\nthe way I work. One task that I now delegate to Copilot is just figuring\nout where to start my day. With a simple prompt, you can get an overview of\nwhere you're mentioned to see what projects need your\nattention, and in this case, three things to prioritize. It combs across\nyour business data to give you a summary organized by emails and chats, and\nsuggests what to prioritize. Of course, like all\nthe interfaces, it includes citations\nso you can quickly verify and cross-\nreference those results. Now, we've integrated\nCopilot right into Windows, so, each of the Copilot\nproduct experiences you just saw is also\navailable to you, right from your\nWindows taskbar. Magic. We are really excited about what we just\nshipped on November 1st. But the great news is,\nwe're not stopping there. There is so much more to come. Let me hand it over to\nmy very good friend, Sumit, to show you\nwhat we mean. Sumit. SUMIT CHAUHAN:\nThank you, Jared. I'm so excited to tell you about two areas where we are working to make\nCopilot even better. The first is personalization. Earlier, you heard Rajesh\ntalk about the Graph, which is so critical in delivering these\nkinds of experiences, and the response from\nearly users to Copilot has been nothing\nshort of amazing. But they want Copilot to be more personalized, to know how\nthey write their emails, who they work with, and how they like to\nreceive information. We are excited to introduce\nnew capabilities to help Copilot really know and remember these important\npersonal details. Let's start by\nimagining you work for a retailer and you're preparing\nfor a business review. You need to gather the\nlatest sales results from stores in the\nNorthwest region and there's an\nemail on the topic. You use Copilot\nto draft a reply. Now, what Copilot does, it analyzes your previously sent emails to\nreally understand your unique style and tone\nand then it will take that and apply it to the email so\nit really sounds like you. (applause) Now, let's say the team needs to meet on this topic. Copilot can help there too, based on all your recent\nwork and updates, starting with the\nname of the meeting, and because Copilot understands the context of your meeting, it can accurately suggest\nwhich colleagues to invite. It's really acting as\nyour personal assistant, quickly finding a date and\ntime that works for everyone. It can even book\na conference room for those in the office. It doesn't stop there. Copilot will also suggest\nrelevant files to share as a pre-read, based on\nits understanding of what you are going\nto be talking about. Because it has all the context\nabout why you're meeting, it generates a customized\nagenda to help you get what you want\nout of the conversation. (applause) Yeah, you're really\nready for that meeting. We're giving you more\ncontrol to ensure every Copilot\ninteraction includes tailored responses based on\nyour unique preferences. For example, in Word, here you can specify details about your job, your\npersonal preferences. Maybe the fact that\nyou prefer graphs over tables, or you like bullets\ninstead of paragraphs. The thing is these preferences will follow you\nacross all your core Microsoft 365 apps, so personalized\nexperiences are going to show up wherever you go. Now, let's say you're pulling together a quarterly\nbusiness update. You want to include the latest quarterly\nbusiness results, but maybe it's buried in a coworker's PowerPoint\npresentation somewhere, but with just a simple\nand generic prompt, Copilot understands\nwhich coworker and which deck\nyou're thinking of. It finds it, it summarizes it, all without\nleaving your document. There you go. All the\ncontent you're looking for. The personalization\ndoesn't stop there. It's even delivered just\nthe way you like it, a bulleted list with the\nfinancial details in a graph. (applause) Now, Copilot can also\nhelp you ensure that everything you create is\ncustomized to your organization. Let's say you need to edit a\nslide for this presentation. Copilot can now\npull in images from your brand or corporate\nimage library. Soon, thanks to\nMicrosoft Designer, you can use DALL-E 3 to combine your corporate assets to\nfit your creative vision. That great idea that's sitting\nin your head comes to life in seconds, no\nphotoshoot required. (applause) That's pretty powerful stuff. What Copilot did was it\npulled an image from your brand library and\nwith a simple prompt, you were able to customize it to be exactly\nwhat you needed. In September, we introduced Copilot Lab to help\neveryone build new habits to get the most out of Copilot, directly within\nMicrosoft 365 Apps and every user of\nCopilot for Microsoft 365 has access to\nCopilot Lab today. You can easily discover\nprompts right in the flow of work and learn how to turn a good prompt\ninto a great one. We've learned from early users that there is a viral\naspect to Copilot. Giving it to one\nperson is not as impactful as giving it\nto the entire team. Copilot Lab is where you'll connect with coworkers to save, share your favorite prompts,\nand get inspired as you all learn to work together\nin this whole new way. Let's move on to the\nsecond theme, math. Now, everyone knows LLMs are\nnotoriously bad at math. There are some hard\nproblems to solve when it comes to LLMs and numbers, and we've got some of the world's brightest\nengineering minds working to tackle\njust that challenge, and we've made phenomenal\nprogress with Excel. In March, we taught\nCopilot how to speak Excel, which essentially means\nCopilot can generate formulas. It also means that\nCopilot can do math, and it can do\nit pretty well. Let's say you're a buyer for the outdoor clothing\ndivision and you'd like to know the top-selling\nrain gear products. Copilot taps into your\nhistorical sales data, clearly highlighting the\ntop sellers in green. Now, let's say you\nwant to compare the monthly sales data over\ntime, but to do that well, you really need a pivot table,\nand Copilot can easily create a pivot table to add to your workbook, summarizing\nthe raingear sales. Now you're curious, how did\nrainfall in the region over the last three years affect\nsales in that time period? Ask Copilot to find the\nrainfall data on the web, add it to your worksheet. But we didn't stop there. We taught Excel how to execute Python code, and then we taught Copilot\nhow to speak Python. Now, with natural language, you can do remarkable things. In order to work with\nthe sales and rain data, we've created two data frames,\nusing Python in Excel. Now, we simply ask Copilot to combine these data\nsets and Copilot knows when to use Python in Excel and it writes\nthe code for you. It even explains the\nformula it uses. You don't need to be a\ndata analyst to be able to tell a compelling story\nwith these numbers. Next, simply ask Copilot to visualize the relationship\nbetween the data. Here, it uses advanced\nanalytics to create multiple plots, so you can see the trends and make\nbetter decisions. Just look at these rich visuals. With Copilot and\nPython in Excel, anyone can create\nthese complex graphics with a simple prompt. (applause) Jared touched on how Copilot has changed how we design and\nbuild products at Microsoft. The feedback loop between customers and product makers\nhas never been tighter. It's enabling us to quickly take what we are learning from our customers and\npour it right back into product development,\nfaster than ever before. We are so excited\nto see what you do with it. Back to you, Jared. JARED SPATARO:\nThank you, Sumit. Thank you very much. (applause) It's coming fast and furious. Now, Sumit shared\nhow we're improving Copilot with investments\nin two areas, again personalization and math. Really amazing. I'd like to take a moment now\nto show you a third. Up to this point,\nwe've talked about how Copilot is your copilot. It knows you. It\nknows your data, your content, and your context. It is personalized to you. But what happens\nwhen Copilot becomes a full participant in your work, when it joins your meetings, when it participates\nin your brainstorms, when it contributes\nto the conversation? When you give Copilot\na seat at the table, it goes beyond being\nyour personal assistant to assisting the entire team. Copilot will facilitate human interaction\nand the exchange of ideas in ways that we've\nnever experienced before. Now, customers\nalready tell us that Copilot is changing\nmeetings for the better, freeing people to\nbe more present and engaged in the conversation. But now it can help the entire team get the\nmost out of meetings. It's like that well-\norganized colleague that takes detailed notes, tracks decisions\nand action items, and helps steer the\nconversation. Let me show you. Now in Teams meetings, Copilot can take comprehensive, real-time notes that\nthe whole team can see, letting everyone focus\non working together. It pulls information and\ntasks and summarizes next steps while the meeting\nis in progress. When Copilot doesn't\nquite get it right or it misses something that\nyou think is important, you can steer it in the right direction and keep everyone focused on\nwhat matters most. Copilot is truly\ntransformational as an AI-powered\nassistant in meetings. But man, it gets even better as a collaborative\npartner with Whiteboard. Copilot is already great. It's summarizing what\nhas been discussed in a meeting and it can now visualize the ideas talked about in your meeting on a\ndigital whiteboard. It can categorize, sort, and even give you\nnew ideas, adding to the energy of\nthe conversation. Copilot can also generate a detailed summary of the\nWhiteboard to share out. Anyone in the meeting,\nremote or in person, can add ideas to the mix. Of course, the Surface\nHub 3, shipping next month, can bring employees together no matter\nwhere they are. Now from Whiteboard,\nover to Loop. We just showed you some\nof what Loop can do, but let's take a closer look. Loop is your flexible AI-powered\ncollaboration canvas. It really is the first app\nthat we've designed from the ground up for collaboration. It updates in real\ntime, so you can collaborate no matter where you or your teammates\nare working. As your project evolves, you'll just always be in sync. It gets even better\nwith Copilot. Loop's workspace status is\nlike a dashboard, tapping into the collective knowledge\nof your team to help you stay two steps ahead. It allows you to track the\nwork that the team has done. It even flags important\ninformation, like upcoming deadlines, to help you know where you should focus. Now, in Loop, Copilot\nisn't just your copilot, but it can help the whole\nteam create together. You can give it instructions\nand so can your colleagues. Everyone can see and build\non each other's prompts, brainstorming together to\nfind the best solution. Copilot helps make\nsense of it all, helping your team\nget to a result that you never would have\nthought of without it. Now, I think it's worth\npausing there for a second. What you just saw is people, working with people,\nworking with Copilot. This really is a brand-\nnew pattern for work, an entirely new way of working together. Let's switch gears. You heard Rajesh talked about the Copilot's ability to tap into the wealth of information that is in the Microsoft Graph. But let's face it, not\nall your data lives in the Microsoft Graph,\nwithin Copilot's reach. What if you were able to give Copilot access to\ntruly all your data, your CRM, your ERP, your finance, your HR systems? What if you could give\nCopilot the keys to unlock that treasure trove of\ndata and information across every line of business? Well, now you can. I am thrilled to introduce\nyou to Copilot Studio. Copilot Studio is a low-code\ntool that does three things. First, it allows you to connect Copilot to\nother data using either pre-built or\ncustom plugins and GPTs. That just means that\nyou can tap into any system of record, including your custom\nline-of-business systems. Second, it enables you to\ncreate and orchestrate very sophisticated logic,\nessentially to create workflows. Third, you can manage it all so that IT always stays in control. Now, at this point, I hope you get what\nCopilot will mean to personal productivity, check. But take a moment, there is a bigger opportunity\nhere in front of us. We see an AI-powered business\nprocess reengineering wave that will sweep over every organization\nin every industry, and it all starts\ntoday, right here. Let's take a look at\nhow it actually works. It all starts with a\nprompt in Copilot. The orchestration layer\nlooks for metadata triggers. For example, it can look for questions that would\nbe best answered by your CRM system\nor your HR system. It then sends a query out to both the Microsoft Graph and\nthe right system of record. It gathers the responses\nfrom both places, packages them up, and\nsends it over to the LLM. The LLM then reasons\nacross the prompt and the additional information and produces a response\nthat's like magic. Copilot Studio is the low-code\ntool that allows you to create plugins and GPTs using connectors and\nsophisticated logic. Get this, it comes\nwith more than 1,100 pre-built connectors, from\nAdobe, to SAP, to Zendesk. But seeing is believing, so let's bring Kendra out\nto show you more. Kendra. KENDRA SPRINGER:\nThanks so much, Jared. Hey, folks. Let's take\na common example. Travel budgets and expenses, a process that is unique\nto every organization. Here we are in Copilot Chat. Now, you've seen\nCopilot quickly and easily summarize documents,\nlike this travel policy. But what if you\nwanted to know more, like how much of your team's travel budget is left for the rest\nof the quarter. Now, Copilot will find the information in\nthe Microsoft Graph, but that's only going to\nget you so far, because the data you're looking for is living in a\nsystem of record. Now, with Copilot Studio, you can customize your\nCopilot to access data from first and\nthird-party sources. Just start by giving your topic a description for what\nyou want it to do. In this case, providing richer details on\nexpense questions. Copilot Studio allows you to\ntap into any data source, including websites,\nAzure services, and coming very soon, you can even access and use OpenAI's GPTs right from\nwithin the Copilot Studio. With over 1,100 out-of-the-box\noptions to connect, you can steer your Copilot\nto the right information. In this case, SAP. Since the travel policy\nis on SharePoint, you can connect\nthat too, so Copilot can keep track of\nany policy updates. As you can see, we're giving Copilot\ninstructions to let the model know how to\ngenerate responses. Once you've completed\nyour customization, you just hit \"Publish.\" The best part, IT only\nneeds to build this once. Then it can be reused across the organization and you can manage it all in\none central place. Now, let's go\nback to the chat to see how Copilot\nhandles your question. You use the same prompt, and just like that, your new customized Copilot gives you the answer\nyou were looking for. Now you know exactly how\nmuch budget is remaining, and thanks to the data\nyou just connected, you also know that\nany new travel needs to be booked before December\n30th to stay within policy. Now I just want to\npause here for a moment and recognize how\namazing this is. With just a few clicks, you can bring the power of\ngenerative AI together with any data source you want and\ncustomize the responses. Something that would\nhave previously taken months happens in just minutes. The possibilities\nfor what you can create here are truly limitless. Back to you, Jared. JARED SPATARO:\nThank you, Kendra. Thank you so much. Well done. Amazing stuff. (applause) We really are at the start\nof a business process reengineering wave,\nand we believe that Copilot Studio\nwill power it. Now, we want every customer\nto have this capability, so I am very pleased to take this moment to announce\nthat Copilot Studio will be included in\nCopilot for Microsoft 365 at no additional cost. (applause) Copilot Studio is generally available today and that\nintegration you saw with Copilot from Microsoft 365 is available in\npublic preview today. You can get started immediately. We just showed you how can use Copilot Studio to customize Copilot for\nyour organization, But there are functions\nthat are core to nearly every organization. Those are things like sales, customer service,\nHR, and finance. For those, we are creating role-specific Copilots so you don't have to start\nfrom scratch. Earlier this year we\nintroduced Copilot for Sales. It's early days, but\nit's already making a difference for our own\nMicrosoft salespeople. In some studies that we've\nrecently run with them, 79 percent of those\nMicrosoft sellers say Copilot for Sales reduced their\nadministrative workload, 68 percent said\nthat they can keep their CRM up-to-date\nwith less effort, 67 percent are able to\nspend more time with their customers, and\n64 percent said they can better personalize\ntheir customer engagements. That's gold. Copilot for Sales combines all the capabilities\nof Copilot for Microsoft 365 with seller-specific\nplugins and skills, and it meets salespeople where they are,\nright in the flow of work, including in Teams\nand in Outlook. Copilot for sales works with any CRM system to enhance\nsales productivity, build stronger customer\nrelationships, and ultimately, help\nthose salespeople to close more deals. Let me tell you, sales\nis just the beginning. Today, I'm excited to announce\nCopilot for Service. Now, we all know that\ncustomer service agents have a very hard job. They're on the front\nlines with customers every day and they hear\nboth the good and the bad. What they do can make all the difference in keeping\na customer or losing them. The experience they\ndeliver and in particular, how fast they can get the answers to solve a\ncustomer's problems. Boy, that really,\nreally matters. I'm pleased to welcome\nEdgar to show you more. EDGAR WILSON:\nThanks, Jared. Thank you. Copilot for Service\ngoes to work as soon as your customer\nreaches out for support. Looks like the tent she\nordered arrived damaged and she needs it for a\ncamping trip this weekend. In seconds, Copilot gives you the right\nknowledge-based articles from your CRM solution, which, in this case,\nis Salesforce. This lets you take action\ndirectly within Outlook. With Copilot, agents can give every customer\npersonalized support. With the click of a button, Copilot drafts a response for the customer to\nresolve the issue. You can adjust the tone\nof the message to match the urgency, and customize it. You can offer a meeting\ntime and add or revise details that maybe\nCopilot didn't quite get right. On your customer calls, Copilot is also at the ready. It works wherever\nyour agent does, including their agent desktop, and helps them answer customer\nquestions in real-time. It sources information from both internal and external\nsources, like SharePoint and Salesforce, to bring up\na concise summary of what you need to know, and with all the\nquestions answered, you can leave your\ncustomers feeling happy and well-informed. After the call, all you need to do is confirm the\nchanges and send the shipment and\ndelivery details for your order. Back\nover to you, Jared. JARED SPATARO:\nThank you, Edgar. When it (applause) comes to customer service, it's all about resolving\nproblems quickly, improving customer satisfaction, and reducing case-handling time, so you can help\nthat next customer. More than 11,000\ncustomer service agents at Microsoft are\nalready using Copilot for Service, and we are\nseeing great results, including a 12 percent\nreduction in average case handling time and a\n10 percent boost in case resolutions that don't\nrequire talking to a peer. This is what we mean when we\nsay Copilot will transform business process for every\nrole and every function. Copilot for Service will be\navailable in public preview next month and generally\navailable early next year. The future of work, clearly, is AI-powered and data-driven and Microsoft Viva is the measurement and\ntransformation platform for the AI-powered\nhigh-performance organization. It allows you to iteratively\nimprove performance, using both qualitative and\nquantitative measures over time. One place that we're\nalready applying this data-backed\napproach is Copilot. Introducing the Microsoft\nCopilot Dashboard, powered by Viva. We want every\norganization to realize the full benefit of\nCopilot and we're going to help across\nthat entire journey of transformation; that\nincludes readiness, adoption, and measurement. First, every\norganization needs to get ready for Copilot and we'll help you to understand who's eligible and what\nroles to prioritize. Second, we'll help you\nunderstand how adoption is progressing and help you get that usage intensity\nflywheel going. Now, we know from early users,\nthis is a whole new way to work, and it takes commitment to form new habits and\nbuild the muscle. We'll help you understand\nhow people are using Copilot across the apps, from meeting summaries\nto content creation. Third is measurement. You've seen a lot of great data today already on how\nCopilot is helping to improve productivity and\ncreativity, and we're going to help every organization get\nthat same level of insight, giving you qualitative and quantitative measures\nof impact of Copilot over time, across every\npart of the organization. Get this, you'll\nbe able to survey your employees to get\ntheir feedback and then compare those results\nagainst global benchmarks, helping you understand\nthe favorability of Copilot across employees. We'll give you a view into changing work patterns and behaviors across key workflows. Things like meeting\neffectiveness, content creation, and\nemail processing. You'll be able to see\nhow work patterns differ by role, like managers and individual\ncontributors, by function, and even between Copilot\nusers and non-users. This dashboard will start\nrolling out in preview to Microsoft 365 customers\nlater this month. That is our product lineup. Wow, we have covered a\nlot of ground here today. Before I hand it back\nto Rajesh to close, I want to bring us back\nto where we started, with that one question, is\nCopilot worth it? You've seen the product;\nyou've seen the data. But what the data can't convey and what I find to\nbe most striking after personally using Copilot\nfor 10 months on the job, is this sense of wonder and possibility with this product. It's the feeling of having an assistant that\ndeeply understands you and understands your work, and every day having\none of those, \"Man, I can't believe it can\ndo that\" types of moments. The coolest thing for me\nis that this new age of machines ultimately is going\nto make work more human, helping all of us\nto find more joy and fulfillment in\nthe work we do. I am so excited for you to\nexperience it for yourselves. Thank you. Now, back to Rajesh. (applause) RAJESH JHA:\nThank you, Jared. It's amazing to see the innovation\nin the news. There's just so much\nopportunity to empower individuals, reinvent\nbusiness processes. Well, let me take it back\nto where Jared started. As I think this crystallizes\nthe moment for me, 77 percent of the\npeople who have Copilot don't want to go\nback to working without it. 77 percent. I joked in my intro about my tenure in the industry, 30 years, it's been a long time. I was reflecting\nrecently on some of the similarities\nbetween now and then. When I started, people\nwould line up at retailers to buy physical\ncopies of Windows and Office. Yes, you used to be able to buy physical media, and as I\nreflect on where we are now, I don't recollect\nanother time where there's been this amount\nof excitement, and crucially potential for us all to work together\nand deliver on this moment that is transforming productivity\nfor individuals, organizations, and\nindustries, every industry. When I see you at\nIgnite next time, I'm convinced there will be nobody that is going\nto be wanting to use any productivity tool that does not help our\nhuman agency with AI. We can liberate\npeople to do what humans can uniquely\ndo and put simply, just take the grind out of work. This is our\nopportunity and we are proud to be your partner\non this journey. I hope you enjoyed\nday 1 keynotes, and have a great time\nat Microsoft Ignite. It's a wonderful opportunity to connect with experts\nin your communities. Let's close with\nbringing it back to people and one of\nour customers, Bayer, a global leader in pharmaceuticals,\nover 160 years of innovation that\ncontinues today with their embrace of Copilot\nfor Microsoft 365. But before the video, let me finish by simply\nsaying, thank you. Thank you for spending your\ntime with us here at Ignite. Thank you for your partnership, your business, your feedback. But most importantly, thank\nyou for the trust you place in us each and every day. Let's roll the video. Thank you. CHRISTOPH SIEGER:\nEvery single day we are helping farmers on the fields. We're helping to cure diseases, and we're helping our\nconsumers get healthier. We really want to be at the\nforefront of innovation. Microsoft Copilots gives\nour employees more power, more freedom to focus\non our mission, health for all, and\nhunger for none. SARAH LEWANDOWSKI:\nWe actually experience that the employees can get to\ntheir information faster. In our journey of generative AI, we have over 700 use cases across all divisions\nand functions. We really see the big impact. FLORIAN HAESE:\nPreviously, it could easily take you days, if not weeks, to find that\npiece of information. Having the model store integrated into\nMicrosoft Teams and Microsoft Copilot\ncan immediately filter out models\nthat are relevant. CHRISTOPH SIEGER:\nLast week, I received an email with five attachments,\n20-50 pages each. Then I asked Copilot,\ngive me a summary, and the summary saved me 45 minutes. SARAH LEWANDOWSKI:\nIt is great that we can leverage 150 years of data, making general AI a really great possibility\nfor creating value. [MUSIC]"
    }
}