{
    "Y38qRYYAwAI": {
        "title": "Home Assistant Setup Made Easy: The Ultimate Guide",
        "thumbnail": "https://i.ytimg.com/vi/Y38qRYYAwAI/hqdefault.jpg",
        "author": "Crosstalk Solutions",
        "date_of_release": "2023-04-14T16:00:09Z",
        "duration": "PT33M5S",
        "view_count": "407209",
        "like_count": "6390",
        "comment_count": "230",
        "description": "Are you tired of managing multiple apps to control your smart home devices? With Home Assistant, you can take control of all your IoT devices in one place. From smart bulbs and switches to robot vacuums and thermostats, Home Assistant allows you to easily monitor and control all your devices from a single platform. Say goodbye to the hassle of managing multiple apps and hello to the convenience of Home Assistant.\n\nIn this video, I'll guide you through the process of installing Home Assistant on your preferred platform - whether it's a Raspberry Pi, virtual machine, or Docker. Once we have Home Assistant up and running, I'll show you how to configure one of your IoT devices and set up a basic automation. This will give you a solid foundation to build upon as you dive deeper into the world of Home Assistant. By the end of this video, you'll have the knowledge and skills to take control of your smart home devices and streamline your daily routines.\n\nStep-by-step written instructions:  https://www.crosstalksolutions.com/home-assistant-the-ultimate-setup-guide-a-step-by-step-tutorial/\n\nHome Assistant:  https://home-assistant.io\n\nTimecodes:\n00:00 Intro\n01:11 Home Assistant overview\n02:23 IoT Network Infrastructure\n03:55 Home Assistant Installation onto Raspberry Pi\n07:39 Home Assistant Installation into a Virtual Machine\n15:01 Home Assistant Installation in Docker\n21:24 Home Assistant Initial Setup Wizard\n22:41 Home Assistant Dashboard Overview\n24:18 Adding Devices\n27:31 Creating an Automation\n31:58 Final Thoughts\n-------------------------\nBuy me a coffee!  https://ko-fi.com/crosstalk\n\nCrosstalk Discord:  https://discord.gg/crosstalksolutions\n\nFollow me on:\n- Twitter:  https://twitter.com/crosstalksol\n- Facebook: https://fb.me/crosstalksolutions \n- Instagram: https://instagram.com/crosstalksolutions\n- TikTok: https://www.tiktok.com/@crosstalksolutions\n- LinkedIn:  https://goo.gl/j2Ucgg\n\nCrosstalk Solutions - RECOMMENDED PRODUCTS:  https://crosstalksolutions.com/recommendations/\n\nAmazon Wish List:  http://a.co/7dRXc67\n\nCrosstalk Solutions offers best practice phone systems and network/wireless infrastructure design/deployment.  Visit https://www.CrosstalkSolutions.com for more info!",
        "transcript": "Home Assistant is one of the best ways to automate your home. It allows you to bring together all of those various IoT devices, such as your smart bulbs and smart switches, robot vacuums, thermostats, and more, into a centralized interface that gives you full control of all the things. In this video, I'm gonna make your life easier and show you how you can create your own Home Assistant server from start to finish, so that you can dive deep down that rabbit hole of Home Assistant automations. Let's get started. Did you know that Crosstalk Solutions is a full-service voice over IP provider? Is a full-service voice over IP phone system provider. That's right, team of VoIP experts who are ready to help your business implement the most robust, cost-effective voice over IP phone system solutions. From system design to installation, configuration and support, Crosstalk Solutions is a one-stop shop for all of your VoIP needs. So visit crosstalksolutions.com today to see our phone system offerings and to learn how we can save you money by switching to a world-class voice over IP phone system. Home Assistant is one of my all-time favorite Raspberry Pi projects. I ran Home Assistant personally on a Raspberry Pi for well over two years, and I absolutely loved it. But there are two issues with running Home Assistant on a Raspberry Pi. First of all, as many people love to complain about in my YouTube comments, Raspberry Pis aren't the easiest things to get your hands on. Additionally, Home Assistant tends to quickly become an integral part of your household once you've dialed in a bunch of automations. And I personally don't trust the micro SD card of the Raspberry Pi to hold up over time. So in this video, I'm gonna show you how to install Home Assistant on a Raspberry Pi, but I'm also gonna show you two other installation options, installing onto a virtual machine and installing in Docker. You can use the time codes down in the description below to skip around to the best installation method for your own environment. And I've also created a full step-by-step blog post that has easy to follow written instructions for everything that I'm gonna show you in this video. We'll also cover how to import smart devices into Home Assistant, and we're gonna set up a simple automation for turning lights on and off to get you started. Before we dig into all of that, however, we need to discuss your IoT network infrastructure. Home Assistant is designed to bring together all of your various IoT devices. And each one of these different devices might have their own smartphone apps, they might connect out to unknown cloud services, they might be reporting your usage data back to for-profit companies, and all of this network communication makes IoT devices a really attractive target for hackers to exploit. So because of this, I strongly recommend that you segment your IoT devices out into their own dedicated network. The IoT network or VLAN should be completely isolated from all of the other networks in your firewall and should be given internet access only. It's okay for your secure networks to see into the IoT network, but the IoT network should have no visibility into your secure networks. Additionally, it's an excellent idea to set up some sort of network-wide DNS filtering such as Pi-hole or AdGuard Home. These DNS filters help block malware domains and ad servers, but they also prevent a lot of these IoT devices from phoning home with your data unnecessarily. I've done many videos on DNS filtering as well as secure IoT network configurations, so check out the blog post for more network projects that you can sink your teeth into. All right, now I've given you ample warning about making sure your network is set up and secured properly, so let's dig into three different ways to install Home Assistant, starting with the Raspberry Pi. The two main things you need to get started with the Raspberry Pi installation are a Raspberry Pi and a MicroSD card. The MicroSD card should be a class 10 or greater. This one is a 32-gig card, which is plenty of space for Home Assistant. So I'm gonna put the Raspberry Pi down over here for now, and you want to pop the MicroSD card into a computer, and then if you go to raspberrypi.com slash software, you can download the Raspberry Pi Imager, which makes this super easy. So here's the Raspberry Pi Imager. We're gonna choose an operating system, and then we're gonna scroll down to Other Specific Purpose OS. Then we have Home Assistants and Home Automation, and Home Assistant is right here, so it's already built in to the Raspberry Pi Imager. Now there's a few different options here. I have a Raspberry Pi 4, so I'm gonna choose this one up at the top, but if you have a Raspberry Pi 3, you're gonna wanna choose this second option, and if you're lucky enough to get your hands on a Raspberry Pi CM4 module, as well as the Home Assistant Yellow Server, you can choose that final one down there at the bottom. I personally have not been able to get my hands on a CM4, so I have not been able to test that out yet. All right, so Raspberry Pi 4, then we're gonna choose our storage option, and make sure you pick the right storage, because you can absolutely overwrite something if you don't intend to. So in my case, I know it's a 32 gig card, so I'm gonna choose this one right here, and then we're just gonna say right, and yes. Now this is gonna take a couple of minutes, so while that's working, let's go ahead and get our Raspberry Pi all set up and ready to go. Okay, so here you can see my little Raspberry Pi setup. Again, you really just need the Raspberry Pi and the micro SD card. You're gonna wanna plug it into a network. You're also gonna wanna plug it into power. Now I recommend a power switch like this one, just because it makes it super easy when you're working with the Raspberry Pi. Instead of having to plug and unplug this physically from the board, you can just use this switch to turn it on and off. All right, so that's the bare minimum of what you need, but optionally, you can use an external monitor. That really helps to get the IP address once it boots up. You could also potentially use a little keyboard or plug in a keyboard and mouse into the Raspberry Pi, though really not necessary for running Home Assistant as we're not gonna do much in the CLI at all. But let's go ahead and get our monitor plugged in here. Oh, I need power to the monitor too. All right, there we go. Now you don't have to use a tiny monitor like this. You can actually use a full-size monitor. You're just gonna need an HDMI to micro HDMI cable. All right, the micro SD card is finished, so let's go ahead and pop that in here, and we're gonna fire it up. Okay, there we go. Home Assistant has booted up, and we can see that it was given an IP address of 192.168.200.191, which actually, that's in my main network. I need to change this network cable to be in my IoT network because we want Home Assistant to live in the same network as all of our little IoT devices. Once my Raspberry Pi booted back up, it gave me an IP address of 192.168.107.128. Now your IP address is likely gonna be different from that, but just take that IP address and pop it into the browser bar of any modern browser, and you want to append colon 8123 on the end. Now if we click continue to site, we get into the initial setup wizard. And at this point in the video, you can skip over the next two installation methods and just find the time code where we start with the initial setup wizard. Let's now talk about installation method number two, which is to install Home Assistant on a virtual machine, which is the way that I run my own personal Home Assistant because it has a lot of advantages. Number one, it's on a solid NAS device that has RAID 5 hard drives, so there's no need to worry about a micro SD card going out or some little component on the Raspberry Pi. I can also take snapshot backups. So if I do something that I don't like, I can roll back to a previous version. And I have those snapshot backups set up to automatically take a snapshot about once a week. Now that doesn't exclude you from doing actual Home Assistant backups because snapshots are not backups. They're just a mechanism by which you can roll back if you need to. So it all starts at home-assistant.io. That's the official webpage for Home Assistant. And if we come down here to documentation and installation, and then we scroll down, we can see all of the various ways that you can install Home Assistant, including Windows, Mac, Linux. And then down here we have alternative. So if I click into alternative, we have a few virtual machine images that the Home Assistant folks have already created for us, right? So we have a VDI virtual box. We have a Proxmox. We have a VMware OVA file. So the one that I'm gonna use that I know for sure works for my virtual machine, which is running on my Synology NAS, the virtual machine manager on my Synology NAS, is this VDI file, the virtual box. So click on that, download it, and then it's gonna come down as a zip file. You're gonna wanna unzip the contents of that zip file, and then you're ready to go. Before I install this in my Synology NAS, let's talk about that network infrastructure a little bit more. So my Synology NAS has four ethernet ports on the back of it. The main ethernet port or the first ethernet port is for my secure LAN, right? So the NAS lives in my secure LAN, but I want Home Assistant to be in my IoT network. So how do we do that instead? Well, I basically just had to create an untagged switch port in one of my switches that is only feeding that IoT network, and I plugged it into the second ethernet port on the back of my Synology NAS. So now I have one ethernet port in my secure LAN and one ethernet port in my IoT VLAN, right? So now we should be able to create a virtual machine that has an IP address in either one of those networks. And if I go to control panel and I click on network, network interface here, we can see the two different IP addresses in two different subnets. Okay, so now let's go to the virtual machine manager. And the first thing that we wanna do is come down here to image, and then we're gonna say disk image, and I already have one in here. So let's go ahead and delete this so I can do the whole thing start to finish. All right, so I have zero disk images in the Synology NAS. Now uploading a disk image just means that it's gonna be available to use as a virtual machine. You don't actually have to do this step. You can just import it directly, but I do like to have the disk image in Synology for my virtual machines. In case I ever need to reinstall them or something, I know exactly what I installed from. So we're gonna say add from computer, and then I search for that VDI file that I had downloaded. Let's give it a different name so that I know what it is. We're gonna say test since it's just for this video. Next, and where do we wanna store it? We'll store it on the main volume. That's perfectly fine, and we'll say done. And now it is taking that image from my computer that I downloaded, the operating system image for Home Assistant, and it is uploading that VDI file to the Synology NAS where I will be able to use it when I create the virtual machine. Okay, so after about 30 seconds or so, it now says status healthy, which means that I can use this image. So we come over here to virtual machine. We're gonna say create and import, and then we wanna import from disk images. Next, we want to look for the disk image on our main volume here, and we're gonna call this test Home Assistant. Now you can call it whatever you want. I'm calling it test that I don't mistake it for my actual Home Assistant virtual machine because when I clean all this up after this video, I wanna make sure I delete the right one. Now the minimum requirements for a Home Assistant virtual machine are recommended to be two CPUs and two gigs of RAM. So we'll choose those, and we're gonna say next. Then we want to select our image. This is the operating system image that we're gonna use to boot this virtual machine. We can see the test one that I just imported is right there, and by default, it gives us 32 gigs, which is, again, the recommended minimum for Home Assistant. We're gonna say next, and here's where I can select the network, right? So the default virtual machine network is gonna be my secure LAN. I do not want that one. I wanna put it in my IoT network, so we're gonna say IoT network and next, and then for other settings, we wanna change legacy BIOS to UEFI, and we're gonna say next, and now we wanna give permission to the users in Synology that have the ability to manage this virtual machine. So for me, it's like my main user and the admin user, and we're gonna say next, and then we wanna check the box that says power on the virtual machine after creation and done. So now the virtual machine manager is creating the virtual machine, and it is going to power it on for the initial boot up process, and I should see an IP address in the 107, my IoT network. IoT equals 107, that's why it's 107. We're gonna see an IP address pop up in my 107 network here in just a second. There we go, 192.168.107.54. All right, so if I click on this and I say connect, I can also connect to the CLI of Home Assistant. We can see that it is waiting to be ready here. This is the same screen that we saw when we did the Raspberry Pi installation. Okay, so after just a couple of minutes, we now get the rest of the CLI populated for Home Assistant, and since the IP address is 182.168.107.54, we are going to try to open that up in a browser. Also notice down below, it says that you can use homeassistant.local. Okay, so that is an MDNS name. I'm not using that in this video because I already have Home Assistant set up on this network, right? So for me, if I did the MDNS name, it might not go to the right server, but for you, you can try homeassistant.local at port 8123, and it might actually work just fine. There we go, so if I bring up the IP address in a browser, it says now preparing Home Assistant, and this can take up to 20 minutes. So once this clears, you'll be at the initial setup wizard, and you can now skip to the initial setup wizard portion of this video. Check the time codes down in the description below. All right, now let's talk about installation method number three, and that is Docker. Now Docker is one of the absolute easiest ways that you can install Home Assistant, and I'm gonna be doing it here in my Synology NAS, but if you have like Portainer, you can do this very easily. I'm sure there's also instructions for doing it with the Docker CLI. It's very simple setup. You download the image, you run the image, and in the configuration, you just have to tell Docker, hey, the configuration for Home Assistant is gonna be in this separate folder that is outside of the Docker container. That's really all there is to it. All right, let's hop right in here. So in Synology NAS, I am opening up Docker, and the first thing I wanna do is click on registry because Home Assistant does have an official image in the Docker registry. So we're gonna say Home Assistant in the search bar, and then it is this one right here, Home Assistant slash home dash assistant. So we're gonna click on that, and we're gonna say download. Then it asks us to choose a tag, and instead of latest, I'm gonna scroll all the way down to the bottom past all of these versions, and I'm gonna choose stable. So this will give me the latest stable version of Home Assistant, which is what I wanna be on since this is a production machine in my production network, right? So we're gonna say select, and now it's gonna start that download. Now the download for Home Assistant from Docker is about two gigabytes, okay? So it's gonna take a little while to download depending on the speed of your internet connection. Now what I'm gonna do here is click on image, and then once it's finished downloading, we'll see these little hard drives that are currently filling up here. That will disappear, and it'll just be solid blue like these other images that I have in Docker. Now while we're waiting for that to happen, remember that I said in Docker, the configuration files for Home Assistant are stored outside of the Docker container. Now you're gonna need a file location for those configuration files. So this might be a good opportunity to create that on the file system. In Synology, I'm gonna go to file station, and then I have this Docker folder right here, so I'm gonna expand that, and you can see that I've already created a folder inside Docker called Home Assistant, and then I created a folder inside Home Assistant called config, okay? So that's where I'm gonna store stuff on the file system of my Synology NAS. Oh, and we just got a notification that the Docker image has successfully downloaded. So now you should have a location that we've sort of set aside for the Home Assistant config. Now let's go back to Docker. We're gonna click on image, and we're gonna click on Home Assistant, and we're gonna say launch. For the networking, we're just gonna use the same network as the Docker host. Now, quick sidestep here. I personally most oftentimes prefer Docker containers to virtual machines, because in a virtual machine, you have the overhead of the operating system that's taking up resources, in this case, on my Synology NAS, or on the virtual machine host, whatever that might be, whereas a Docker container just utilizes the existing resources of that host, right? So it's not a separate operating system within an operating system, right? However, for Home Assistant, since my Synology NAS has a footprint in my secure LAN, and then a secondary footprint in my IoT network, when I create this Docker container, and I say, hey, use the same network as the Docker host, it's going to answer, the GUI for Home Assistant is gonna answer on both sides of the network, but the discovery for devices in the network only seems to happen in my secure LAN, I've found, right? Now, there may be a way around this, but just be aware of that, right? It might be a little bit more difficult if you have a setup similar to mine to get your devices discovered. Whereas if you have Home Assistant natively in the network where all of your devices are, that discovery process happens automatically and very easily. All right, so fair warning, we're gonna say, use the same network as the Docker host, and next, I'm gonna tick the box here that says enable auto restart, but don't hit next yet, we're gonna click on advanced settings. Because one of the things we wanna do is tell Home Assistant our time zone, okay? So we're gonna add a variable here, we're gonna say add, the variable we're adding is TZ for time zone, and then we're gonna add America slash Los Angeles. Los Angeles. Okay, so that's just a standard format time zone, you see it all over Linux and stuff. There is a link in the blog post for you to look up the exact verbatim nomenclature for your own time zone. So go ahead and look at the blog post, then you can click on that link and find East Coast or Central or India, wherever you happen to be. All right, so we're gonna say save, and now we're gonna say next, and here is where we are going to add our config folder. So we're gonna first browse to the folder that we created and the Synology NAS, we're gonna click add folder, and that was Docker home assistant config, and then the mount path, so where we are mounting this inside the Docker container is gonna be slash config, and then we're gonna say next. Okay, so run this container after the wizard is finished and we'll say done, and if you did everything correctly, this Docker container is now gonna fire up, so I'm just gonna give it a minute here, and then I'm gonna try to connect to the IP address of my Synology NAS colon 8123, port 8123, and we should see the home assistant GUI interface. There we go, so it really happens quickly in Docker, I love Docker, again, I wish I could actually use Docker with my network setup, but it just doesn't quite work for me, but here we are in the initial setup wizard, so at this point, you can skip down to the initial setup wizard portion of this video. All right, so the first step of the initial setup wizard is to enter our name as well as a username and password, and we're gonna say create account, this is the administrative account for your home assistant server, so name of your home assistant installation, we can call it whatever we want, and then you can move this pin to your own geographical location, put it right on your address. In my case, I'm gonna pop it over here in Washington DC right on the White House, because why not, right? All right, there we go, there is our home assistant at the White House, country in my case is going to be US, language is EN for English, time zone, since we're at the White House, I will say New York, and then we'll use US for the unit system because we're crazy and we don't use the metric system, and then I will put USD for the currency and say next. Okay, this next screen asks us if we wanna share any data with home assistant, that's entirely up to you, for my purposes, I'm just gonna say next, and look at this, it's already found a whole bunch of devices that we can import into home assistant. We've got Philips Hue, we've got a Samsung TV, we've got some Roku's, my ecobee thermostat, and on and on and on, so let's just say finish, and now we're brought to the home assistant dashboard. All right, so let's take a quick look around here, we can see the main dashboard right here, as you add devices to home assistant, they are going to populate in this overview dashboard, and most likely you're gonna wanna create additional dashboards for different areas of your house, or basically just for different groups of devices that you wanna control. So me, for instance, in my own home assistant server, I have a dashboard just for everything that I have in my office here, I have a separate dashboard for everything in the first floor or the downstairs of my house, I've got another one that I'm in the process of setting up for gardening stuff, right, for seedlings and greenhouse temperature and that sort of thing, that's another dashboard that I'm working on. But by default, we just get this overview dashboard. Now down here under settings, if you have an update available for home assistant, it's gonna pop right at the top here above home assistant cloud. Now in this case, it doesn't look like I have an update or at least home assistant hasn't detected that I have an update yet, but I do cover that in the blog post, how to update home assistant through the settings page. But here we can see devices and services, this is where we're gonna add devices, which we'll get to in a second, then we have automations and scenes, that's where we can create automations, for instance, for turning lights on and off, or notifying when the garage door has been opened for more than a half hour, whatever you wanna do, whatever you can dream of, you're gonna do it mostly in automations and scenes, you can set up areas and zones, add-ons, dashboards, et cetera, et cetera. If we go below settings, we have notifications, and notifications is where new devices will pop up when they've been discovered. So if I click check it out here, we can see that I've got all of these devices ready to go, right, so this is all of the stuff that by home assistant being in my IoT network, it put out a broadcast and all of these devices have responded and said, hey, yeah, you can set me up, right, and sometimes you'll even see like on a television, it'll pop up like a little thing that says, oh, you're being requested to grant access to home assistant or whatever, like it'll actually pop up on some of your devices sometimes. So now let's go ahead and set up an integration, and the one that I'm gonna do here is my Lutron switches, so I love the Lutron switches, we're gonna configure those, I've got about three of them here in my house, it says pair with the bridge, to pair with my bridge, after submitting this form, press the black button on the back of the bridge, now the bridge is right on the other side of my computer here, so I'm gonna say submit, and then I now have like 30 seconds to hit that button. All right, hitting the button now, and this is basically just a way to check and say, yes, this person has physical access to this, you know, Lutron bridge, same thing with the Philips Hue lights, and now we have confirmed that this is something that I want to install or, you know, configure with home assistant. So smart bridge two, for the area, we're just gonna say add new area, since this is my office, we'll say office, add, you can add as many areas as you want, and it's found a number of different lights here. So I've got some in my kitchen, we're gonna call those kitchen. Now, where it says these names here, right, loft main lights, kitchen island pendants, it pulled that from the Lutron bridge, right? So when I set these up in the Lutron bridge originally, those were the names that I gave these devices, and home assistant is able to read that information and import it right into home assistant, and it even is smart enough to know, hey, this one's called kitchen island pendants, so it's probably in the kitchen, right? So you can change those if you need to though. So we've got a loft main lights in the loft, and we've got front foyer sconces, which is just my outdoor lights, it's a fancy name for my outdoor lights on the front of my house. So we're gonna say finish, and now the sort of blue outline in the configure button for my Lutron devices has gone away, because those are now configured and available for use with home assistant. So if I go back to the overview dashboard, now we can see all of these different lights, front foyer, kitchen, and loft. And if I hit the button here, that just turned on those lights, and then we hit it again, and those turn off. Same thing with my kitchen lights, same thing with my loft lights, and if I click on the lights themselves, instead of just flipping the button, if it has a dimmer, I can also just dim them up and down like so, or just turn them completely off with that button there. So super cool, super easy, I've already got some devices in here, you're gonna now wanna go through and repeat that for all of your various devices. But what we're gonna do here is we're gonna take these Lutron lights that I just set up into home assistant, and we're going to create an automation. And one of the automations that I like a lot is for my outdoor lights, I like to have them pop on at sunset, right? And sunsets a variable time, right? It's gonna change throughout different times of the year. Here in the Pacific Northwest, it's dark at like 4.30 in the winter time, and it's dark at like 9 p.m. in the summertime. So sunset varies quite greatly throughout the year. So if I go to settings, and then we click on automations and scenes, I don't have any automations right now, but I'm gonna click create automation in the bottom right hand corner, and we're gonna create a new automation. Now for each automation, we have some various options that we can play with, but really it comes down to triggers and actions, and then sometimes conditions, right? So in this case, the first automation I wanna create is turn on my house's outside lights at sunset. So we're gonna say add the trigger, and the trigger is gonna be sunset. When it hits sunset, we're going to do something, right? So we're gonna choose sun here, and you can look through here and see all of the different things. Like so for instance, the trigger might be a motion detector, right? Where the device motion detector detects motion, then do something, right? That's the trigger. In this case though, we're gonna say sun, and then when the sun rises or when the sun sets. So we're gonna say sunset. You can also offset it. So for instance, if I wanted it an hour before sunset, I would say minus 01 colon 00 colon 00, and that is going to trigger this an hour before the sunset time, which it knows because it's connected to the internet and it can look up the sunset in my area. We're gonna get rid of that though. So sunset is fine for our trigger. For conditions, we're not gonna have any conditions, right? This is when you will get more complicated with automations. You can say, you know, when the sun sets, if the garage is open, do something, right? That might be the condition or something like that, right? So we don't have any conditions in this case. We're just saying at sunset, we're gonna do an action. And the action is going to be device, select the device. It's my front foyer sconces, right? The very fancy name. And we're gonna say the action is turn on the front foyer sconces. I should just call those outdoor lights. That's much easier to say. And then we're gonna save that. And it's gonna ask us what is the name of our automation? So we're gonna say turn on outside lights at sunset and save. So now we have an automation that we can actually run. And if I click the three dots up here in the quarter and I click run, that's going to turn on my outside lights. And yeah, if I run it again, it's gonna do nothing because they're already on. It's only going to turn those lights on if the state of those lights is in an off state already. So since we only have one automation to turn those lights on right now, they're gonna turn on and stay on forever. So we wanna add a second automation. So let's go back here. Here's my first automation. We're gonna say create a new automation. In fact, you know what? I'm gonna do something a little bit easier. I'm gonna say duplicate. So I'm gonna duplicate the turn on the lights. That way I don't have to do quite as much work. So the trigger this time is not when the sun sets. We're gonna get rid of that, delete that trigger. And we're gonna add a new trigger just based on time. And so the fixed time when we're gonna turn our lights off is 10, 30 p.m. And then for condition, instead of turn on the outside lights, we're going to turn off the outside lights and save that. And we're gonna call this one turn off outside lights at 10, 30 p.m. And save. If we go back, I now have two different automations. We can see that I ran the turn on automation one minute ago and we have never run the turn off automation. Let me go ahead and run it now so that I turn off those outside lights. All right, so there we have a base foundational setup of Home Assistant where we've imported a device and we have set it to turn on and off on a schedule. You can dig a lot deeper than that though. If you have followed all of these instructions and set everything up properly, you should now have a fully deployed Home Assistant server that can be used as a foundation for automating your life. Now, I sincerely hope that you enjoy going down the Home Assistant rabbit hole as much as I do. And if you have any super cool automations that you're proud of, pop those into the comments below. I'd love to hear about them. One of the coolest integrations that I've done with my own Home Assistant lately was connecting it up to Cloudflare tunnels. The Home Assistant server itself maintains that connection out to Cloudflare and that allows me to then securely access my Home Assistant remotely. Let me know if you'd like to see a video on that. And if you'd like to keep this party going, I have handpicked a couple of videos on the right here for you to watch next. The top video is my recent step-by-step guide to Cloudflare tunnels and the bottom video is the world's greatest pie hole tutorial."
    }
}