{
    "ZRvPmy2yIl8": {
        "title": "Beyond the Now | Full Episode 1 | A Brief History of the Future | PBS",
        "thumbnail": "https://i.ytimg.com/vi/ZRvPmy2yIl8/hqdefault.jpg",
        "author": "PBS",
        "date_of_release": "2024-04-04T01:00:07Z",
        "duration": "PT53M26S",
        "view_count": "214302",
        "like_count": "4416",
        "comment_count": "188",
        "description": "Official website: https://to.pbs.org/3V7BRLk | #TheFutureOnPBS\n\nWiden your perspective of time beyond our lifetimes and join Ari Wallach as he embarks on a journey to seek the individuals and ideas that can shape a better, more sustainable future that each generation can build upon. See the science behind how humans perceive the future. Learn about long term \"cathedral thinking\" and the emerging field of future design.\n\nEpisode One - Beyond the Now\nPart one of a six-part PBS documentary series about our futures and how we can reimagine them. \n\nThis program is made possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nSubscribe to the PBS channel for more clips:  https://www.youtube.com/PBS/\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS App: https://to.pbs.org/2QbtzhR\n\nFOLLOW US:\n\nFacebook: https://www.facebook.com/PBS/\nX: https://twitter.com/PBS/\nInstagram: https://www.instagram.com/PBS/\nTikTok: https://www.tiktok.com/@pbs\nShop: https://shop.pbs.org/\n\n#futurism #futuristic #PBS\n\nA BRIEF HISTORY OF THE FUTURE\nCombining history, science, and unexpected storytelling to expand our understanding about the impact that the choices we make today will have on our tomorrows. Each episode follows those who are working to solve our greatest challenges. The series also features valuable insights from a wide range of thinkers, scientists, developers and storytellers including French President Emmanuel Macron, U.S. Secretary of Transportation Pete Buttigieg, U.S. Surgeon General Vivek Murthy, sailor Dame Ellen MacArthur, musician Grimes, architect Bjarke Ingels, climate scientist Katharine Hayhoe, legendary soccer player Kylian Mbappé, and more.",
        "transcript": "Error: 'charmap' codec can't encode character '\\u266a' in position 15: character maps to <undefined>"
    }
}