{
    "zUJH5n2xxck": {
        "title": "‘Completely nonsensical’: Andrew Weissmann breaks down Donald Trump’s immunity claims",
        "thumbnail": "https://i.ytimg.com/vi/zUJH5n2xxck/hqdefault.jpg",
        "author": "MSNBC",
        "date_of_release": "2024-01-22T22:36:33Z",
        "duration": "PT11M42S",
        "view_count": "513341",
        "like_count": "7766",
        "comment_count": "2224",
        "description": "Andrew Weissmann, former top official at the Justice Department, David Jolly, former Congressman from Florida, and Kimberly Atkins Stohr, Senior Opinion Columnist for the Boston Globe joins Michael Steele in for Nicolle Wallace on Deadline White House to discuss the Donald Trump’s legal issues continuing to mount as he appears to close in on the GOP Presidential nomination for a third time. \n\n» Subscribe to MSNBC: https://www.youtube.com/msnbc\n \nFollow MSNBC Show Blogs \nMaddowBlog: https://www.msnbc.com/maddowblog\nReidOut Blog: https://www.msnbc.com/reidoutblog\n\nMSNBC delivers breaking news, in-depth analysis of politics headlines, as well as commentary and informed perspectives. Find video clips and segments from The Rachel Maddow Show, Morning Joe, The Beat with Ari Melber, Deadline: White House, The ReidOut, All In, Last Word, 11th Hour, and Alex Wagner who brings her breadth of reporting experience to MSNBC primetime. Watch “Alex Wagner Tonight” Tuesday through Friday at 9pm Eastern. \n \nConnect with MSNBC Online \nVisit msnbc.com: https://www.msnbc.com/\nSubscribe to the MSNBC Daily Newsletter: https://link.msnbc.com/join/5ck/msnbc-daily-signup\nFind MSNBC on Facebook: https://www.facebook.com/msnbc/\nFollow MSNBC on Twitter: https://twitter.com/MSNBC\nFollow MSNBC on Instagram: https://www.instagram.com/msnbc\n\n#DonaldTrump #Trump #GOP",
        "transcript": "ING. ING. >>> DO YOU AGREE, SHOULD A PRESIDENT HAVE TOTAL IMMUNITY EVEN FOR THINGS THAT CROSS THE LINE? >> OF COURSE NOT. THE AMAZING THING ABOUT THAT CLIP WAS HE WAS DEAD SERIOUS. HE WASN'T EVEN MAKING ONE OF HIS RIDICULOUS JOKES. HE WAS DEAD SERIOUS. AND THAT SHOULD GET EVERYONE, WHETHER YOU'RE AN EXTREME CONSERVATIVE OR SOCIALIST LIBERAL, EVERYONE SHOULD BE CONCERNED WITH THAT TYPE OF MENTALITY GOING INTO THE WHITE HOUSE. >> HI AGAIN, EVERYONE. IT'S 5:00 IN WASHINGTON. I'M MICHAEL STEELE IN FOR NICOLLE WALLACE. REPUBLICAN GOVERNOR OF NEW HAMPSHIRE CHRIS SUNUNU THERE WITH A VERY IMPORTANT WARNING. TOTAL IMMUNITY IS A THREAT TO THE COUNTRY. WHERE WE BELIEVE IN DEMOCRACY AND THAT NO ONE IS ABOVE THE LAW. GOVERNOR SUNUNU WAS REACTING TO COMMENTS BY THE FORMER PRESIDENT LIKE THIS. >> YOU HAVE TO HAVE GUARANTEED IMMUNITY FOR A PRESIDENT. OTHERWISE A PRESIDENT'S NOT GOING TO BE ABLE TO FUNCTION. THEY'RE NOT GOING TO MOVE -- HARRY TRUMAN WOULD NOT HAVE DONE -- HARRY TRUMAN WOULD NOT HAVE DONE HIROSHIMA, NAGASAKI, PROBABLY ENDED THE WAR, PROBABLY, I THINK SO. BUT HE WOULDN'T HAVE DONE IT. SO MANY THINGS WOULDN'T BE DONE. THE PRESIDENT HAS TO HAVE IMMUNITY. IF THEY DON'T HAVE IMMUNITY YOU'RE NOT GOING TO HAVE -- YOU'RE NOT GOING TO HAVE A PRESIDENCY MUCH. YOU'RE NOT GOING TO HAVE MUCH OF A COUNTRY. >> SO LET'S BE CLEAR. WHAT TRUMP IS DESCRIBING IS LEADERSHIP WITH NO CHECKS ON THOSE IN POWER. BUT THERE IN THE UNITED STATES -- BUT HERE IN THE UNITED STATES WE HAVE A RULE OF LAW THAT APPLIES TO EVERYONE. THAT'S WHY FOUR GRAND JURIES INDICTED THE EX-PRESIDENT IN FOUR SEPARATE CRIMINAL CASES. AND HE'S GOT A FEW CIVIL CASES HE'S DEALING WITH AS WELL. ALL THE WHILE TRUMP'S 2024 PRESIDENTIAL CAMPAIGN IS MOVING FULL STEAM AHEAD. THE GOP PRIMARY IS NOW DOWN TO TWO CANDIDATES. AND THE TWO -- AND THE TWICE IMPEACHED, FOUR TIMES INDICTED EX-PRESIDENT IS LOOKING LIKE HE'S ALL BUT SECURED THE PARTY'S NOMINATION. WHICH MEANS WE'RE HEADED FOR A CLASH. A CLASH BETWEEN A MAN WHO BEFORE VOTERS CAST THEIR BALLOTS COULD BE CRIMINALLY CONVICTED AND A POLITICAL PARTY ACCEPTING HIM WITH OPEN ARMS DESPITE THE MANY LEGAL BATTLES BETWEEN NOW AND NOVEMBER. AND THAT IS WHERE WE START THIS HOUR WITH FORMER TOP OFFICIAL WITH THE JUSTICE DEPARTMENT AND MSNBC LEGAL ANALYST ANDREW WEISSMANN. ALSO JOINING US, FORMER CONGRESSMAN FROM FLORIDA, MSNBC POLITICAL ANALYST DAVID JOLLY, AND WITH ME HERE AT THE TABLE SENIOR OPINION COLUMNIST FOR THE \"BOSTON GLOBE\" AND CO-HOST OF \"THE SISTERS-IN-LAW\" PODCAST KIMBERLY ATKINS STOHR. THANK YOU ALL FOR JOINING US. SO ANDREW, THE MAN ON THE PRECIPICE OF SECURING THE PARTY NOMINATION FOR THE GOP IS CURRENTLY INDICTED IN FOUR DIFFERENT JURISDICTIONS. AND HE WANTS COMPLETE AND TOTAL ABSOLUTE IMMUNITY. HELP US WRAP OUR HEADS AROUND WHAT THAT SAYS AND WHAT THAT CAN POTENTIALLY MEAN TO THIS COUNTRY. >> YOU KNOW, IF HE WERE JUST A DEFENDANT SAYING I WANT COMPLETE IMMUNITY, YOU WOULD UNDERSTAND IT BECAUSE HE'S BASICALLY JUST SAYING WHAT ANY DEFENDANT WOULD SAY, WHICH IS I DON'T WANT TO BE PROSECUTED. BUT THE IDEA THAT HE'S SAYING IT'S BECAUSE I USED TO BE THE PRESIDENT OF THE UNITED STATES THAT I WANT IMMUNITY IS THE PROBLEM. AND HIS ARGUMENT ABOUT HARRY TRUMAN IS COMPLETELY NONSENSICAL. WE DON'T HAVE PRESIDENTIAL IMMUNITY FOR VIOLATING AMERICAN CRIMINAL LAW. AND HARRY TRUMAN HAD NO PROBLEM DOING HIS JOB AND MAKING VERY DIFFICULT DECISIONS AND DECIDING WHEN TO DROP A BOMB OR NOT. AND YOU MAY DISAGREE WITH THAT, BUT IT WASN'T BECAUSE OF PRESIDENTIAL IMMUNITY OR THE LACK THEREOF. AND NOTHING HARRY TRUMAN DID VIOLATED AMERICAN CRIMINAL LAW. SO IT IS COMPLETELY NONSENSICAL. THE COURTS ARE NOT TRYING TO FIND THAT THERE IS PRESIDENTIAL IMMUNITY. EITHER THE D.C. CIRCUIT THAT WE'RE WAITING FOR OR IF THE SUPREME COURT TAKES IT. HE'S SIMPLY TRYING TO MAKE THIS A GET OUT OF JAIL FREE CARD AND ESSENTIALLY HAVE THE POPULATION, HIS BASE, VOTE THAT HE SHOULD NOT BE TRIED FOR HIS FEDERAL CASES. THAT IS WHAT HE WANTS TO MAKE THE ELECTION ABOUT. AND IF HE HAD HIS DRUTHERS HE WOULD WANT THE COURTS TO SIMPLY END THE PROBLEMS HE IS FACING BECAUSE OF HIS OWN ACTIONS. BUT THE COURTS ARE NOT GOING TO BE HIS WAY OUT. THE POLITICAL SPHERE MAY BE HIS WAY OUT. BUT IT WON'T BE BECAUSE THE COURTS AGREE WITH HIM. >> SO DAVID, LET'S TALK ABOUT THAT POLITICAL SPHERE BECAUSE THAT SPACE IS CRAZY AS I DON'T KNOW WHAT. YOU'VE GOT A REPUBLICAN PARTY THAT'S ALL TOO HAPPY TO LET DONALD TRUMP WIN ITS PARTY NOMINATION AND BE ITS STANDARD BEARER ON THE BALLOT, WHICH LOOKS NEARLY CERTAIN. HOW DOES THAT WORK IN TERMS OF THE POLITICS OF THIS WHEN YOU GET INTO A BROADER CONVERSATION WITH THE COUNTRY ABOUT WHO THE NEXT PRESIDENT SHOULD BE? >> YEAH, MICHAEL, I THINK THIS IS REALLY AN INCREDIBLE MOMENT BECAUSE IT'S A GLIMPSE INSIDE DONALD TRUMP'S COMMAND OF THE MOVEMENT AND HIS CONSTITUENCY. HE IS SAYING PUBLICLY I CAN DO ANYTHING I WANT, TOTAL IMMUNITY, A PRESIDENT HAS TOTAL IMMUNITY. CONSIDER HOW FAR THAT IS FROM HIS PERFECT PHONE CALL DEFENSE. RIGHT? I UNDERSTAND THAT WAS THE IMPEACHMENT ARGUMENT. BUT EVEN IN THIS JACK SMITH CASE THE PERFECT PHONE CALL DEFENSE IS BEING USED BECAUSE THEY WERE SAYING IN HIS DEFENSE THAT HE WAS ACTING WITHIN THE OUTER PERIMETERS OF THE EXECUTIVE BRANCH POWERS, THAT IN TAMPERING WITH THE ELECTION OR INCITING JANUARY 6th ALL HE WAS DOING WAS EXERCISING HIS EXECUTIVE FUNCTION TO COMMUNICATE THE NATION'S INTEREST IN FREE AND FAIR ELECTIONS. HE WAS YELLING FRAUD, RIGHT? HE WAS MAKING A SUBSTANTIVE DEFENSE, EVEN ONE THAT WOULD LIKELY FAIL IN THE COURTS, BECAUSE IT'S NOT WITHIN THE OUTER PERIMETER OF THE OFFICE. HE HAS NOW LEAPT TO YOU KNOW, I WASN'T DOING ANYTHING LEGAL, I WAS DOING ILLEGAL THINGS, BUT I'M ALLOWED TO, I GET TOTAL IMMUNITY BECAUSE THE OFFICE SHOULD BE BEYOND THE REACH OF ACCOUNTABILITY. AND CONSIDER HOW SEAMLESSLY, THIS IS THE POLITICAL PIECE, HOW SEAMLESSLY HIS MOVEMENT HAS FOLLOWED HIM IN THAT LEAP. HIS MOVEMENT NOW IS GOING TO AGREE WITH HIM. THEY'RE GOING TO CHEER FOR HIM. THEY'RE GOING TO UNDERSTAND -- AND I THINK WORSE EVEN THAN THAT IS DONALD TRUMP IS IN THE PROCESS OF CONVINCING HIMSELF WITH FIDELITY THAT ACTUALLY, YES, THE PRESIDENT SHOULD BE IMMUNE FROM ACCOUNTABILITY, SHOULD HAVE TOTAL IMMUNITY. AND THAT THEN PRESENTS THE DANGER. SO WHAT DOES IT MEAN FOR OUR POLITICS? THIS IS GOING IN NOVEMBER IN A 50-50 RACE DONALD TRUMP VERSUS JOE BIDEN. IF DONALD TRUMP WINS, HE COULD -- WE SHOULD EXPECT HIM TO TAKE THAT ETHOS OF TOTAL IMMUNITY INTO THE OFFICE. THAT'S THE DANGER. AND SO TO PROTECT DEMOCRACY WE HAVE TO QUIET THOSE VOICES AND QUIET THOSE VOTES IN NOVEMBER AND INSTEAD CHOOSE A PRESIDENT THAT WILL DEFEND LAW AND ORDER AND DEFEND THE CONSTITUTION. >> KIM, I'D LIKE TO PLAY FOR YOU A LITTLE SOUND FROM TRUMP'S NOW FORMER LAWYER JOE TACOPINA WITH MY COLLEAGUE REVEREND AL SHARPTON. TAKE A LISTEN. >> IS IT POSSIBLE DONALD TRUMP COULD END UP CONVICTED OF ONE OF THESE CASES IN YOUR MIND? >> OH, IS IT POSSIBLE? ABSOLUTELY. YOU HAVE A JURY OF 12 WHO'S GOING TO ULTIMATELY DECIDE THIS. JACK SMITH IS A FEDERAL PROSECUTOR WHO I KNEW FROM HIS DAYS IN BROOKLYN. THEY'RE SERIOUS PROSECUTORS. YOU CAN'T SAY THERE'S NO WAY HE'LL GET CONVICTED OR THERE'S NO WAY, YOU KNOW, HE'LL BE SENTENCED -- >> AND THE PROSECUTORS THAT DESPITE WHATEVER POLITICAL ANGLE, YOU DON'T THINK WOULD BRING CASES THEY DIDN'T THINK THERE WAS SOME LEGAL CASE -- >> I'M SURE THEY BELIEVE IN THEIR CASES. I DO. I'M NOT GOING TO SUBSCRIBE TO UNETHICAL CONDUCT ON BEHALF OF PROSECUTORS WITHOUT SEEING EVIDENCE. THEY BELIEVE IN THE CASE. IT DOESN'T MEAN THEY'RE RIGHT, BY THE WAY, REVEREND. BUT THEY BELIEVE IN THEIR CASE. >> DOESN'T MEAN THEY'RE WRONG, EITHER, JOE. >> DOES NOT EITHER. >> IS THERE A LANE HERE WHERE THAT WOULD HAPPEN WHERE TRUMP IS CONVICTED BEFORE THIS ELECTION? >> IT IS. IT IS. AND THAT COULD BRING UP THE TOUGH TASK OF DECIDING, WELL, WHAT DOES THAT MEAN? IF HE WINS THE ELECTION POLITICALLY. AND LEGALLY. CAN A PRESIDENT SERVE IN THE WHITE HOUSE WHILE ALSO CONVICTED? I DON'T SEE ANY REASON WHY, ASIDE FROM THE BIG PROBLEM WITH INSURRECTION AND THE 14th AMENDMENT, WHY THAT. BUT WE HAVE NEVER BEEN HERE BEFORE. AND THAT'S SORT OF BOTH LEGALLY AND POLITICALLY WHAT DONALD TRUMP IS COUNTING ON. NEVER MIND THIS NONSENSICAL CLAIM THAT PRESIDENTS HAVE TOTAL IMMUNITY AS CONGRESSMAN JOLLY POINTED OUT, THAT'S NOT EVEN WHAT HIS OWN LAWYERS ARE CLAIMING. BUT WHAT HE IS TRYING TO DO TO PROTECT HIMSELF POLITICALLY IS MAKE THAT CASE TO HIS CORE VOTERS. THE SCARIEST THING IN THAT CLIP OF DONALD TRUMP TO ME WERE THE PEOPLE IN THE AUDIENCE WHO WERE APPLAUDING THAT. THAT'S WHAT HE'S BANKING ON. HE'S TESTING OUT THIS MESSAGE TO GALVANIZE HIS BASE. AND IF HE WINS THE NOMINATION, WHICH HE LIKELY WILL, THAT IS GOING TO BE THE OFFICIAL LINE OF THE REPUBLICAN PARTY, THAT DONALD TRUMP IS ABOVE THE LAW. THAT'S EXTREMELY DANGEROUS, EVEN IF THE COURTS DO NOT AGREE. >> YOU KNOW, DAVID, I WANT TO PICK UP ON KIM'S POINT THERE BECAUSE WE LEARNED FROM THE IOWA CAUCUSES THAT NEARLY 2/3 OF REPUBLICANS, THAT'S A LOT OF FOLKS, BELIEVE THAT DONALD TRUMP IS FIT TO HOLD OFFICE EVEN IF HE'S CONVICTED. YOU HAVE CANDIDATES RUNNING AGAINST HIM, AND I PUT THAT IN AIR QUOTES, STAND ON THE STAGE, RAISE THEIR HAND AND SAY THEY WOULD SUPPORT DONALD TRUMP IF HE'S CONVICT EDED. THAT MEANS A THIRD OF THE PARTY IS NOT, THOUGH. NOT EVERYONE'S ON BOARD. I'M NOT CONVINCED THAT'S ENOUGH. I'D LIKE TO SEE MORE. I'D LIKE TO GET YOUR THOUGHTS ON THAT. BECAUSE 2/3 OF SOMETHING IS A LOT. AND FOLKS WORRYING ABOUT THAT THIRD, I DON'T KNOW WHAT THAT THIRD CAN DO. HELP ME OUT. >> YEAH, SURE. WHAT THEY CAN DO IS PARTICIPATE IN THE 6% OF THE COUNTRY THAT WILL DECIDE THE PRESIDENCY IN NOVEMBER. BUT LET'S START WITH WHAT IT MEANS FOR REPUBLICANS. YOU AND I ENDED UP IN A BRIEF CONVERSATION LAST NIGHT ABOUT HOW THIS IS DIFFERENT IN '24 THAN IT WAS IN '16 AND EVEN '20. AND AROUND THAT I WOULD SUGGEST THAT THIS CYCLE, WHAT WE HAVE SEEN IS THAT DONALD TRUMP HAS FULLY TAMED THE REPUBLICAN PARTY. IN '16 EVEN AFTER GETTING THE NOMINATION YOU HAD THE LIKES OF THE SPEAKER OF THE HOUSE PAUL RYAN, MITCH McCONNELL SXOOZ WHO SAID I'M JUST NOT THERE WITH MY ENDORSEMENT YET, EVEN AFTER HE HAD SECURED THE NOMINATION. YOU HAD VOTING REPUBLICANS, GRASSROOTS REPUBLICANS WHO SAID I'M NOT THERE YET. WHAT WE'VE SEEN THIS CYCLE IS IN IOWA PEOPLE NOW BELIEVE THAT THE PREVIOUS ELECTION WAS RIGGED BECAUSE DONALD TRUMP TELLS THEM THAT. ELECTED LEADERS WHO ARE ALSO CANDIDATES LIKE RON DeSANTIS AND OTHERS DROP OUT OF THE RACE AND IMMEDIATELY NOW ENDORSE DONALD TRUMP. DONALD TRUMP HAS TAMED THE REPUBLICAN PARTY TO NOW FOLLOW HIS DIRECTION, WHATEVER IT IS HE ASKS OF THEM. AND SO WHAT DOES THAT MEAN FOR NOVEMBER? FOR THOSE 30% PERHAPS WHO SAY NO, I'M NOT SURE, SOME OF THOSE NEW HAMPSHIRE VOTERS TONIGHT OR TOMORROW THAT WILL VOTE FOR NIKKI HALEY, WHAT DO THEY DO? PARTICIPATE IN THE 6% TO 8% OF THE VOTERS IN THIS NATION THAT WILL DECIDE THE ELECTION, DECIDE THE PRESIDENCY IN NOVEMBER. WE KNOW IT COMES DOWN TO THE PERSUADABLE VOTERS. NOT ALL INDEPENDENTS. SOME SOFT DISAFFECTED REPUBLICANS. DEMOCRATS WHO HAVE QUESTIONS AND INDEPENDENTS, 6% TO 8% OF THE COUNTRY WILL DECIDE THIS ELECTION. AND TO THE QUESTION OF CONVICTION, A CONVICTION COULD MOVE THOSE 6% TO 8% VERY"
    }
}